[
    {
        "text": "Last night on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "This could be the moment that saves you or sends you home.",
        "extra_info": ""
    },
    {
        "text": "Jonathan and Adele faced off in an elimination challenge.",
        "extra_info": ""
    },
    {
        "text": "It's nerve-wrecking.",
        "extra_info": ""
    },
    {
        "text": "And for Adele the journey ended.",
        "extra_info": ""
    },
    {
        "text": "I am proud with who I am and what I've done.",
        "extra_info": ""
    },
    {
        "text": "Tonight, Gary and George get the party started with another MasterClass.",
        "extra_info": ""
    },
    {
        "text": "So, pay attention.",
        "extra_info": ""
    },
    {
        "text": "First up, George puts his own twist on a gourmet burger.",
        "extra_info": ""
    },
    {
        "text": "It's glorious.",
        "extra_info": ""
    },
    {
        "text": "Then, Gary serves up sausage rolls, donuts, and a classy white sausage with truffles.",
        "extra_info": ""
    },
    {
        "text": "I'll be there at that party for sure.",
        "extra_info": ""
    },
    {
        "text": "Plus.",
        "extra_info": ""
    },
    {
        "text": "Welcome to Sake restaurant.",
        "extra_info": ""
    },
    {
        "text": "Matt joins chef Shaun Presland to learn the art of cooking Japanese.",
        "extra_info": ""
    },
    {
        "text": "A lot of people try to overcomplicate making Japanese dishes.",
        "extra_info": ""
    },
    {
        "text": "It's incredibly easy to make.",
        "extra_info": ""
    },
    {
        "text": "MasterClass is great because we've got two of the really top chefs in the country",
        "extra_info": ""
    },
    {
        "text": "sitting with us one on one and teaching us how to cook some of their favorite dishes.",
        "extra_info": ""
    },
    {
        "text": "It's really just about us and food.",
        "extra_info": ""
    },
    {
        "text": "MasterClass is one of the best parts of the week.",
        "extra_info": ""
    },
    {
        "text": "You get to actually sit back and get a little bit of knowledge from them.",
        "extra_info": ""
    },
    {
        "text": "Welcome to MasterClass.",
        "extra_info": ""
    },
    {
        "text": "Sigh of relief.",
        "extra_info": ""
    },
    {
        "text": "Big week.",
        "extra_info": ""
    },
    {
        "text": "We've had some of the toughest challenges we've seen on the show",
        "extra_info": ""
    },
    {
        "text": "since its inception.",
        "extra_info": ""
    },
    {
        "text": "You guys had to cater for young Phoebe's ninth birthday party.",
        "extra_info": ""
    },
    {
        "text": "It was a massive, massive day.",
        "extra_info": ""
    },
    {
        "text": "I really liked the prawns.",
        "extra_info": ""
    },
    {
        "text": "I made it myself.",
        "extra_info": ""
    },
    {
        "text": "Unfortunately this week we lost two people.",
        "extra_info": ""
    },
    {
        "text": "Kate went home after serving up raw chicken in the pressure test.",
        "extra_info": ""
    },
    {
        "text": "I tried.",
        "extra_info": ""
    },
    {
        "text": "And then Adele, she went home last night",
        "extra_info": ""
    },
    {
        "text": "after losing out to Jonathan in the elimination round.",
        "extra_info": ""
    },
    {
        "text": "Jonathan. You thing Adele's gonna be missed?",
        "extra_info": ""
    },
    {
        "text": "Yeah, she was like a mama in the house and I think it's...",
        "extra_info": ""
    },
    {
        "text": "it's really upsetting to think that mama's left.",
        "extra_info": ""
    },
    {
        "text": "In front of us are the twenty top amateur cooks of this country,",
        "extra_info": ""
    },
    {
        "text": "still here, fighting.",
        "extra_info": ""
    },
    {
        "text": "We've been watching all of you guys this week",
        "extra_info": ""
    },
    {
        "text": "and we handpicked four of you that are gonna go off",
        "extra_info": ""
    },
    {
        "text": "and have a little private MasterClass.",
        "extra_info": ""
    },
    {
        "text": "The chef that everyone's talking about at the moment here in Sydney",
        "extra_info": ""
    },
    {
        "text": "is a chef called Shaun Presland.",
        "extra_info": ""
    },
    {
        "text": "He's got an establishment called Sake restaurant,",
        "extra_info": ""
    },
    {
        "text": "and he's a master in Japanese cuisine.",
        "extra_info": ""
    },
    {
        "text": "The first person that we'd like to send to this little one on one MasterClass",
        "extra_info": ""
    },
    {
        "text": "is Courtney.",
        "extra_info": ""
    },
    {
        "text": "You were in that off-site challenge, doing those salt pepper squid,",
        "extra_info": ""
    },
    {
        "text": "we can see that this girl, she's got it. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "Next person that we'd like to send is Callum.",
        "extra_info": ""
    },
    {
        "text": "Did well in the off-site challenge, you rocked, man. You really did.",
        "extra_info": ""
    },
    {
        "text": "And we wanna send you to this little MasterClass.",
        "extra_info": ""
    },
    {
        "text": "- Well done. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "The next person we'd like to send is Carrie.",
        "extra_info": ""
    },
    {
        "text": "We actually think you need a little bit of help in Japanese.",
        "extra_info": ""
    },
    {
        "text": "You were in the bottom three in the Japanese invention test,",
        "extra_info": ""
    },
    {
        "text": "we think this could really give you a little help with little Japanese techniques.",
        "extra_info": ""
    },
    {
        "text": "- Thank you. - Enjoy.",
        "extra_info": ""
    },
    {
        "text": "Matthew, you've done pretty good. Good burger,",
        "extra_info": ""
    },
    {
        "text": "did well in the off-site challenge,",
        "extra_info": ""
    },
    {
        "text": "but we think this might just give you a little bit of a rev up,",
        "extra_info": ""
    },
    {
        "text": "you know, give you some new skills as well,",
        "extra_info": ""
    },
    {
        "text": "and come back and get back into it.",
        "extra_info": ""
    },
    {
        "text": "Alright, well done, Matthew.",
        "extra_info": ""
    },
    {
        "text": "Shaun Presland is waiting for you at Sake restaurant.",
        "extra_info": ""
    },
    {
        "text": "Off you go. Learn heaps. Bring us back a little sushi maybe, yeah?",
        "extra_info": ""
    },
    {
        "text": "But have lots of fun, yeah? Good luck.",
        "extra_info": ""
    },
    {
        "text": "Shaun Presland is an amazing chef and I just can't wait to get there and learn from him.",
        "extra_info": ""
    },
    {
        "text": "Sake restaurant really is one of the hot spots of Sydney.",
        "extra_info": ""
    },
    {
        "text": "Now I've got MasterChef apron, I can get in there",
        "extra_info": ""
    },
    {
        "text": "and really find out what's going on in the kitchen.",
        "extra_info": ""
    },
    {
        "text": "Okay, guys, next up, we're gonna look at the start of the week,",
        "extra_info": ""
    },
    {
        "text": "when you guys had to do the mystery box challenge.",
        "extra_info": ""
    },
    {
        "text": "So you lifted the lids and there you had it. You had burger buns.",
        "extra_info": ""
    },
    {
        "text": "Who would've thought, the MasterChef kitchen and you had to produce",
        "extra_info": ""
    },
    {
        "text": "a gourmet burger.",
        "extra_info": ""
    },
    {
        "text": "The winner of course is Marion.",
        "extra_info": ""
    },
    {
        "text": "You cooked a Duck... what was it called?",
        "extra_info": ""
    },
    {
        "text": "- Duck Duck Pig. - Duck Duck Pig burger.",
        "extra_info": ""
    },
    {
        "text": "So you had duck skin and you had the pork and duck burger itself.",
        "extra_info": ""
    },
    {
        "text": "All three of us just absolutely loved that one, it was fantastic.",
        "extra_info": ""
    },
    {
        "text": "Jonathan went a little bit left of center, and tried to do a rabbit burger.",
        "extra_info": ""
    },
    {
        "text": "Didn't quite work. Didn't have time to cook it all the way through,",
        "extra_info": ""
    },
    {
        "text": "and we questioned whether or not there was enough of fat in the rabbit to make it good.",
        "extra_info": ""
    },
    {
        "text": "Yeah, there were some good burgers and there were some bad burgers on the day.",
        "extra_info": ""
    },
    {
        "text": "But now I'm gonna show you my version of a hamburger",
        "extra_info": ""
    },
    {
        "text": "with a few little twists and turns.",
        "extra_info": ""
    },
    {
        "text": "I've got a feeling it's not something that you put between two slices of bread.",
        "extra_info": ""
    },
    {
        "text": "No.",
        "extra_info": ""
    },
    {
        "text": "It's lots of little things happening on this plate,",
        "extra_info": ""
    },
    {
        "text": "you're gonna get a beautiful meatloaf",
        "extra_info": ""
    },
    {
        "text": "with of course an egg in it, like a meatloaf should be.",
        "extra_info": ""
    },
    {
        "text": "You're gonna get a beetroot puree, that's just spiced with a little bit of feta.",
        "extra_info": ""
    },
    {
        "text": "Sun-dried tomatoes, as well as that you're gonna go some beer-battered onion rings",
        "extra_info": ""
    },
    {
        "text": "and batter bits.",
        "extra_info": ""
    },
    {
        "text": "Right guys, first step is to make the meatloaf.",
        "extra_info": ""
    },
    {
        "text": "So, a good quality A-grade beef mince, that's 400 grams.",
        "extra_info": ""
    },
    {
        "text": "A third of a cup of breadcrumbs.",
        "extra_info": ""
    },
    {
        "text": "You know, what I've got here is really interesting, but it's called wild rice.",
        "extra_info": ""
    },
    {
        "text": "It's actually not a member of the rice family, it's a grain-producing grass,",
        "extra_info": ""
    },
    {
        "text": "and actually grows in ponds and lakes in North America.",
        "extra_info": ""
    },
    {
        "text": "I've boiled these for about 30 minutes just in water, no salt at all.",
        "extra_info": ""
    },
    {
        "text": "And the reason why is if you put salt in the water,",
        "extra_info": ""
    },
    {
        "text": "it actually retards the skin and makes it really chewy.",
        "extra_info": ""
    },
    {
        "text": "Alright, so no salt into the water.",
        "extra_info": ""
    },
    {
        "text": "About a cupful.",
        "extra_info": ""
    },
    {
        "text": "We've got some capers. About two tablespoons.",
        "extra_info": ""
    },
    {
        "text": "And that's gonna add a nice saltiness to the meatloaf.",
        "extra_info": ""
    },
    {
        "text": "We've got some shredded parsley.",
        "extra_info": ""
    },
    {
        "text": "Next thing to go in is two eggs. And that's just there to bind",
        "extra_info": ""
    },
    {
        "text": "the mixture together.",
        "extra_info": ""
    },
    {
        "text": "We've also got some flavorings. We're gonna add",
        "extra_info": ""
    },
    {
        "text": "some whole-grain mustard.",
        "extra_info": ""
    },
    {
        "text": "So, a tablespoon of that.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna also add some toasted sesame seeds, about two tablespoons worth.",
        "extra_info": ""
    },
    {
        "text": "And next, I've got bonito flakes.",
        "extra_info": ""
    },
    {
        "text": "Bonito's a fish, it's part of the tuna family, and it's sort of a cross between",
        "extra_info": ""
    },
    {
        "text": "tuna and mackerel.",
        "extra_info": ""
    },
    {
        "text": "So I add a teaspoon of bonito flakes.",
        "extra_info": ""
    },
    {
        "text": "That's gonna make the meat a lot more meatier in flavor.",
        "extra_info": ""
    },
    {
        "text": "Last step, sea salt.",
        "extra_info": ""
    },
    {
        "text": "And a good helping of that.",
        "extra_info": ""
    },
    {
        "text": "Now, what we have to do is to incorporate it all",
        "extra_info": ""
    },
    {
        "text": "and make sure it's the right consistency.",
        "extra_info": ""
    },
    {
        "text": "The consistency I'm looking for is that sort of Play-Doh consistency, you know,",
        "extra_info": ""
    },
    {
        "text": "you want it to form, come together, and sort of hold itself.",
        "extra_info": ""
    },
    {
        "text": "Not be too dry, but not bee too wet, it's that balance,",
        "extra_info": ""
    },
    {
        "text": "if it is too wet, you just add a bit more breadcrumb to it,",
        "extra_info": ""
    },
    {
        "text": "and that will soak up any moisture, but for me this is just perfect.",
        "extra_info": ""
    },
    {
        "text": "So my metloaf mixture is ready to go.",
        "extra_info": ""
    },
    {
        "text": "Next step is to make the meatloaf.",
        "extra_info": ""
    },
    {
        "text": "Right, guys, what I've got here is just some jamon, some",
        "extra_info": ""
    },
    {
        "text": "beautiful spanish jamon, flavorsome, you know, you can use pancetta,",
        "extra_info": ""
    },
    {
        "text": "or prosciutto, really thinly sliced. Why I chose jamon, cause a little bit more mild,",
        "extra_info": ""
    },
    {
        "text": "not so salty as the prosciutto.",
        "extra_info": ""
    },
    {
        "text": "What we wanna basically do is form a nice slab of mixture,",
        "extra_info": ""
    },
    {
        "text": "three quarters way up the ham.",
        "extra_info": ""
    },
    {
        "text": "Right, I've got boiled eggs.",
        "extra_info": ""
    },
    {
        "text": "Now what I'm doing is basically top and tailing the whole eggs.",
        "extra_info": ""
    },
    {
        "text": "Cause what I wanna do, I need to join this.",
        "extra_info": ""
    },
    {
        "text": "So basically when I slice into this, I wanna see the egg in the middle.",
        "extra_info": ""
    },
    {
        "text": "Okay. Now, the fun bit. Rolling it up. Wish me luck.",
        "extra_info": ""
    },
    {
        "text": "it's really important that you get it nice and tight. Really, really important.",
        "extra_info": ""
    },
    {
        "text": "Cause you want this to be perfect and round.",
        "extra_info": ""
    },
    {
        "text": "Alright. At that point I'm happy. Really, really happy.",
        "extra_info": ""
    },
    {
        "text": "I've got some heavy-duty, sort of kitchen-grade plastic wrap.",
        "extra_info": ""
    },
    {
        "text": "Alright, it's a little bit thicker. It can take, you know, high heats.",
        "extra_info": ""
    },
    {
        "text": "And of course, it's a little bit wider as well.",
        "extra_info": ""
    },
    {
        "text": "- Yes, Joanne? - If you can't get that plastic wrap,",
        "extra_info": ""
    },
    {
        "text": "can you use just a normal... - You can, but you'll need a load of it.",
        "extra_info": ""
    },
    {
        "text": "Yeah, make a few layers? Okay.",
        "extra_info": ""
    },
    {
        "text": "Alright. Next step is to cryovac this meatloaf,",
        "extra_info": ""
    },
    {
        "text": "so we'll be using the cryovac machine.",
        "extra_info": ""
    },
    {
        "text": "To remove all the air and seal this bag.",
        "extra_info": ""
    },
    {
        "text": "If you don't have a cryovac machine, take your wrapped-up meatloaf,",
        "extra_info": ""
    },
    {
        "text": "and pop that into a ziplock bag.",
        "extra_info": ""
    },
    {
        "text": "Beautiful. Done.",
        "extra_info": ""
    },
    {
        "text": "Now, next step, we need to cook it. Waterbath, 68 degrees,",
        "extra_info": ""
    },
    {
        "text": "that goes in, timer on for 40 minutes.",
        "extra_info": ""
    },
    {
        "text": "And that will be cooked beautifully.",
        "extra_info": ""
    },
    {
        "text": "If you don't have a water bath at home, maybe get a fish poacher,",
        "extra_info": ""
    },
    {
        "text": "or a big pot. Fill it up with water, pop an old-school thermometer in it,",
        "extra_info": ""
    },
    {
        "text": "nothing wrong with that.",
        "extra_info": ""
    },
    {
        "text": "Next step, what's a burger without beetroot, come on, all us Aussies sitting here.",
        "extra_info": ""
    },
    {
        "text": "I love beetroot. But what we're gonna do is make a beatroot and feta dip, so to speak.",
        "extra_info": ""
    },
    {
        "text": "We've basically taken whole beetroots, wrap them up in foil,",
        "extra_info": ""
    },
    {
        "text": "a little bit of sea salt, little bit of olive oil, and baked them in an oven",
        "extra_info": ""
    },
    {
        "text": "at about 160 degrees for about a hour and a half.",
        "extra_info": ""
    },
    {
        "text": "We've taken them out of the oven, we've let them cool down,",
        "extra_info": ""
    },
    {
        "text": "we've peeled the skin, and just blended it up.",
        "extra_info": ""
    },
    {
        "text": "Some feta. And this is gonna add some nice saltiness and creaminess to it.",
        "extra_info": ""
    },
    {
        "text": "Squeeze in the old fella, some olive oil.",
        "extra_info": ""
    },
    {
        "text": "That's our beetroot and feta dip made, so that's our beetroot component.",
        "extra_info": ""
    },
    {
        "text": "What's a hamburger without a sesame seed bun?",
        "extra_info": ""
    },
    {
        "text": "Well. I've taken the humble sesame seed bun, and I've toasted it.",
        "extra_info": ""
    },
    {
        "text": "And then I've popped these into the freezer.",
        "extra_info": ""
    },
    {
        "text": "I've then blended them while they're frozen into a powder.",
        "extra_info": ""
    },
    {
        "text": "Alright?",
        "extra_info": ""
    },
    {
        "text": "So that forms my hamburger bun soil.",
        "extra_info": ""
    },
    {
        "text": "We call this a soil, cause it resembles the texture of soil.",
        "extra_info": ""
    },
    {
        "text": "Nice little flavor, it's gonna add a real complexity into this dish.",
        "extra_info": ""
    },
    {
        "text": "After the break.",
        "extra_info": ""
    },
    {
        "text": "So we've got that beautiful egg in the center.",
        "extra_info": ""
    },
    {
        "text": "George serves his five-star gourmet burger.",
        "extra_info": ""
    },
    {
        "text": "Last but not least, the onion rings go on the plate.",
        "extra_info": ""
    },
    {
        "text": "Then later.",
        "extra_info": ""
    },
    {
        "text": "That's the beauty of Japanese food.",
        "extra_info": ""
    },
    {
        "text": "As complex as it tastes, it's incredibly easy to make.",
        "extra_info": ""
    },
    {
        "text": "The basics for cooking Japanese with star chef Shaun Presland.",
        "extra_info": ""
    },
    {
        "text": "Plus.",
        "extra_info": ""
    },
    {
        "text": "Gee, they look great, don't they?",
        "extra_info": ""
    },
    {
        "text": "You've gotta have a tomato sauce, eh?",
        "extra_info": ""
    },
    {
        "text": "Gary has easy to prepare food for a kids' party.",
        "extra_info": ""
    },
    {
        "text": "That looks pretty adult and absolutely gorgeous.",
        "extra_info": ""
    },
    {
        "text": "Right, guys, so this meatloaf has been in the water bath for forty minutes",
        "extra_info": ""
    },
    {
        "text": "at 68 degrees. We've removed it from the water bath",
        "extra_info": ""
    },
    {
        "text": "and placed that in the fridge to cool down.",
        "extra_info": ""
    },
    {
        "text": "We removed the meatloaf from the cryovac bag,",
        "extra_info": ""
    },
    {
        "text": "and this is where we pray again, hoping it's gonna look beautiful inside.",
        "extra_info": ""
    },
    {
        "text": "So we've got that beautiful egg in the center,",
        "extra_info": ""
    },
    {
        "text": "not overcooked in any way, shape or form,",
        "extra_info": ""
    },
    {
        "text": "beautiful nice and pink meat. It's not brown looking",
        "extra_info": ""
    },
    {
        "text": "even though it's cooked through.",
        "extra_info": ""
    },
    {
        "text": "Really important, there's nothing worse than going to a restaurant",
        "extra_info": ""
    },
    {
        "text": "and you're gonna cut into your entree, and you find clean film.",
        "extra_info": ""
    },
    {
        "text": "There is nothing worse.",
        "extra_info": ""
    },
    {
        "text": "And trust me, it's happened in my restaurant",
        "extra_info": ""
    },
    {
        "text": "and I nearly killed someone. Alright?",
        "extra_info": ""
    },
    {
        "text": "People don't pay for that stuff.",
        "extra_info": ""
    },
    {
        "text": "Onto a plate.",
        "extra_info": ""
    },
    {
        "text": "Just to dress it, and we wanna gloss it up, give it some sexiness.",
        "extra_info": ""
    },
    {
        "text": "Little bit of olive oil, and we just glaze that up.",
        "extra_info": ""
    },
    {
        "text": "That looks beautiful.",
        "extra_info": ""
    },
    {
        "text": "Right, time to plate up our inspiration of a hamburger,",
        "extra_info": ""
    },
    {
        "text": "but before we do that, we need to make some onion rings, and",
        "extra_info": ""
    },
    {
        "text": "Gaz, I heard you're the expert in onion rings.",
        "extra_info": ""
    },
    {
        "text": "- You want them set out? - This is actually your recipe,",
        "extra_info": ""
    },
    {
        "text": "that you gave to me and I love it. 150 grams of corn flour,",
        "extra_info": ""
    },
    {
        "text": "150 grams of self-raising flour, 300 mils of beer,",
        "extra_info": ""
    },
    {
        "text": "and a half teaspoon of bicarb soda. And you just mix it all together.",
        "extra_info": ""
    },
    {
        "text": "Alright. So we put the dry ingredients together.",
        "extra_info": ""
    },
    {
        "text": "So that's the corn flour going into the flour, and then the bicarb.",
        "extra_info": ""
    },
    {
        "text": "A pinch of salt, which is important.",
        "extra_info": ""
    },
    {
        "text": "And that's self-raising flour, not plain flour.",
        "extra_info": ""
    },
    {
        "text": "If you're using plain flour, you just add a teaspoon of baking powder.",
        "extra_info": ""
    },
    {
        "text": "You add a little bit of the beer into the middle",
        "extra_info": ""
    },
    {
        "text": "and you just create that batter in a well,",
        "extra_info": ""
    },
    {
        "text": "and then you just slowly add all the liquid,",
        "extra_info": ""
    },
    {
        "text": "and draw the dry ingredients into that paste.",
        "extra_info": ""
    },
    {
        "text": "And really you're just making that batter to consistency of thick cream.",
        "extra_info": ""
    },
    {
        "text": "And you can use that for fish, prawns, scallops, vegetables.",
        "extra_info": ""
    },
    {
        "text": "Pickles. Fried pickles.",
        "extra_info": ""
    },
    {
        "text": "We've got to put those little onion rings, and beautiful little onion rings they are.",
        "extra_info": ""
    },
    {
        "text": "Gotta toss them in flour. The reason you toss them in flour is if you didn't",
        "extra_info": ""
    },
    {
        "text": "when you put them in the batter, all the batter would slip off,",
        "extra_info": ""
    },
    {
        "text": "as soon as you put them in the frier.",
        "extra_info": ""
    },
    {
        "text": "So we're just gonna toss them in the batter itself,",
        "extra_info": ""
    },
    {
        "text": "and then just drop them in",
        "extra_info": ""
    },
    {
        "text": "one at a time,",
        "extra_info": ""
    },
    {
        "text": "and allow them to separate off into the oil.",
        "extra_info": ""
    },
    {
        "text": "And we just want a light coating.",
        "extra_info": ""
    },
    {
        "text": "That oil is about 170 degrees.",
        "extra_info": ""
    },
    {
        "text": "A good frying temperature for most things if you want a crisp batter,",
        "extra_info": ""
    },
    {
        "text": "is around 170 to 185. Depending on how big the item is,",
        "extra_info": ""
    },
    {
        "text": "how quickly it's gonna cook.",
        "extra_info": ""
    },
    {
        "text": "So these little onion rings are looking good.",
        "extra_info": ""
    },
    {
        "text": "Nice golden brown, nice and crisp.",
        "extra_info": ""
    },
    {
        "text": "- The few little battery bits, George. - Yum.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna start plating this burger up.",
        "extra_info": ""
    },
    {
        "text": "What we've got here is just some pickled onions.",
        "extra_info": ""
    },
    {
        "text": "Little drizzle of olive oil. The same with cornichons. They are my ultimate favorite.",
        "extra_info": ""
    },
    {
        "text": "Cornichon is a baby cucumber that's been pickled or a gherkin.",
        "extra_info": ""
    },
    {
        "text": "A little bit more olive oil for glossiness.",
        "extra_info": ""
    },
    {
        "text": "Our beetroot we're just gonna pop into...",
        "extra_info": ""
    },
    {
        "text": "a piping bag.",
        "extra_info": ""
    },
    {
        "text": "Snip the end,",
        "extra_info": ""
    },
    {
        "text": "and we start to plate up here.",
        "extra_info": ""
    },
    {
        "text": "Next step is to put our meatloaf on the plate.",
        "extra_info": ""
    },
    {
        "text": "Now these tomatoes, they've just been cut in half, sea salt,",
        "extra_info": ""
    },
    {
        "text": "a little bit of thyme leaf, and then in an oven, 100 degrees for about 40 minutes.",
        "extra_info": ""
    },
    {
        "text": "The next thing to go on the plate is our pickled onions.",
        "extra_info": ""
    },
    {
        "text": "And our cornichons, our baby gherkins.",
        "extra_info": ""
    },
    {
        "text": "And then of course our sesame seed bun soil.",
        "extra_info": ""
    },
    {
        "text": "This is the bread element to the dish.",
        "extra_info": ""
    },
    {
        "text": "Right.",
        "extra_info": ""
    },
    {
        "text": "And of course, a few little cresses.",
        "extra_info": ""
    },
    {
        "text": "Last but not least, the onion rings go on the plate.",
        "extra_info": ""
    },
    {
        "text": "And then all of these little battered bits, which are texturally...",
        "extra_info": ""
    },
    {
        "text": "unbelievable.",
        "extra_info": ""
    },
    {
        "text": "They're just beautiful. They go in there as well.",
        "extra_info": ""
    },
    {
        "text": "Right. So this is my inspiration from the hamburger challenge,",
        "extra_info": ""
    },
    {
        "text": "basically in essence we've made a meatloaf.",
        "extra_info": ""
    },
    {
        "text": "A meatloaf with a few little interesting flavors and spices,",
        "extra_info": ""
    },
    {
        "text": "a beetroot and feta dip, and of course those beutiful onion rings.",
        "extra_info": ""
    },
    {
        "text": "Claire, Dominic and Sharnee. Come up and taste.",
        "extra_info": ""
    },
    {
        "text": "Cheers.",
        "extra_info": ""
    },
    {
        "text": "Sharnee, tuck in. Make sure you get a bit of everything, yeah?",
        "extra_info": ""
    },
    {
        "text": "Dominic.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna join you. Cause I wanna try a little bit.",
        "extra_info": ""
    },
    {
        "text": "See how it tastes, George.",
        "extra_info": ""
    },
    {
        "text": "I love it. I love the color. They are really vibrant and fun.",
        "extra_info": ""
    },
    {
        "text": "I love it. I think the texture is definitely the standout thing.",
        "extra_info": ""
    },
    {
        "text": "Dominic, what do you think?",
        "extra_info": ""
    },
    {
        "text": "Hard to pick up in your hands and eat.",
        "extra_info": ""
    },
    {
        "text": "A little bit.",
        "extra_info": ""
    },
    {
        "text": "But apart from that, everything else was just fantastic.",
        "extra_info": ""
    },
    {
        "text": "There's lots of versatile techniques in this dish,",
        "extra_info": ""
    },
    {
        "text": "that you guys can use.",
        "extra_info": ""
    },
    {
        "text": "- Can't use it in a drive-through tho. - No.",
        "extra_info": ""
    },
    {
        "text": "Can I order one of them?",
        "extra_info": ""
    },
    {
        "text": "Okay, guys, go and sit back down.",
        "extra_info": ""
    },
    {
        "text": "My top tips to make a burger. That meatloaf, cook it at low temperature.",
        "extra_info": ""
    },
    {
        "text": "In turn that will help that egg inside not to overcook and go brown.",
        "extra_info": ""
    },
    {
        "text": "Number two, make sure you wrap the meatloaf with lots of clean film,",
        "extra_info": ""
    },
    {
        "text": "and that will assist when you cook it. You'll get even temperature,",
        "extra_info": ""
    },
    {
        "text": "and you won't overcook that egg.",
        "extra_info": ""
    },
    {
        "text": "Top tip number three, beetroot and feta dip.",
        "extra_info": ""
    },
    {
        "text": "Simple. Beetroots, roasted, make sure they cook through.",
        "extra_info": ""
    },
    {
        "text": "If it's a puree, it's gotta be nice and silky smooth.",
        "extra_info": ""
    },
    {
        "text": "This dish isn't about being too clever, it's about taking something so humble",
        "extra_info": ""
    },
    {
        "text": "like the yummy delicious burger, but still making something yummy on the plate.",
        "extra_info": ""
    },
    {
        "text": "Taking all those elements with a little bit of skill and some refinement,",
        "extra_info": ""
    },
    {
        "text": "producing a dish worthy to sit in a good restaurant",
        "extra_info": ""
    },
    {
        "text": "or be served in a great function.",
        "extra_info": ""
    },
    {
        "text": "- Drained. - Next on MasterClass.",
        "extra_info": ""
    },
    {
        "text": "This is the medium tofu. It's the best one to fry.",
        "extra_info": ""
    },
    {
        "text": "A Japanese classic that's incredibly easy to prepare.",
        "extra_info": ""
    },
    {
        "text": "- Now that's done. Agedashi tofu. - Fantastic.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna be one of the four to be involved in the MasterClass with Shaun Presland.",
        "extra_info": ""
    },
    {
        "text": "Walking into Sake restaurant, first thing I notice",
        "extra_info": ""
    },
    {
        "text": "other than the beautiful big restaurant, was that Matt Preston is standing there",
        "extra_info": ""
    },
    {
        "text": "and his quite striking aqua pants. Wasn't expecting to see him.",
        "extra_info": ""
    },
    {
        "text": "Welcome to Sake restaurant. A surprise to see me here, I think, but",
        "extra_info": ""
    },
    {
        "text": "this is where I live. As a food writer, trying to find great places",
        "extra_info": ""
    },
    {
        "text": "to tell people about.",
        "extra_info": ""
    },
    {
        "text": "Guys, I'd now like to introduce you to the executive chef at Sake restaurant,",
        "extra_info": ""
    },
    {
        "text": "Shaun Presland.",
        "extra_info": ""
    },
    {
        "text": "- Hi Shaun, how're you doing? - Nice to meet you.",
        "extra_info": ""
    },
    {
        "text": "Pleased to meet you.",
        "extra_info": ""
    },
    {
        "text": "Japanese food's all about being fresh.",
        "extra_info": ""
    },
    {
        "text": "My cooking style is trying to keep things simple.",
        "extra_info": ""
    },
    {
        "text": "Let the food speak for itself.",
        "extra_info": ""
    },
    {
        "text": "Who better to give you an exclusive intimate MasterClass with the essentials",
        "extra_info": ""
    },
    {
        "text": "of the Japanese kitchen, than the man who moved to Japan 17 years ago?",
        "extra_info": ""
    },
    {
        "text": "Even though Shaun is not Japanese, he's had 17 years",
        "extra_info": ""
    },
    {
        "text": "studying and working with Japanese cuisine.",
        "extra_info": ""
    },
    {
        "text": "That's such a untapped resource that we're now here to learn from.",
        "extra_info": ""
    },
    {
        "text": "Shaun, why did you make that crazy move?",
        "extra_info": ""
    },
    {
        "text": "I was intoxicated by the cuisine and the culture,",
        "extra_info": ""
    },
    {
        "text": "and everything Japanese.",
        "extra_info": ""
    },
    {
        "text": "It just drew me and seduced me.",
        "extra_info": ""
    },
    {
        "text": "Well Shaun, let's take Courtney, Carrie, Matthew and Callum into the kitchen,",
        "extra_info": ""
    },
    {
        "text": "and seduce them.",
        "extra_info": ""
    },
    {
        "text": "Let's go. This way please.",
        "extra_info": ""
    },
    {
        "text": "Even though I won the Japanese invention test,",
        "extra_info": ""
    },
    {
        "text": "I don't pretend to know that much about Japanese food,",
        "extra_info": ""
    },
    {
        "text": "and there's so much that I still need to learn so this is a great opportunity.",
        "extra_info": ""
    },
    {
        "text": "Alright. Today we're talking about tofu. Basically there's three main types of tofu.",
        "extra_info": ""
    },
    {
        "text": "The silken tofu. A momen tofu, which is, means cotton, semi-soft.",
        "extra_info": ""
    },
    {
        "text": "And a hard tofu. All made from soy beans that have been boiled.",
        "extra_info": ""
    },
    {
        "text": "You can see, very jelly, not so jelly, very hard.",
        "extra_info": ""
    },
    {
        "text": "So Shaun, what are we gonna do with this fantastic tofu?",
        "extra_info": ""
    },
    {
        "text": "We're gonna do Agedashi Tofu.",
        "extra_info": ""
    },
    {
        "text": "We're gonna crumb it in potato starch, give it a lovely coating,",
        "extra_info": ""
    },
    {
        "text": "and then deep fry it at 170 degrees.",
        "extra_info": ""
    },
    {
        "text": "So the essence of good Agedashi would be what, that contrast between two textures?",
        "extra_info": ""
    },
    {
        "text": "The crunchy outside, beautiful creamy soft inside, a lovely dipping sauce,",
        "extra_info": ""
    },
    {
        "text": "some aromatics, so we're using some ginger and some scallions.",
        "extra_info": ""
    },
    {
        "text": "We've got some grated radish. Radish is good, because in the sauce it will",
        "extra_info": ""
    },
    {
        "text": "bind the sauce together.",
        "extra_info": ""
    },
    {
        "text": "Another reason we have radish is it aids in digesting oils,",
        "extra_info": ""
    },
    {
        "text": "so we're gonna put something in the fryer, we want some radish to clean our system out",
        "extra_info": ""
    },
    {
        "text": "so that oil doesn't stay in our bodies.",
        "extra_info": ""
    },
    {
        "text": "There's always a story behind everything in Japanese food.",
        "extra_info": ""
    },
    {
        "text": "Very healthy way to eat.",
        "extra_info": ""
    },
    {
        "text": "So let's go.",
        "extra_info": ""
    },
    {
        "text": "Yeah, alright.",
        "extra_info": ""
    },
    {
        "text": "This potato starch, I like a chunky one. it's kind of unrefined.",
        "extra_info": ""
    },
    {
        "text": "This tofu's been drained.",
        "extra_info": ""
    },
    {
        "text": "Just confirming, is that the medium tofu that you showed us before?",
        "extra_info": ""
    },
    {
        "text": "This is the medium tofu. It's the best one to fry.",
        "extra_info": ""
    },
    {
        "text": "And the soft one's gonna fall apart. The hard one's not gonna",
        "extra_info": ""
    },
    {
        "text": "take as much flavor and it's not gonna be creamy in the center, so definitely.",
        "extra_info": ""
    },
    {
        "text": "Could you use anything else to coat the tofu?",
        "extra_info": ""
    },
    {
        "text": "If you didn't have potato starch for example?",
        "extra_info": ""
    },
    {
        "text": "You can use corn flour, you can use flour,",
        "extra_info": ""
    },
    {
        "text": "to get the crunchiest outside, potato starch is the best.",
        "extra_info": ""
    },
    {
        "text": "So you're always using a dry flour or starch with agadashi,",
        "extra_info": ""
    },
    {
        "text": "there's never a batter, there's no egg coating?",
        "extra_info": ""
    },
    {
        "text": "- No. - Just simple as that.",
        "extra_info": ""
    },
    {
        "text": "Very simple. Very simple. I'm putting it in a fryer at 170.",
        "extra_info": ""
    },
    {
        "text": "Tempura normally fry at 180, but agadashi tofu at 170.",
        "extra_info": ""
    },
    {
        "text": "- Why is that? - I want it to cook a little bit slowly,",
        "extra_info": ""
    },
    {
        "text": "only to get a lovely brown golden fox color coating on the outside.",
        "extra_info": ""
    },
    {
        "text": "If you're cooking too hot, too quickly, it's just gonna burn.",
        "extra_info": ""
    },
    {
        "text": "That takes about four minutes to cook.",
        "extra_info": ""
    },
    {
        "text": "So, the tofu is frying, let's make the sauce.",
        "extra_info": ""
    },
    {
        "text": "Dipping sauce for agadashi tofu. Teaspoon of hondashi,",
        "extra_info": ""
    },
    {
        "text": "which is a dashi powder, into the bowl. A cup, 180 mil, of boiling water.",
        "extra_info": ""
    },
    {
        "text": "Give it a little stir.",
        "extra_info": ""
    },
    {
        "text": "And voila, instant dashi. Six parts dashi,",
        "extra_info": ""
    },
    {
        "text": "and say one part light soy, and one part mirin.",
        "extra_info": ""
    },
    {
        "text": "Give it a stir, it's nice and hot, and to that we're gonna add some grated radish.",
        "extra_info": ""
    },
    {
        "text": "Again, for digestion, and because you see, it gives like, they call it mizureni.",
        "extra_info": ""
    },
    {
        "text": "It almost looks like falling snow as it comes through the sauce.",
        "extra_info": ""
    },
    {
        "text": "So many japanese dishes are as simple as that.",
        "extra_info": ""
    },
    {
        "text": "That's the beauty of Japanese food. As complex as it tastes,",
        "extra_info": ""
    },
    {
        "text": "it's incredibly easy to make, and I love people try to overcomplicate",
        "extra_info": ""
    },
    {
        "text": "making Japanese dishes.",
        "extra_info": ""
    },
    {
        "text": "Not understanding it really is not that difficult.",
        "extra_info": ""
    },
    {
        "text": "Tofu's been in for about four to five minutes,",
        "extra_info": ""
    },
    {
        "text": "and if you look at the color, potato starch is lovely and crunchy.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna plate that up, just three pieces on the plate.",
        "extra_info": ""
    },
    {
        "text": "Lovely aromatics, we've got some ginger,",
        "extra_info": ""
    },
    {
        "text": "we've got some scallions.",
        "extra_info": ""
    },
    {
        "text": "Soy sauce.",
        "extra_info": ""
    },
    {
        "text": "Sort of over.",
        "extra_info": ""
    },
    {
        "text": "That's us done. Agadashi tofu.",
        "extra_info": ""
    },
    {
        "text": "It's fantastic.",
        "extra_info": ""
    },
    {
        "text": "Have a taste. On your experience, the crunchiness,",
        "extra_info": ""
    },
    {
        "text": "the smokiness of the stock, the ginger, the scallions,",
        "extra_info": ""
    },
    {
        "text": "all that's a bit of freshness to it, and you'll pick up all the flavors",
        "extra_info": ""
    },
    {
        "text": "on what was a blank canvas, which was the tofu, so enjoy.",
        "extra_info": ""
    },
    {
        "text": "Dig in.",
        "extra_info": ""
    },
    {
        "text": "Get stuck in, guys.",
        "extra_info": ""
    },
    {
        "text": "Make sure you get some ginger, some of that scallion on there.",
        "extra_info": ""
    },
    {
        "text": "I get the crunch from the potato starch instantly,",
        "extra_info": ""
    },
    {
        "text": "but it's not too overpowering, so the creaminess comes through immediately.",
        "extra_info": ""
    },
    {
        "text": "It's gorgeous.",
        "extra_info": ""
    },
    {
        "text": "So Shaun, talk three tips for perfect tofu.",
        "extra_info": ""
    },
    {
        "text": "Freshness of ingredients, temperature of your oil,",
        "extra_info": ""
    },
    {
        "text": "agadashi tofu 170. And serve it immediately,",
        "extra_info": ""
    },
    {
        "text": "so it's nice and crunchy.",
        "extra_info": ""
    },
    {
        "text": "- When we return. - And then what we're using is the puree.",
        "extra_info": ""
    },
    {
        "text": "And you can put in as much or as little as you want in there.",
        "extra_info": ""
    },
    {
        "text": "Kids' party food that's good for them.",
        "extra_info": ""
    },
    {
        "text": "They'll never know that they're being healthy",
        "extra_info": ""
    },
    {
        "text": "eating sausage rolls and tomato sauce.",
        "extra_info": ""
    },
    {
        "text": "Now let's look at the kids' birthday party challenge.",
        "extra_info": ""
    },
    {
        "text": "I'm sure you guys are still recovering.",
        "extra_info": ""
    },
    {
        "text": "It was a scorching hot day and your first out cater",
        "extra_info": ""
    },
    {
        "text": "and you looked after Phoebe's ninth birthday party.",
        "extra_info": ""
    },
    {
        "text": "Hi!",
        "extra_info": ""
    },
    {
        "text": "150 guests, half of them kids, and of course their parents.",
        "extra_info": ""
    },
    {
        "text": "And what we asked you to do is devise a menu",
        "extra_info": ""
    },
    {
        "text": "that the kids would love, and of course, the adults would love.",
        "extra_info": ""
    },
    {
        "text": "So it was tough. Tough call. So Daniel,",
        "extra_info": ""
    },
    {
        "text": "you had a disaster really, didn't you? You made sausage rolls.",
        "extra_info": ""
    },
    {
        "text": "I had some real trouble with the oven,",
        "extra_info": ""
    },
    {
        "text": "and basically there were burnt on the bottom.",
        "extra_info": ""
    },
    {
        "text": "The meat was cooked through, but they looked pretty average.",
        "extra_info": ""
    },
    {
        "text": "So, sausage roll is gonna be my first little show and tell.",
        "extra_info": ""
    },
    {
        "text": "Now, you know, we thought about the kids' food ourselves.",
        "extra_info": ""
    },
    {
        "text": "I've got a little daughter, she's nine,",
        "extra_info": ""
    },
    {
        "text": "and I've looked after every single birthday party that she's had.",
        "extra_info": ""
    },
    {
        "text": "Cakes included. And this is a lesson that I've learned cooking for my daughter,",
        "extra_info": ""
    },
    {
        "text": "is that all kids, unless they're exceptional kids,",
        "extra_info": ""
    },
    {
        "text": "they'll pick out and find every little vegetable that you put in something.",
        "extra_info": ""
    },
    {
        "text": "I remember my daughter picking out the tiniest bit of zucchini and going,",
        "extra_info": ""
    },
    {
        "text": "Ew, you put zucchini in there, I'm not eating it,",
        "extra_info": ""
    },
    {
        "text": "and it's just been dinner time turning into a disaster.",
        "extra_info": ""
    },
    {
        "text": "And I learned this little technique.",
        "extra_info": ""
    },
    {
        "text": "So I'm gonna show it to you, and we're gonna incorporate that",
        "extra_info": ""
    },
    {
        "text": "into our little party sausage roll.",
        "extra_info": ""
    },
    {
        "text": "George, go take a break, have a cup of tea.",
        "extra_info": ""
    },
    {
        "text": "I might bring back some tomato sauce for the sausage rolls.",
        "extra_info": ""
    },
    {
        "text": "Good idea.",
        "extra_info": ""
    },
    {
        "text": "Ok, the little veggie trick.",
        "extra_info": ""
    },
    {
        "text": "Grate vegetables and make a puree. And then fold the puree",
        "extra_info": ""
    },
    {
        "text": "into the sausage roll mix. It really works.",
        "extra_info": ""
    },
    {
        "text": "What I do is grate the carrot or pumpkin, for example,",
        "extra_info": ""
    },
    {
        "text": "a little bit of butter or oil.",
        "extra_info": ""
    },
    {
        "text": "Doesn't even need oil if you don't want to. It can be a little bit of water.",
        "extra_info": ""
    },
    {
        "text": "And then just put the grated vegetable into the pot, build a little bit of heat up,",
        "extra_info": ""
    },
    {
        "text": "stirring regularly, and then pop a lid on.",
        "extra_info": ""
    },
    {
        "text": "Now if you're doing a cauliflower puree, you can do it the exactly same way,",
        "extra_info": ""
    },
    {
        "text": "or you can cook it with a little bit of milk.",
        "extra_info": ""
    },
    {
        "text": "But shred finely. Whatever vegetable it is, shred it finely.",
        "extra_info": ""
    },
    {
        "text": "And that'll take about 4-5 minutes to really soften,",
        "extra_info": ""
    },
    {
        "text": "and then the secret there is to use a blender, puree it,",
        "extra_info": ""
    },
    {
        "text": "and puree it until it's really, really fine, so you don't have to parse it",
        "extra_info": ""
    },
    {
        "text": "or do anything more to it. And at the end of it,",
        "extra_info": ""
    },
    {
        "text": "you'll end up with a nice bright puree.",
        "extra_info": ""
    },
    {
        "text": "Okay, so the next thing we're gonna do is fry a little bit of onion.",
        "extra_info": ""
    },
    {
        "text": "And I'm gonna try and cut this nice and fine,",
        "extra_info": ""
    },
    {
        "text": "it'll just blend into the mince. And I want to cook it,",
        "extra_info": ""
    },
    {
        "text": "you don't have to cook it, but I notice when you cook it that",
        "extra_info": ""
    },
    {
        "text": "it will be just nice and soft in that sausage roll.",
        "extra_info": ""
    },
    {
        "text": "And remember, you should cook this only for a couple of minutes,",
        "extra_info": ""
    },
    {
        "text": "and then cool it down before mixing it with the mince",
        "extra_info": ""
    },
    {
        "text": "and the puree.",
        "extra_info": ""
    },
    {
        "text": "And the reason you cool it down is just before you've gotta be careful at every stage",
        "extra_info": ""
    },
    {
        "text": "not to warm the mixture up. Because it's a risk you know, every stage,",
        "extra_info": ""
    },
    {
        "text": "especially out catering, like you guys were,",
        "extra_info": ""
    },
    {
        "text": "of poisoning a lot of people if you're not careful.",
        "extra_info": ""
    },
    {
        "text": "So, onions into the oil, a little bit of garlic.",
        "extra_info": ""
    },
    {
        "text": "And then these little flavor dimensions,",
        "extra_info": ""
    },
    {
        "text": "even though we're cooking something for the kids,",
        "extra_info": ""
    },
    {
        "text": "if I cook kids' food, I eat it too, so I want a bit of flavor in there,",
        "extra_info": ""
    },
    {
        "text": "so I put some thyme and bayleaf, and a little pinch of salt,",
        "extra_info": ""
    },
    {
        "text": "just to start the whole seasoning process off.",
        "extra_info": ""
    },
    {
        "text": "So that's the onions done. And we just let those sit and cool off,",
        "extra_info": ""
    },
    {
        "text": "and all that's happened is that it's just become a little translucent and softened.",
        "extra_info": ""
    },
    {
        "text": "Next up, the actual sausage roll itself.",
        "extra_info": ""
    },
    {
        "text": "So I've got two types of mince, I've got a pork mince and a beef mince.",
        "extra_info": ""
    },
    {
        "text": "Equal quantities.",
        "extra_info": ""
    },
    {
        "text": "For this particular recipe, is it about 250 grams each?",
        "extra_info": ""
    },
    {
        "text": "Yeah, there is about 350 grams. That's quite a bit of mince,",
        "extra_info": ""
    },
    {
        "text": "350 grams each.",
        "extra_info": ""
    },
    {
        "text": "And you do need a little bit of fat in there, but that's actually,",
        "extra_info": ""
    },
    {
        "text": "that is actually quite lean.",
        "extra_info": ""
    },
    {
        "text": "And now what I'm using is the puree and you can put as much",
        "extra_info": ""
    },
    {
        "text": "or as little as you want in there, and that actually acts as a binding agent.",
        "extra_info": ""
    },
    {
        "text": "Don't need to put eggs in now.",
        "extra_info": ""
    },
    {
        "text": "Gonna put a bit of oregano, and salt, and I actually avoid putting pepper in,",
        "extra_info": ""
    },
    {
        "text": "if it's for children, only because not all kids like pepper.",
        "extra_info": ""
    },
    {
        "text": "And then add the cold, cooked onions to the meat mix.",
        "extra_info": ""
    },
    {
        "text": "I added breadcrumbs, about two cups of breadcrumbs in there.",
        "extra_info": ""
    },
    {
        "text": "And the reason I've done that, is because it's a fresh mince,",
        "extra_info": ""
    },
    {
        "text": "you'll get a little bit of fat leech out of it, you might have a bit of water,",
        "extra_info": ""
    },
    {
        "text": "also come out it, and that breadcrumb is just gonna keep it together,",
        "extra_info": ""
    },
    {
        "text": "and the reason that's important is any water or fat",
        "extra_info": ""
    },
    {
        "text": "is gonna break down your pastry in the sausage roll,",
        "extra_info": ""
    },
    {
        "text": "so you've just gotta be aware of that.",
        "extra_info": ""
    },
    {
        "text": "Don't forget you can use chicken mince, nice and easy,",
        "extra_info": ""
    },
    {
        "text": "veal mince, lamb mince, perfect, vegetarian,",
        "extra_info": ""
    },
    {
        "text": "I'd use something like ricotta which is a good base",
        "extra_info": ""
    },
    {
        "text": "and then whatever you're gonna load into it.",
        "extra_info": ""
    },
    {
        "text": "So that's my basic sausage mince.",
        "extra_info": ""
    },
    {
        "text": "Okay Daniel, you knew it was gonna be you.",
        "extra_info": ""
    },
    {
        "text": "Let's get up here and make these sausage rolls.",
        "extra_info": ""
    },
    {
        "text": "Okay, so we're gonna use a good quality butter puff.",
        "extra_info": ""
    },
    {
        "text": "- Did you use the stuff...? - I just used puff.",
        "extra_info": ""
    },
    {
        "text": "You used puff pastry.",
        "extra_info": ""
    },
    {
        "text": "And I just want to roll that out a little bit.",
        "extra_info": ""
    },
    {
        "text": "I just think it's a little bit thick, we have a lot of pastry there, so...",
        "extra_info": ""
    },
    {
        "text": "you've gotta interpret each pastry. Yeah, that's perfect I reckon.",
        "extra_info": ""
    },
    {
        "text": "Doesn't need much more than that. Once you've got yourself into this spot,",
        "extra_info": ""
    },
    {
        "text": "what I would do is I'd take out the sausage, you can do a chunk as well.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna get a little bit more flour on there.",
        "extra_info": ""
    },
    {
        "text": "But I would get it into a point where I'm actually rolling it",
        "extra_info": ""
    },
    {
        "text": "and expelling the air.",
        "extra_info": ""
    },
    {
        "text": "So what I do is make the sausage the length of the pastry.",
        "extra_info": ""
    },
    {
        "text": "Should we divide it in half?",
        "extra_info": ""
    },
    {
        "text": "And then what I'm doing is just I'm gonna roll that together",
        "extra_info": ""
    },
    {
        "text": "and hopefully I've got enough... ooh, just, just.",
        "extra_info": ""
    },
    {
        "text": "And then, just give it a little bit of a roll,",
        "extra_info": ""
    },
    {
        "text": "just to make sure it's nice and neat and tidy.",
        "extra_info": ""
    },
    {
        "text": "And then what we're gonna do is pop those on the tray, go on, off you go.",
        "extra_info": ""
    },
    {
        "text": "Eggwash them, and pop them in the oven.",
        "extra_info": ""
    },
    {
        "text": "A beauty about having a soft pastry is it will seal together if it's on the bottom.",
        "extra_info": ""
    },
    {
        "text": "Alright, pop it on.",
        "extra_info": ""
    },
    {
        "text": "And then what I've got here is I've got egg yolk and a pinch of salt.",
        "extra_info": ""
    },
    {
        "text": "And the reason we're using egg yolk is it's the best eggwash.",
        "extra_info": ""
    },
    {
        "text": "But what you've gotta be careful, is that you eggwash evenly,",
        "extra_info": ""
    },
    {
        "text": "and you do it a couple of times.",
        "extra_info": ""
    },
    {
        "text": "I've got sesame seeds and I've got basil seeds as well.",
        "extra_info": ""
    },
    {
        "text": "Some people like it, some people don't.",
        "extra_info": ""
    },
    {
        "text": "Makes it look nice.",
        "extra_info": ""
    },
    {
        "text": "And I've got a feeling these are gonna look sort of big and rustic,",
        "extra_info": ""
    },
    {
        "text": "but the whole idea of doing them in like a length like this,",
        "extra_info": ""
    },
    {
        "text": "is then I'm gonna cut them in an angle, and I think they look pretty,",
        "extra_info": ""
    },
    {
        "text": "because they keep the shape, you can see the insides,",
        "extra_info": ""
    },
    {
        "text": "so it looks a bit more gourmet than doing them individually.",
        "extra_info": ""
    },
    {
        "text": "- Alright, good, go and sit down. - Goodo. Thanks mate.",
        "extra_info": ""
    },
    {
        "text": "Now into the oven. These are gonna take about 15-20 minutes",
        "extra_info": ""
    },
    {
        "text": "at 180 degrees. And then wait for them to cook, slice,",
        "extra_info": ""
    },
    {
        "text": "and serve them with good old tomato sauce. Cause nothing else will do.",
        "extra_info": ""
    },
    {
        "text": "Okay. Let's get those sausage rolls out of the oven.",
        "extra_info": ""
    },
    {
        "text": "Gee, they look alright, don't they? Nicely cooked, golden brown.",
        "extra_info": ""
    },
    {
        "text": "- Beautiful. - I didn't forget.",
        "extra_info": ""
    },
    {
        "text": "- Gotta have a tomato sauce eh? - I knew you'd smell these babies.",
        "extra_info": ""
    },
    {
        "text": "This is what I mean about, you precut them...",
        "extra_info": ""
    },
    {
        "text": "and they look pretty neat, you know, cause you've cut them afterwards",
        "extra_info": ""
    },
    {
        "text": "rather than before.",
        "extra_info": ""
    },
    {
        "text": "Can't beat a homemade sausage roll, can you?",
        "extra_info": ""
    },
    {
        "text": "Okay. Sausage rolls. 101 MasterClass.",
        "extra_info": ""
    },
    {
        "text": "So top tips. First point. Try not to use commercially made sausage mince.",
        "extra_info": ""
    },
    {
        "text": "They've got fillers and binders in them. Use fresh mince. Chicken, lamb, beef.",
        "extra_info": ""
    },
    {
        "text": "Tip number two, try the vegetable purees. Cauliflower, pumpkin, sweet potato, carrot.",
        "extra_info": ""
    },
    {
        "text": "It's a lovely way of adding flavor, texture, and the kids won't find it,",
        "extra_info": ""
    },
    {
        "text": "they'll never know they're being healthy eating sausage rolls and tomato sauce.",
        "extra_info": ""
    },
    {
        "text": "And number three, try cooking it as a whole pastry, whole log, a whole sausage roll,",
        "extra_info": ""
    },
    {
        "text": "you can vary the size, you can change the filling, you can make",
        "extra_info": ""
    },
    {
        "text": "grown up versions as well as kiddie versions,",
        "extra_info": ""
    },
    {
        "text": "and they'll always be a hit at a party.",
        "extra_info": ""
    },
    {
        "text": "Time to eat.",
        "extra_info": ""
    },
    {
        "text": "Daniel, Phillip and Fiona. Come on. Up you come.",
        "extra_info": ""
    },
    {
        "text": "Before you jam that bit of sausage roll in your mouth, what do you think?",
        "extra_info": ""
    },
    {
        "text": "They're very nice. Very tasty. Yeah. You can't beat a sausage roll.",
        "extra_info": ""
    },
    {
        "text": "Daniel?",
        "extra_info": ""
    },
    {
        "text": "Could have been a little more cooked from the bottom, couldn't they?",
        "extra_info": ""
    },
    {
        "text": "- Phillip, what do you think? - Fantastic.",
        "extra_info": ""
    },
    {
        "text": "Crisp on the top and nice and soft in the middle.",
        "extra_info": ""
    },
    {
        "text": "Lovely. Good. Great. We know it's simple sausage rolls,",
        "extra_info": ""
    },
    {
        "text": "but it does translate across the board, there's other things you can do with it.",
        "extra_info": ""
    },
    {
        "text": "Take it with you.",
        "extra_info": ""
    },
    {
        "text": "- Up next. - Easy easy recipe, you'll learn this baby,",
        "extra_info": ""
    },
    {
        "text": "it will set you up well.",
        "extra_info": ""
    },
    {
        "text": "Gary's twist on a classic. Jelly donuts dusted with lavender sugar.",
        "extra_info": ""
    },
    {
        "text": "- Then later. - Boudin blanc with fresh black truffle",
        "extra_info": ""
    },
    {
        "text": "and caramelized onion.",
        "extra_info": ""
    },
    {
        "text": "Gary and George take the humble sausage up market.",
        "extra_info": ""
    },
    {
        "text": "So, nice little adult treat.",
        "extra_info": ""
    },
    {
        "text": "My final little treat for the kids, and this is an all-time favorite of mine, is donuts.",
        "extra_info": ""
    },
    {
        "text": "Yeah, easy, easy recipe. You learn this baby, it'll set you up well.",
        "extra_info": ""
    },
    {
        "text": "George cooks the little Greek donuts, Phillip what are they called, or Peter?",
        "extra_info": ""
    },
    {
        "text": "Loukoumades.",
        "extra_info": ""
    },
    {
        "text": "Loukoumades. This leaves loukoumades for dead.",
        "extra_info": ""
    },
    {
        "text": "No, no. There's two... I love loukoumades but I love donuts.",
        "extra_info": ""
    },
    {
        "text": "Right. Everybody thinks of a donut as being quite heavy little fried ball of dough.",
        "extra_info": ""
    },
    {
        "text": "And traditionally, if you look up a recipe,",
        "extra_info": ""
    },
    {
        "text": "what you do is you make a bread dough essentially, a sweet bread dough.",
        "extra_info": ""
    },
    {
        "text": "You ball it up, you let it proof, and you deep fry and pipe them.",
        "extra_info": ""
    },
    {
        "text": "This is more like a batter. It's a very light and a very loose recipe.",
        "extra_info": ""
    },
    {
        "text": "So I've got 440 of milk and what I'm gonna do is to warm it up until it's just tepid.",
        "extra_info": ""
    },
    {
        "text": "That means when I put my finger into it,",
        "extra_info": ""
    },
    {
        "text": "it sounds pretty gruesome but it's blood temperature.",
        "extra_info": ""
    },
    {
        "text": "And the reason it's important that it's blood temperature is because",
        "extra_info": ""
    },
    {
        "text": "I'm going to put yeast into it. And the yeast needs to activate.",
        "extra_info": ""
    },
    {
        "text": "And the yeast as a living organism thrives in that sort of ambient temperature.",
        "extra_info": ""
    },
    {
        "text": "If it gets too hot, it dies. If it's too cold, it's dormant.",
        "extra_info": ""
    },
    {
        "text": "But this is a commercial Rowe's Yeast. Very efficient.",
        "extra_info": ""
    },
    {
        "text": "What it does is it multiplies, and it releases carbon dioxide,",
        "extra_info": ""
    },
    {
        "text": "which is the aeration in bread.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna put butter into that, and what we're gonna do is just melt that together.",
        "extra_info": ""
    },
    {
        "text": "So 440 of milk and a 100 grams of butter.",
        "extra_info": ""
    },
    {
        "text": "Now that amount of butter is variable.",
        "extra_info": ""
    },
    {
        "text": "If you're scared about putting that amount in, you don't need to.",
        "extra_info": ""
    },
    {
        "text": "In fact, if you left it out, it wouldn't make an enormous amount of difference,",
        "extra_info": ""
    },
    {
        "text": "it's just slightly different mouth feel and the butter adds a little bit of richness.",
        "extra_info": ""
    },
    {
        "text": "So we've got 75 grams of caster sugar.",
        "extra_info": ""
    },
    {
        "text": "And then four eggs.",
        "extra_info": ""
    },
    {
        "text": "And what that does is it gives us a lovely energy packed soup",
        "extra_info": ""
    },
    {
        "text": "to then dissolve the yeast into. The yeast is going to love that.",
        "extra_info": ""
    },
    {
        "text": "It's gonna feed on it, and it's gonna go crazy,",
        "extra_info": ""
    },
    {
        "text": "and it's gonna do exactly what we want it to do, which is to proof, to multiply,",
        "extra_info": ""
    },
    {
        "text": "to release the carbon dioxide,",
        "extra_info": ""
    },
    {
        "text": "and aerate our dough.",
        "extra_info": ""
    },
    {
        "text": "Now what we do is just pour a little bit onto the yeast, and just,",
        "extra_info": ""
    },
    {
        "text": "I use my fingers, you can whisk it in together,",
        "extra_info": ""
    },
    {
        "text": "but what I'm doing is I'm just making it into a lovely yeasty little soup,",
        "extra_info": ""
    },
    {
        "text": "and then I pour that back into the body of the milk and the eggs.",
        "extra_info": ""
    },
    {
        "text": "I've got 20 grams of fresh yeast. If you're using packet yeast,",
        "extra_info": ""
    },
    {
        "text": "if you're using a dried yeast, it's half that.",
        "extra_info": ""
    },
    {
        "text": "So you can see it's nice and smooth, and then I'll put that back into the",
        "extra_info": ""
    },
    {
        "text": "the body of the milk.",
        "extra_info": ""
    },
    {
        "text": "Right. Then what we're gonna do is we're gonna make a well in the middle of the flour.",
        "extra_info": ""
    },
    {
        "text": "600 grams of flour, and what we're basically making, and this is very different to",
        "extra_info": ""
    },
    {
        "text": "the sort of standard donut recipe, that you'll find in a book,",
        "extra_info": ""
    },
    {
        "text": "is this is more like a batter.",
        "extra_info": ""
    },
    {
        "text": "And that's what is gonna make it very light, okay?",
        "extra_info": ""
    },
    {
        "text": "So we've got a lovely soft dough.",
        "extra_info": ""
    },
    {
        "text": "Now what we're gonna do,",
        "extra_info": ""
    },
    {
        "text": "is allow that to proof. Cover it with clean film, cover it with cloth,",
        "extra_info": ""
    },
    {
        "text": "put it in a nice little warm spot.",
        "extra_info": ""
    },
    {
        "text": "Okay.",
        "extra_info": ""
    },
    {
        "text": "So this is our proofed batter.",
        "extra_info": ""
    },
    {
        "text": "It takes about 45 minutes to an hour to go through its proof.",
        "extra_info": ""
    },
    {
        "text": "So we're looking for a nice, soft consistency.",
        "extra_info": ""
    },
    {
        "text": "Alright, it's gonna be nice and light.",
        "extra_info": ""
    },
    {
        "text": "And I've got the oil over here at 170 degrees",
        "extra_info": ""
    },
    {
        "text": "so it needs to sit 165, 170 degrees.",
        "extra_info": ""
    },
    {
        "text": "And we can use a spoon to do this, just pop little spoonfuls of batter in,",
        "extra_info": ""
    },
    {
        "text": "but what I'm gonna do is just use my hand.",
        "extra_info": ""
    },
    {
        "text": "And what I'm doing is I'm working the dough in my fingers",
        "extra_info": ""
    },
    {
        "text": "and then popping off like a little nugget into the oil.",
        "extra_info": ""
    },
    {
        "text": "Once you get into a little routine, you can actually do quite a few at once.",
        "extra_info": ""
    },
    {
        "text": "So I've got normal vegetable oil in here, you don't want anything too strongly flavored.",
        "extra_info": ""
    },
    {
        "text": "- What's the cooking time for those donuts? - They'll take about 3 or 4 minutes.",
        "extra_info": ""
    },
    {
        "text": "- 3-4 minutes? - Give them long enough so that",
        "extra_info": ""
    },
    {
        "text": "they're gonna cook right in the middle. The pleasure of cooking them actually,",
        "extra_info": ""
    },
    {
        "text": "is that every batch you have to... - Try one.",
        "extra_info": ""
    },
    {
        "text": "You've gotta try one. It's a bummer.",
        "extra_info": ""
    },
    {
        "text": "So while they're cooking, I've just got a bit of caster sugar,",
        "extra_info": ""
    },
    {
        "text": "and what I'm gonna make is a bit of lavender sugar.",
        "extra_info": ""
    },
    {
        "text": "So I just pick the lavender flowers from fresh lavender,",
        "extra_info": ""
    },
    {
        "text": "which is absolutely gorgeous. And I'm just gonna rub",
        "extra_info": ""
    },
    {
        "text": "those flowers through the sugar, so I get a little lavender sugar",
        "extra_info": ""
    },
    {
        "text": "coating the donuts. So what's gonna be a really fairly",
        "extra_info": ""
    },
    {
        "text": "simple sort of pastry shop type dessert, just goes up a notch.",
        "extra_info": ""
    },
    {
        "text": "They look alright, don't they? And then the idea is to take the hot donuts...",
        "extra_info": ""
    },
    {
        "text": "They look good, don't they?",
        "extra_info": ""
    },
    {
        "text": "Just put them through the sugar.",
        "extra_info": ""
    },
    {
        "text": "And what you're looking for when you open it, hopefully these are gonna be cooked,",
        "extra_info": ""
    },
    {
        "text": "that little steamy center. So what we've gotta do now is just pop some jam in,",
        "extra_info": ""
    },
    {
        "text": "and then they're good to go. But before we do that, I just need a little snack.",
        "extra_info": ""
    },
    {
        "text": "George!",
        "extra_info": ""
    },
    {
        "text": "Okay, so, let's pop a little bit of jam in. Put in the piping bag.",
        "extra_info": ""
    },
    {
        "text": "And then make a hole in the donut.",
        "extra_info": ""
    },
    {
        "text": "And then put plenty of jam in.",
        "extra_info": ""
    },
    {
        "text": "It just looks really good.",
        "extra_info": ""
    },
    {
        "text": "So all I need now is some clotted cream, warm donuts and a volunteer.",
        "extra_info": ""
    },
    {
        "text": "Georgie.",
        "extra_info": ""
    },
    {
        "text": "- Phillip and Peter, come on. - We're gonna have a great moment.",
        "extra_info": ""
    },
    {
        "text": "Here, let me come on their side.",
        "extra_info": ""
    },
    {
        "text": "Dip it into the clotted cream, a little bit of jam.",
        "extra_info": ""
    },
    {
        "text": "But the question is, are they better than our loukoumades?",
        "extra_info": ""
    },
    {
        "text": "- These are really good. - All over me.",
        "extra_info": ""
    },
    {
        "text": "The jam is not authentic grade, the lavender sugar is a brilliant idea.",
        "extra_info": ""
    },
    {
        "text": "- They're nice, light, they just... - Beautiful.",
        "extra_info": ""
    },
    {
        "text": "Enough to make you wanna have another one.",
        "extra_info": ""
    },
    {
        "text": "And another one. And another one.",
        "extra_info": ""
    },
    {
        "text": "- Phillip, what do you think? - Oh, they're amazing,",
        "extra_info": ""
    },
    {
        "text": "I think I could eat a whole bowl. - Great.",
        "extra_info": ""
    },
    {
        "text": "Can I take it with me?",
        "extra_info": ""
    },
    {
        "text": "- Off you go. - Thanks. Thanks for watching.",
        "extra_info": ""
    },
    {
        "text": "Thanks, Gary.",
        "extra_info": ""
    },
    {
        "text": "Enjoy.",
        "extra_info": ""
    },
    {
        "text": "So here are my top tips for making the perfect donut.",
        "extra_info": ""
    },
    {
        "text": "Number one, don't follow those old recipes with the heavy dough you roll and proof.",
        "extra_info": ""
    },
    {
        "text": "Make a batter. A thick batter that will proof up into a lovely light consistency,",
        "extra_info": ""
    },
    {
        "text": "that you pop into the oil and end up with a gorgeous fluffy donut.",
        "extra_info": ""
    },
    {
        "text": "Second tip, cooking temperature. About 165 degrees to 170 degrees.",
        "extra_info": ""
    },
    {
        "text": "It will give a time for the donut to color lightly and to cook for long enough",
        "extra_info": ""
    },
    {
        "text": "so that it's not raw in the middle.",
        "extra_info": ""
    },
    {
        "text": "And that's super important.",
        "extra_info": ""
    },
    {
        "text": "So they are my kids' party ideas and pretty good for adults too.",
        "extra_info": ""
    },
    {
        "text": "When we come back, the expert's guide to making a Japanese classic.",
        "extra_info": ""
    },
    {
        "text": "- Sushi. - The fish just disappears in your mouth.",
        "extra_info": ""
    },
    {
        "text": "We're here at Sake restaurant with Shaun Presland, the executive chef.",
        "extra_info": ""
    },
    {
        "text": "We're discovering some fantastic ways of using essential ingredients",
        "extra_info": ""
    },
    {
        "text": "of Japanese cuisine.",
        "extra_info": ""
    },
    {
        "text": "Now Shaun, what are next two ingredients?",
        "extra_info": ""
    },
    {
        "text": "The next two ingredients are tuna and rice.",
        "extra_info": ""
    },
    {
        "text": "Plain sushi rice.",
        "extra_info": ""
    },
    {
        "text": "Look, for me, sushi rice is probably the most abused Japanese ingredient in Australia.",
        "extra_info": ""
    },
    {
        "text": "You see them, those terrible rolls, the rice is chalky,",
        "extra_info": ""
    },
    {
        "text": "it bites or is really gluggy and stuck together.",
        "extra_info": ""
    },
    {
        "text": "Now Shaun, it shouldn't be that hard, should it?",
        "extra_info": ""
    },
    {
        "text": "It's not that hard. It's quite simple.",
        "extra_info": ""
    },
    {
        "text": "Okay, so we'll start with five parts vinegar, two parts sugar,",
        "extra_info": ""
    },
    {
        "text": "one part salt. And now all I wanna do",
        "extra_info": ""
    },
    {
        "text": "is mix them together until they dissolve.",
        "extra_info": ""
    },
    {
        "text": "This could be made ahead of time. You can make a nice big batch,",
        "extra_info": ""
    },
    {
        "text": "keep it in the fridge. So, that's pretty much it.",
        "extra_info": ""
    },
    {
        "text": "This is short-grain rice, it's nice and hot, that I've washed and I've let sit",
        "extra_info": ""
    },
    {
        "text": "for about 30 minutes and I've cooked it. I've measured out the rice really carefully.",
        "extra_info": ""
    },
    {
        "text": "So I've used one cup of rice to one cup of water,",
        "extra_info": ""
    },
    {
        "text": "that's the ratio of cooking rice, it's pretty simple.",
        "extra_info": ""
    },
    {
        "text": "The next step is seasoning the rice. You want it to be nice and hot,",
        "extra_info": ""
    },
    {
        "text": "so the flavor of the vinegar absorbs in the rice.",
        "extra_info": ""
    },
    {
        "text": "So this is the sushi-zu I just made. I'm gonna pour it over the rice",
        "extra_info": ""
    },
    {
        "text": "and then I want to roll every single grain to ensure that each little part",
        "extra_info": ""
    },
    {
        "text": "gets a bit of that sushi-zu, a bit of that flavor.",
        "extra_info": ""
    },
    {
        "text": "I wanna break any lumps by taking it from one side of the bowl over to the other side.",
        "extra_info": ""
    },
    {
        "text": "Bit by bit. You don't want to work it too much cause you'll release to much of gluten",
        "extra_info": ""
    },
    {
        "text": "in the rice, and then you get really, really sticky rice.",
        "extra_info": ""
    },
    {
        "text": "The next step is to cool your rice down by fanning.",
        "extra_info": ""
    },
    {
        "text": "We're just using the lid of the container here, fanning the rice",
        "extra_info": ""
    },
    {
        "text": "will bring out a natural sheen and make it glossy,",
        "extra_info": ""
    },
    {
        "text": "and also bring it down to 38 degrees, which is body temperature,",
        "extra_info": ""
    },
    {
        "text": "so in theory, you're eating a piece of rice that your body didn't even feel.",
        "extra_info": ""
    },
    {
        "text": "But you've got all that flavor and tasting the top of the fish.",
        "extra_info": ""
    },
    {
        "text": "So Shaun, that's the sushi rice sorted, what about the fish?",
        "extra_info": ""
    },
    {
        "text": "I'm gonna leave the fish to one of my sushi chefs,",
        "extra_info": ""
    },
    {
        "text": "Shin Pei has been with me for seven years now.",
        "extra_info": ""
    },
    {
        "text": "Shin Pei's second generation, his father is a sushi chef, so he's very well-versed",
        "extra_info": ""
    },
    {
        "text": "in cutting fish. - Wow, look at this, fantastic.",
        "extra_info": ""
    },
    {
        "text": "Talk us through exactly what you're doing here.",
        "extra_info": ""
    },
    {
        "text": "Right now I'm just gonna take the bones out from the belly.",
        "extra_info": ""
    },
    {
        "text": "You can just cut the belly, just straight off. So that's the belly.",
        "extra_info": ""
    },
    {
        "text": "If you have a whole piece like this, you can even cut it in half,",
        "extra_info": ""
    },
    {
        "text": "to make it easier. To clean the bloodline off.",
        "extra_info": ""
    },
    {
        "text": "Because once you've cut it in half, just along here,",
        "extra_info": ""
    },
    {
        "text": "you can see this dark part of the tuna, which is the bloodline.",
        "extra_info": ""
    },
    {
        "text": "So, just with the knife, just gently go along the bloodline,",
        "extra_info": ""
    },
    {
        "text": "even if the fish is fresh, it has bloodline in it, it's just gonna taste a lot fishier.",
        "extra_info": ""
    },
    {
        "text": "So it's important to take every part of the bloodline off.",
        "extra_info": ""
    },
    {
        "text": "Now Shin Pei, you're changing knives now. What's so special about that knife?",
        "extra_info": ""
    },
    {
        "text": "Well this knife is called a yanagiba, which is a sashimi knife.",
        "extra_info": ""
    },
    {
        "text": "Like most Japanese knives, you can see that it is flat on one side,",
        "extra_info": ""
    },
    {
        "text": "and then it has a blade on the other side.",
        "extra_info": ""
    },
    {
        "text": "The reason is why that is is so if it's flat on one side,",
        "extra_info": ""
    },
    {
        "text": "you know where you're actually cutting, and also",
        "extra_info": ""
    },
    {
        "text": "it's important like when we cut sashimi,",
        "extra_info": ""
    },
    {
        "text": "is because we polish the fish as we slice the fish,",
        "extra_info": ""
    },
    {
        "text": "the blade is like nice and flat, it polishes the fish very well.",
        "extra_info": ""
    },
    {
        "text": "So first of all, I'll take a little bit off the top.",
        "extra_info": ""
    },
    {
        "text": "This piece in Japanese, we call it tenpa.",
        "extra_info": ""
    },
    {
        "text": "And we use the tenpa, the top part, for nigiri, because there's less sinew,",
        "extra_info": ""
    },
    {
        "text": "and the bottom part we use for sashimi, because we get nice rectangle blocks",
        "extra_info": ""
    },
    {
        "text": "and it's easy to cut and it look beautiful on a plate.",
        "extra_info": ""
    },
    {
        "text": "Now we're gonna do the cut for the nigiri.",
        "extra_info": ""
    },
    {
        "text": "We take a nice block off, just like that, and then we cut it through again,",
        "extra_info": ""
    },
    {
        "text": "and for the nigiri, when we use sashimi knife, we always pull.",
        "extra_info": ""
    },
    {
        "text": "Pulling actually polishes the surface of the fish.",
        "extra_info": ""
    },
    {
        "text": "So this is how we cut the fish for the nigiri.",
        "extra_info": ""
    },
    {
        "text": "So Carrie, you wanna have a go?",
        "extra_info": ""
    },
    {
        "text": "It's a sharp knife so you don't need to use much power.",
        "extra_info": ""
    },
    {
        "text": "Just let the way of the knife do the job.",
        "extra_info": ""
    },
    {
        "text": "- How's she going, Shin Pei? - Yes, it's improving.",
        "extra_info": ""
    },
    {
        "text": "So it's important that we get each area in the same thickness",
        "extra_info": ""
    },
    {
        "text": "because when you make nigiri and you have a thin end and a thick end,",
        "extra_info": ""
    },
    {
        "text": "it doesn't really look beautiful on a plate,",
        "extra_info": ""
    },
    {
        "text": "so presentation is one of the most important things in cooking.",
        "extra_info": ""
    },
    {
        "text": "So we want beautiful piece of fish on each piece of rice.",
        "extra_info": ""
    },
    {
        "text": "- Great stuff, Carrie. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "Thank you for letting me use your knife.",
        "extra_info": ""
    },
    {
        "text": "Now Shin Pei, there's obviously a real art in being a sushi chef.",
        "extra_info": ""
    },
    {
        "text": "Tell me about the training. This is not a short process, is it?",
        "extra_info": ""
    },
    {
        "text": "- No, it's a very long journey. - How long?",
        "extra_info": ""
    },
    {
        "text": "At least some places ten years, sushiwa is such a superior job in Japan,",
        "extra_info": ""
    },
    {
        "text": "only chosen people can go. So it's a really long journey to be",
        "extra_info": ""
    },
    {
        "text": "up there to be a sushi chef. - So guys, please thank Shin Pei.",
        "extra_info": ""
    },
    {
        "text": "- Shaun, ready to roll. - Yeah, let me just clean up",
        "extra_info": ""
    },
    {
        "text": "some of this beautiful fish.",
        "extra_info": ""
    },
    {
        "text": "And I'll teach you guys the skillful art of making nigiri sushi.",
        "extra_info": ""
    },
    {
        "text": "You say nigiri sushi, explain why you say nigiri.",
        "extra_info": ""
    },
    {
        "text": "Nigiri means to squeeze. It's the action of...",
        "extra_info": ""
    },
    {
        "text": "a bit of rice, a bit of topping, and you squeeze. I'll show exactly what I mean.",
        "extra_info": ""
    },
    {
        "text": "I've got some wasabi. I've got some water. It's always important to have wet hands.",
        "extra_info": ""
    },
    {
        "text": "So if you keep them wet, the rice doesn't stick to your hands.",
        "extra_info": ""
    },
    {
        "text": "You are clean, you don't get rice on top of your topping.",
        "extra_info": ""
    },
    {
        "text": "That's right, so, rice in this hand, fish in this hand,",
        "extra_info": ""
    },
    {
        "text": "you don't wanna handle the fish too much cause it will get too warm.",
        "extra_info": ""
    },
    {
        "text": "Wasabi, rice goes in the middle, make a little shape,",
        "extra_info": ""
    },
    {
        "text": "you wanna make Porsches, not Volvos, so smooth down my edges,",
        "extra_info": ""
    },
    {
        "text": "make a little boat shape with my fingers, and that's it.",
        "extra_info": ""
    },
    {
        "text": "Very fine way of doing it a million miles an hour.",
        "extra_info": ""
    },
    {
        "text": "Let's do it so I can follow, cause they're very distinct movements you're making",
        "extra_info": ""
    },
    {
        "text": "and I know that's 17 years of experience we're just seeing.",
        "extra_info": ""
    },
    {
        "text": "Show us in kind of like Matt Preston motion.",
        "extra_info": ""
    },
    {
        "text": "I actually find it quite hard to make it slowly, but I'll try.",
        "extra_info": ""
    },
    {
        "text": "So, Matrix style.",
        "extra_info": ""
    },
    {
        "text": "Fish comes in hand.",
        "extra_info": ""
    },
    {
        "text": "Thumb holds fish.",
        "extra_info": ""
    },
    {
        "text": "When I'm taking rice, I'm just literally teasing it with my fingertips.",
        "extra_info": ""
    },
    {
        "text": "I'm poking a little hole in my rice. So a bit of air goes in there.",
        "extra_info": ""
    },
    {
        "text": "Wasabi on the fish.",
        "extra_info": ""
    },
    {
        "text": "Okay, here I make my little square.",
        "extra_info": ""
    },
    {
        "text": "And then I push it down. This is where the word nigiri comes in, it means to squeeze.",
        "extra_info": ""
    },
    {
        "text": "And then I turn the fish over, make a little shape of a boat,",
        "extra_info": ""
    },
    {
        "text": "put it down the sides, make it again,",
        "extra_info": ""
    },
    {
        "text": "Sushi.",
        "extra_info": ""
    },
    {
        "text": "How many of those can you do in a minute?",
        "extra_info": ""
    },
    {
        "text": "I'm doing about 250 an hour for a couple of hours.",
        "extra_info": ""
    },
    {
        "text": "Right. Courtney, come on. Come have a go.",
        "extra_info": ""
    },
    {
        "text": "Step on up.",
        "extra_info": ""
    },
    {
        "text": "Remember, keep your hands wet, is the key.",
        "extra_info": ""
    },
    {
        "text": "The reasons chefs, sushi chefs smack their hands is to disperse the extra water,",
        "extra_info": ""
    },
    {
        "text": "you just want enough so the rice won't stick to your hands,",
        "extra_info": ""
    },
    {
        "text": "but you still wanna be able to play with it.",
        "extra_info": ""
    },
    {
        "text": "So go for it.",
        "extra_info": ""
    },
    {
        "text": "- About that much? - Yeah.",
        "extra_info": ""
    },
    {
        "text": "Pick up your fish with your other hand.",
        "extra_info": ""
    },
    {
        "text": "Take a bit of wasabi on the way through from your finger.",
        "extra_info": ""
    },
    {
        "text": "Hold your fish down like that.",
        "extra_info": ""
    },
    {
        "text": "Rice in the middle. Squeeze it down.",
        "extra_info": ""
    },
    {
        "text": "Turn it over.",
        "extra_info": ""
    },
    {
        "text": "Make a Porsche, which means rounded edges.",
        "extra_info": ""
    },
    {
        "text": "It's like I'm a king's ward at the moment.",
        "extra_info": ""
    },
    {
        "text": "It's alright. Turn them around again.",
        "extra_info": ""
    },
    {
        "text": "This finger comes on the top, just once to bump the bottom, yeah.",
        "extra_info": ""
    },
    {
        "text": "And then you turn around again, and bump the boot.",
        "extra_info": ""
    },
    {
        "text": "One of the main things, you don't want to overtouch fish,",
        "extra_info": ""
    },
    {
        "text": "the fish is cold, so your body warmth is gonna come through to the fish.",
        "extra_info": ""
    },
    {
        "text": "Great stuff, Courtney, you can return and join the others.",
        "extra_info": ""
    },
    {
        "text": "Good job.",
        "extra_info": ""
    },
    {
        "text": "Well Shaun, let's plate up and taste.",
        "extra_info": ""
    },
    {
        "text": "No problem.",
        "extra_info": ""
    },
    {
        "text": "Sushi's normally served in twos, gonna do five just to be different.",
        "extra_info": ""
    },
    {
        "text": "Here you go, guys. Try some.",
        "extra_info": ""
    },
    {
        "text": "Eat it in one go, don't try to nibble.",
        "extra_info": ""
    },
    {
        "text": "Courtney, tell me what you taste.",
        "extra_info": ""
    },
    {
        "text": "The beautiful rice is the first thing I taste.",
        "extra_info": ""
    },
    {
        "text": "The fish just disappears in your mouth. It's not a fishy flavor,",
        "extra_info": ""
    },
    {
        "text": "it's just... it's texture more than anything, of the fish.",
        "extra_info": ""
    },
    {
        "text": "And then a bit of the heat from the wasabi.",
        "extra_info": ""
    },
    {
        "text": "What are you looking for with the actual fish in terms of a good bit of fish",
        "extra_info": ""
    },
    {
        "text": "to use for nigiri, to use for topping for your sushi rice.",
        "extra_info": ""
    },
    {
        "text": "You're looking for a piece of fish which doesn't have a lot of sinew,",
        "extra_info": ""
    },
    {
        "text": "which is fairly easy to cut, no bones, no sinew,",
        "extra_info": ""
    },
    {
        "text": "and cut thin enough so it melts in your mouth.",
        "extra_info": ""
    },
    {
        "text": "- And in terms of color? - Color, vibrant colors.",
        "extra_info": ""
    },
    {
        "text": "Rainbow colors, rustic colors.",
        "extra_info": ""
    },
    {
        "text": "Guys, I think you'll agree with me that this is in an amazing insight",
        "extra_info": ""
    },
    {
        "text": "into some of the real essentials of Japanese cooking.",
        "extra_info": ""
    },
    {
        "text": "Please thank executive chef from Sake, Shaun Presland.",
        "extra_info": ""
    },
    {
        "text": "- Thank you. - You're welcome.",
        "extra_info": ""
    },
    {
        "text": "Right, you need to go back to the MasterChef kitchen,",
        "extra_info": ""
    },
    {
        "text": "cause I'm staying here to discuss a few sakes with Shaun. I'll see you later.",
        "extra_info": ""
    },
    {
        "text": "- See you later. Thank you. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "- Ahead on MasterClass. - For the boudin blanc,",
        "extra_info": ""
    },
    {
        "text": "which basically means white sausage, we're gonna use chicken.",
        "extra_info": ""
    },
    {
        "text": "Gary and George dish up some classy party food for grownups.",
        "extra_info": ""
    },
    {
        "text": "I need some beautiful truffle chopped up, and I know you love it.",
        "extra_info": ""
    },
    {
        "text": "- I love it. - So you chop that little truffle?",
        "extra_info": ""
    },
    {
        "text": "Okay, this is the last lesson of today's MasterClass.",
        "extra_info": ""
    },
    {
        "text": "So pay attention, you never know, you might learn something.",
        "extra_info": ""
    },
    {
        "text": "At Phoebe's birthday you had the challenge of feeding the adults as well as the kids.",
        "extra_info": ""
    },
    {
        "text": "I'm making blinis, which is a Russian pancake,",
        "extra_info": ""
    },
    {
        "text": "it's topped with smoked salmon and cream cheese.",
        "extra_info": ""
    },
    {
        "text": "What we're gonna do is a bit of adult party food.",
        "extra_info": ""
    },
    {
        "text": "George and I had a think about it, and we thought we could do a seafood sausage,",
        "extra_info": ""
    },
    {
        "text": "or a boudin blanc, which is a white sausage, and that's we thought we'd show you today,",
        "extra_info": ""
    },
    {
        "text": "a boudin blanc with fresh black truffle and caramelized onion,",
        "extra_info": ""
    },
    {
        "text": "so nice little adult treat.",
        "extra_info": ""
    },
    {
        "text": "Okay for the boudin blanc, which basically means white sausage,",
        "extra_info": ""
    },
    {
        "text": "we're gonna use chicken.",
        "extra_info": ""
    },
    {
        "text": "You can use veal and you can make it out of seafood as well,",
        "extra_info": ""
    },
    {
        "text": "so you pick a soft white fish to do the same thing with.",
        "extra_info": ""
    },
    {
        "text": "Now, classically, it's quite French, it's very light,",
        "extra_info": ""
    },
    {
        "text": "and the reason it's quite light is the use of panade.",
        "extra_info": ""
    },
    {
        "text": "A panade is a term that refers to a base. It's like a binder.",
        "extra_info": ""
    },
    {
        "text": "And that could be choux pastry, it could be potato, or in this case,",
        "extra_info": ""
    },
    {
        "text": "it's bread and a little bit of milk.",
        "extra_info": ""
    },
    {
        "text": "So I need some beautiful truffle chopped up, and I know you love it.",
        "extra_info": ""
    },
    {
        "text": "- I love it. - So you chop that little truffle.",
        "extra_info": ""
    },
    {
        "text": "And I've got a couple slices of bread. Soft white bread.",
        "extra_info": ""
    },
    {
        "text": "And a little bit of milk. It's only about three or four tablespoonfuls of milk.",
        "extra_info": ""
    },
    {
        "text": "And the idea is that you just let that milk soften the bread and soak into it,",
        "extra_info": ""
    },
    {
        "text": "and then I'm gonna pop that into the mousse.",
        "extra_info": ""
    },
    {
        "text": "And as the sausage cooks, it's actually gonna come into its own,",
        "extra_info": ""
    },
    {
        "text": "and lighten that little boudin up. It's an alternative actually using",
        "extra_info": ""
    },
    {
        "text": "bread soaked in milk or even in water or vinegar rather than breadcrumbs.",
        "extra_info": ""
    },
    {
        "text": "If you mix that with the sausage roll mixture,",
        "extra_info": ""
    },
    {
        "text": "essentially it would to the same thing, you don't need to make breadcrumbs.",
        "extra_info": ""
    },
    {
        "text": "Something worth remembering if you're ever get caught short,",
        "extra_info": ""
    },
    {
        "text": "you don't have breadcrumbs or you don't have a machine to do it with.",
        "extra_info": ""
    },
    {
        "text": "Now, pay attention, this is important. This is a good little technique to learn,",
        "extra_info": ""
    },
    {
        "text": "it's how to make a mousse.",
        "extra_info": ""
    },
    {
        "text": "First of all, the protein. One I've got in there is one breast of skinless chicken,",
        "extra_info": ""
    },
    {
        "text": "which is about 200 grams.",
        "extra_info": ""
    },
    {
        "text": "And what you need is a good pinch of salt, and the chicken breast needs to be cold,",
        "extra_info": ""
    },
    {
        "text": "and it's important that it's cold because it's going into a machine,",
        "extra_info": ""
    },
    {
        "text": "that's gonna affect that. It's gonna get warmer, but there's something to do",
        "extra_info": ""
    },
    {
        "text": "with keeping it cold and the addition of salt, that is gonna tighten the protein",
        "extra_info": ""
    },
    {
        "text": "in that chicken. And that's important, because what we're gonna do",
        "extra_info": ""
    },
    {
        "text": "is we're gonna add another protein on top of that, which is egg white.",
        "extra_info": ""
    },
    {
        "text": "So you're gonna end up with a nice tight bowl of essentially protein,",
        "extra_info": ""
    },
    {
        "text": "which is chicken and egg white. And then you're gonna cut that with fat.",
        "extra_info": ""
    },
    {
        "text": "And in this case it's cream.",
        "extra_info": ""
    },
    {
        "text": "Now what we're gonna do is we're gonna add the egg white.",
        "extra_info": ""
    },
    {
        "text": "There's three egg whites in there.",
        "extra_info": ""
    },
    {
        "text": "Right.",
        "extra_info": ""
    },
    {
        "text": "The reason I left it for so long, is that when you put the egg white in,",
        "extra_info": ""
    },
    {
        "text": "straight away, becomes like a liquid, it chops all the chicken up,",
        "extra_info": ""
    },
    {
        "text": "becomes like minced chicken suspended in egg white.",
        "extra_info": ""
    },
    {
        "text": "And then what happens, the more the proteins are bashed around in there,",
        "extra_info": ""
    },
    {
        "text": "they stretch, they bond, and all of a sudden, it comes together.",
        "extra_info": ""
    },
    {
        "text": "That's what you're looking for. Now you've got a nice tight,",
        "extra_info": ""
    },
    {
        "text": "smooth chicken farce, or puree, and now you cut it with cream.",
        "extra_info": ""
    },
    {
        "text": "So that's the chicken.",
        "extra_info": ""
    },
    {
        "text": "Now we're gonna add this, this panade, or this bread.",
        "extra_info": ""
    },
    {
        "text": "You can squeeze it to see if you can get any excess moisture out of it",
        "extra_info": ""
    },
    {
        "text": "and just to leave that panade or that bread, nice and soft, but moist.",
        "extra_info": ""
    },
    {
        "text": "Now we're gonna put in the cream. So I've got 250 mils of cream,",
        "extra_info": ""
    },
    {
        "text": "in essence, what you're looking for, is it to bond and bind together",
        "extra_info": ""
    },
    {
        "text": "into a nice smooth mousse and then turn it off.",
        "extra_info": ""
    },
    {
        "text": "And in trickle, the cream in.",
        "extra_info": ""
    },
    {
        "text": "That's it.",
        "extra_info": ""
    },
    {
        "text": "That's a really good technique to learn. Chicken mousse.",
        "extra_info": ""
    },
    {
        "text": "That's what it is.",
        "extra_info": ""
    },
    {
        "text": "Okay, so now we're gonna pop this into a bowl,",
        "extra_info": ""
    },
    {
        "text": "and this is why something like a flexible spatula is absolutely invaluable at home,",
        "extra_info": ""
    },
    {
        "text": "but also in your kitchen at work.",
        "extra_info": ""
    },
    {
        "text": "George, how about popping that truffle in there?",
        "extra_info": ""
    },
    {
        "text": "- Beautiful. - Give it a mix.",
        "extra_info": ""
    },
    {
        "text": "Now, what I've got here is some sausage casing, so some sheep's casing.",
        "extra_info": ""
    },
    {
        "text": "These are quite small, and what we've done is we've soaked these in clean running water.",
        "extra_info": ""
    },
    {
        "text": "So, down into the bag.",
        "extra_info": ""
    },
    {
        "text": "Getting all that truffle, George.",
        "extra_info": ""
    },
    {
        "text": "Just let any air out.",
        "extra_info": ""
    },
    {
        "text": "Because if you get air in it, when you force the mousse into the sausage skin,",
        "extra_info": ""
    },
    {
        "text": "you're gonna get... little pockets of air. So if you can tap it out,",
        "extra_info": ""
    },
    {
        "text": "and then push it back down into the body of the piping bag,",
        "extra_info": ""
    },
    {
        "text": "you're gonna get a nice clean farce going into the sausages.",
        "extra_info": ""
    },
    {
        "text": "So now what we're gonna is we're gonna take the sheep casing",
        "extra_info": ""
    },
    {
        "text": "and you pop it on the end of the piping bag. On the tube.",
        "extra_info": ""
    },
    {
        "text": "Then what you do is you just start it off,",
        "extra_info": ""
    },
    {
        "text": "so just pipe a little bit in, and then you need to create a bit of tension,",
        "extra_info": ""
    },
    {
        "text": "and then let the sausage skin out slowly,",
        "extra_info": ""
    },
    {
        "text": "and you end up...",
        "extra_info": ""
    },
    {
        "text": "you end up with a little line of sausage.",
        "extra_info": ""
    },
    {
        "text": "And I'll just get George to tie a couple of these off,",
        "extra_info": ""
    },
    {
        "text": "but just to show you, I've seen a couple of you have trouble tying stuff,",
        "extra_info": ""
    },
    {
        "text": "so you push the ingredient in, and then around your thumb,",
        "extra_info": ""
    },
    {
        "text": "and under, so then you can push that knot onto the sausage. Alright?",
        "extra_info": ""
    },
    {
        "text": "So George will tie a couple off into the nice sort of chipolatas,",
        "extra_info": ""
    },
    {
        "text": "and I'll just do a couple more.",
        "extra_info": ""
    },
    {
        "text": "Is it better to tie them off with string as opposed to like twisting them?",
        "extra_info": ""
    },
    {
        "text": "You can twist them, but I find I get this perfect shape, perfect length.",
        "extra_info": ""
    },
    {
        "text": "They look good, don't they?",
        "extra_info": ""
    },
    {
        "text": "It's really important that the bench is wet, you lubricate it,",
        "extra_info": ""
    },
    {
        "text": "so the actual skin can move around and not be stuck on there",
        "extra_info": ""
    },
    {
        "text": "or you'll just rip them apart.",
        "extra_info": ""
    },
    {
        "text": "You wanna cover those just with enough water,",
        "extra_info": ""
    },
    {
        "text": "just to cover the top of the sausages. - Cold water.",
        "extra_info": ""
    },
    {
        "text": "Cold water. And then we do is we bring them very gently",
        "extra_info": ""
    },
    {
        "text": "up to a slow poaching temperature, which is just under the boil.",
        "extra_info": ""
    },
    {
        "text": "So you're looking at sort of 90 degrees. And you cook it for about six minutes,",
        "extra_info": ""
    },
    {
        "text": "turn the gas off, and just let them draw through.",
        "extra_info": ""
    },
    {
        "text": "The paper's just there just to make sure that all the sausages are submerged.",
        "extra_info": ""
    },
    {
        "text": "- Still to come. - Up with a little bit of your",
        "extra_info": ""
    },
    {
        "text": "onion marmelade on the bottom, and I think I'm gonna put",
        "extra_info": ""
    },
    {
        "text": "a little dollop on the top.",
        "extra_info": ""
    },
    {
        "text": "Gary and George serve up their sensational sausages.",
        "extra_info": ""
    },
    {
        "text": "Soft, very light, and the taste of truffle. This is beautiful.",
        "extra_info": ""
    },
    {
        "text": "So, these have been cooking for about six minutes,",
        "extra_info": ""
    },
    {
        "text": "then we've allowed them to cool down, not to go completely cold,",
        "extra_info": ""
    },
    {
        "text": "but allowed them to cool down in that water, or that stock.",
        "extra_info": ""
    },
    {
        "text": "And because it's such a delicate sausage, you wanna take the skins off.",
        "extra_info": ""
    },
    {
        "text": "And George has actually done some caramelized onion,",
        "extra_info": ""
    },
    {
        "text": "which he deglazed with a little bit of vinegar,",
        "extra_info": ""
    },
    {
        "text": "which is, you know, quite adult,",
        "extra_info": ""
    },
    {
        "text": "and that's what we're gonna serve with these.",
        "extra_info": ""
    },
    {
        "text": "So as you can see, this little casing will come off quite easily,",
        "extra_info": ""
    },
    {
        "text": "so you end up with that tiny little soft sausage.",
        "extra_info": ""
    },
    {
        "text": "It's such a delicate little thing, you can put that in a soup,",
        "extra_info": ""
    },
    {
        "text": "or a little essence, or it could be a part of a little fricassee that you made,",
        "extra_info": ""
    },
    {
        "text": "or a little standalone dish. And it really is a lovely delicate,",
        "extra_info": ""
    },
    {
        "text": "highly labor-intensive dish.",
        "extra_info": ""
    },
    {
        "text": "So what George is doing now is just frying these off,",
        "extra_info": ""
    },
    {
        "text": "we're just gonna give them a little bit of color,",
        "extra_info": ""
    },
    {
        "text": "and then put some butter, some seasoning.",
        "extra_info": ""
    },
    {
        "text": "- They're looking good. - Yeah. Beautiful.",
        "extra_info": ""
    },
    {
        "text": "It's important to start with oil, and then finish with butter.",
        "extra_info": ""
    },
    {
        "text": "If you start with butter, the butter will go dark and burnt,",
        "extra_info": ""
    },
    {
        "text": "and you'll get all these specks of burnt butter all over your sausages.",
        "extra_info": ""
    },
    {
        "text": "So I've popped in about 150 grams of butter there.",
        "extra_info": ""
    },
    {
        "text": "I'm not gonna serve all that butter, okay? It's just there to",
        "extra_info": ""
    },
    {
        "text": "coat them, glaze them. I'm gonna pop some thyme in just at the last minute.",
        "extra_info": ""
    },
    {
        "text": "- We'll plate them up, Gary? - Yeah. Let's go for it.",
        "extra_info": ""
    },
    {
        "text": "I'll put a little bit of your onion marmelade on the bottom,",
        "extra_info": ""
    },
    {
        "text": "and I think I'm gonna put a little dollop on the top, so I'll follow you.",
        "extra_info": ""
    },
    {
        "text": "- We did a little dance there, George. - We did. Little shimmies.",
        "extra_info": ""
    },
    {
        "text": "I'll come back here and I'll leave you with the herbs.",
        "extra_info": ""
    },
    {
        "text": "- Shall I put it at the end like that? - Yeah.",
        "extra_info": ""
    },
    {
        "text": "George. I don't know about you, but that looks pretty adult,",
        "extra_info": ""
    },
    {
        "text": "and absolutely gorgeous.",
        "extra_info": ""
    },
    {
        "text": "Okay. Top tips for a little boudin blanc.",
        "extra_info": ""
    },
    {
        "text": "Remember to make a really good tight mousse.",
        "extra_info": ""
    },
    {
        "text": "First of all with the proteins, so chicken and egg white.",
        "extra_info": ""
    },
    {
        "text": "That's crucial. And then split it down with the cream or a little bit of butter.",
        "extra_info": ""
    },
    {
        "text": "That's tip number one. Tip number two",
        "extra_info": ""
    },
    {
        "text": "is try and use natural casings. We've got a responsibility I think to use",
        "extra_info": ""
    },
    {
        "text": "a whole animal, it's ethical. And the last tip.",
        "extra_info": ""
    },
    {
        "text": "Creativity's yours, and think of that boudin blanc as a start.",
        "extra_info": ""
    },
    {
        "text": "Which is a little nice technique to learn and build as part of your repertoir.",
        "extra_info": ""
    },
    {
        "text": "Right, there are little truffle and chicken boudin blanc with caramelized onion.",
        "extra_info": ""
    },
    {
        "text": "I think we should get a few people down to taste.",
        "extra_info": ""
    },
    {
        "text": "Yeah.",
        "extra_info": ""
    },
    {
        "text": "- Jake, want one? - Yeah, thanks mate.",
        "extra_info": ""
    },
    {
        "text": "- I'll bring you one. - Jimmy, come on, Aaron.",
        "extra_info": ""
    },
    {
        "text": "Come over. Joanne, come over here. Try.",
        "extra_info": ""
    },
    {
        "text": "One more. Alvin.",
        "extra_info": ""
    },
    {
        "text": "- George, thanks man. - One more. Gary.",
        "extra_info": ""
    },
    {
        "text": "Joanne, what do you think? Nice?",
        "extra_info": ""
    },
    {
        "text": "- It's gorgeous. - What do you think of the texture of the",
        "extra_info": ""
    },
    {
        "text": "little sausage, the boudin blanc. - It's soft and very light,",
        "extra_info": ""
    },
    {
        "text": "it tastes of truffle. It is beautiful.",
        "extra_info": ""
    },
    {
        "text": "And the caramelized onion just finishes it off. Thank you.",
        "extra_info": ""
    },
    {
        "text": "- Aaron? - Anything with truffle in it",
        "extra_info": ""
    },
    {
        "text": "is my favorite straight away. - You're fan of boudin blanc now?",
        "extra_info": ""
    },
    {
        "text": "I am, I haven't had it before, but the texture of the sausage, it was so light,",
        "extra_info": ""
    },
    {
        "text": "it was amazing, and the truffle went through",
        "extra_info": ""
    },
    {
        "text": "and the caramelized onion on top was just a great finish.",
        "extra_info": ""
    },
    {
        "text": "I really enjoyed it. - So adult party food you think?",
        "extra_info": ""
    },
    {
        "text": "I'll be there at that party for sure. Absolutely. Cheers. Appreciate that.",
        "extra_info": ""
    },
    {
        "text": "Hey guys, welcome back. Come on in.",
        "extra_info": ""
    },
    {
        "text": "- Good day? - Awesome.",
        "extra_info": ""
    },
    {
        "text": "Well done.",
        "extra_info": ""
    },
    {
        "text": "Come and take a seat.",
        "extra_info": ""
    },
    {
        "text": "Courtney, you happy that you got sent on that little private MasterClass?",
        "extra_info": ""
    },
    {
        "text": "Yeah, definitely. I mean, you can't go knock on doors",
        "extra_info": ""
    },
    {
        "text": "and get in and see things like that off the street so",
        "extra_info": ""
    },
    {
        "text": "big privilege to go in there and yeah, all four of us, thank you.",
        "extra_info": ""
    },
    {
        "text": "Brilliant. I hope you pass on your stories to the rest of the team,",
        "extra_info": ""
    },
    {
        "text": "and hopefully all the little tips that you learned.",
        "extra_info": ""
    },
    {
        "text": "All right guys, come on down, grab a plate,",
        "extra_info": ""
    },
    {
        "text": "and let's have a bite to eat to celebrate",
        "extra_info": ""
    },
    {
        "text": "what a big week it's been for all.",
        "extra_info": ""
    },
    {
        "text": "Come on. That's it, come on. Get in there, my son.",
        "extra_info": ""
    },
    {
        "text": "Guys, it's been a massive week, but take a look around you.",
        "extra_info": ""
    },
    {
        "text": "This is the top 20. We've got a lovely bunch of people,",
        "extra_info": ""
    },
    {
        "text": "some great cooks, make the most of it and celebrate the moment.",
        "extra_info": ""
    },
    {
        "text": "Everybody cheers! It's gonna be a massive week.",
        "extra_info": ""
    },
    {
        "text": "Hold on and keep your arms in the vehicle at all times.",
        "extra_info": ""
    },
    {
        "text": "Next time on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "What dark horrors lie inside the mystery box today?",
        "extra_info": ""
    },
    {
        "text": "The amateurs start a big week thinking outside the square.",
        "extra_info": ""
    },
    {
        "text": "Ding ding, first round, come on.",
        "extra_info": ""
    },
    {
        "text": "Then, the kitchen heats up with the invention test.",
        "extra_info": ""
    },
    {
        "text": "If there's ever time to spice things up, it's now.",
        "extra_info": ""
    },
    {
        "text": "Come on, guys, chop chop, let's go.",
        "extra_info": ""
    },
    {
        "text": "For the contestant with the best dish, a shot at immunity.",
        "extra_info": ""
    },
    {
        "text": "I'm actually feeling pretty confident.",
        "extra_info": ""
    },
    {
        "text": "Today might be my day.",
        "extra_info": ""
    },
    {
        "text": "But for the three worst, their dream will be on the line.",
        "extra_info": ""
    },
    {
        "text": "I'm not that excited about eating that, I must be honest.",
        "extra_info": ""
    },
    {
        "text": "It was like all eyes were on me for some weird reason.",
        "extra_info": ""
    },
    {
        "text": "I don't like it.",
        "extra_info": ""
    }
]