[
    {
        "text": "Last night on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "You're about to embark on the French team challenge.",
        "extra_info": ""
    },
    {
        "text": "Two teams cooked a classic French menu",
        "extra_info": ""
    },
    {
        "text": "for two formidable names of the culinary world.",
        "extra_info": ""
    },
    {
        "text": "- Tetsuya and Guillaume Brahimi. - Magnifique.",
        "extra_info": ""
    },
    {
        "text": "And while the blue team served up the best and won the reward...",
        "extra_info": ""
    },
    {
        "text": "Pilu is waiting for you. Go and enjoy yourselves.",
        "extra_info": ""
    },
    {
        "text": "... the red team were not so lucky.",
        "extra_info": ""
    },
    {
        "text": "Now it means that our whole team will be going into elimination.",
        "extra_info": ""
    },
    {
        "text": "Tonight, the red team face off in the fight of their lives.",
        "extra_info": ""
    },
    {
        "text": "You'll all face a basic skills test.",
        "extra_info": ""
    },
    {
        "text": "First up, it's a race to create the perfect pesto.",
        "extra_info": ""
    },
    {
        "text": "Then, their culinary knowledge stands between their dream and elimination.",
        "extra_info": ""
    },
    {
        "text": "You're one mistake away from walking out that door for the last time.",
        "extra_info": ""
    },
    {
        "text": "Red team, nine of you sitting here, one of you will be going home.",
        "extra_info": ""
    },
    {
        "text": "You know, overall, it was an amazing effort,",
        "extra_info": ""
    },
    {
        "text": "but yesterday the blue team just knocked it out of the ballpark.",
        "extra_info": ""
    },
    {
        "text": "We'd really done pretty much everything we could to win this thing.",
        "extra_info": ""
    },
    {
        "text": "I think the blue team just had a couple of cracking dishes that were really",
        "extra_info": ""
    },
    {
        "text": "way beyond what we've done.",
        "extra_info": ""
    },
    {
        "text": "It's cooked perfect. Really.",
        "extra_info": ""
    },
    {
        "text": "Red team, it's all down to you now, not as a team, but as individuals.",
        "extra_info": ""
    },
    {
        "text": "One of you is going home, and it could be you.",
        "extra_info": ""
    },
    {
        "text": "Take some time now to gather yourselves, go upstairs,",
        "extra_info": ""
    },
    {
        "text": "and we'll see you back here shortly.",
        "extra_info": ""
    },
    {
        "text": "Coming upstairs, we're all just gutted. After a day like yesterday,",
        "extra_info": ""
    },
    {
        "text": "which was probably the best day I've ever had in a kitchen ever,",
        "extra_info": ""
    },
    {
        "text": "it's hard to cope at the moment.",
        "extra_info": ""
    },
    {
        "text": "I kinda feel like I'm finding my feet in the competition a bit,",
        "extra_info": ""
    },
    {
        "text": "and it just doesn't feel right to go home from what we did yesterday.",
        "extra_info": ""
    },
    {
        "text": "There's still a lot to be learned. For me, it's really important to stay.",
        "extra_info": ""
    },
    {
        "text": "I'm just saying, I think I'll be lost if I go home now.",
        "extra_info": ""
    },
    {
        "text": "It would just be like.",
        "extra_info": ""
    },
    {
        "text": "Blue team won the French challenge, so we're off to Pilu at Freshwater for",
        "extra_info": ""
    },
    {
        "text": "a beautiful lunch and a MasterClass. Very excited.",
        "extra_info": ""
    },
    {
        "text": "I'm so happy that I finally made it to rewards lunch.",
        "extra_info": ""
    },
    {
        "text": "And the victory is pretty sweet.",
        "extra_info": ""
    },
    {
        "text": "I'm going to prepare like a Sardinian lunch,",
        "extra_info": ""
    },
    {
        "text": "and it'll be about four dishes.",
        "extra_info": ""
    },
    {
        "text": "I'm going to do some prawns with fregola,",
        "extra_info": ""
    },
    {
        "text": "and little grape tomatoes, we've got a few different colors.",
        "extra_info": ""
    },
    {
        "text": "Then I'll do culunzones, or ravioli,",
        "extra_info": ""
    },
    {
        "text": "and then obviously, I couldn't let you come without trying a suckling pig.",
        "extra_info": ""
    },
    {
        "text": "This is going to be an absolute feast for the senses,",
        "extra_info": ""
    },
    {
        "text": "the stomach and the mind.",
        "extra_info": ""
    },
    {
        "text": "After a beautiful lunch, we now get to go into the kitchen for a MasterClass.",
        "extra_info": ""
    },
    {
        "text": "So this is the culunzones.",
        "extra_info": ""
    },
    {
        "text": "Giovanni's going to show us how to make the little raviolis.",
        "extra_info": ""
    },
    {
        "text": "And then, this is the filling. It's potato, mint, pecorino cheese,",
        "extra_info": ""
    },
    {
        "text": "and then what you do, you pipe a small amount of this onto the dough like this.",
        "extra_info": ""
    },
    {
        "text": "Pick it up like this, then you push with the thumb in the back here,",
        "extra_info": ""
    },
    {
        "text": "and then you start pinching and pinching and pinch, pinch.",
        "extra_info": ""
    },
    {
        "text": "So that's the idea.",
        "extra_info": ""
    },
    {
        "text": "The more you practice, the more you're gonna get them like that eventually.",
        "extra_info": ""
    },
    {
        "text": "We've had a lovely day, but obviously if we do spare a thought for the red team.",
        "extra_info": ""
    },
    {
        "text": "You just really try to remain positive for each individual.",
        "extra_info": ""
    },
    {
        "text": "This is the first time I've had to don the black apron.",
        "extra_info": ""
    },
    {
        "text": "You feel very vulnerable, because you're one mistake away",
        "extra_info": ""
    },
    {
        "text": "from walking out that door for the last time.",
        "extra_info": ""
    },
    {
        "text": "To determine which one of you will go home today",
        "extra_info": ""
    },
    {
        "text": "you'll all face a basic skills test.",
        "extra_info": ""
    },
    {
        "text": "This is the way it's going to work. There'll be two rounds of basic skills.",
        "extra_info": ""
    },
    {
        "text": "From round one we'll pick the worst three performers.",
        "extra_info": ""
    },
    {
        "text": "They will go through to the second and final round.",
        "extra_info": ""
    },
    {
        "text": "The person that performs the worst in round two will then be eliminated.",
        "extra_info": ""
    },
    {
        "text": "There are so many basic skills as a chef and everyone on the red team",
        "extra_info": ""
    },
    {
        "text": "is extremely strong. I'm looking around, I'm feeling pretty intimidated.",
        "extra_info": ""
    },
    {
        "text": "But first we must find out what you are making.",
        "extra_info": ""
    },
    {
        "text": "And the answer.",
        "extra_info": ""
    },
    {
        "text": "Pesto.",
        "extra_info": ""
    },
    {
        "text": "This little green bowl of pesto could possibly send me home.",
        "extra_info": ""
    },
    {
        "text": "So I'm incredibly nervous.",
        "extra_info": ""
    },
    {
        "text": "Here's the challenge. You've got a 10 minute time limit, and within that 10 minutes",
        "extra_info": ""
    },
    {
        "text": "not only you have to produce the same quality of pesto that I have in front of me,",
        "extra_info": ""
    },
    {
        "text": "but you also have to choose your ingredients.",
        "extra_info": ""
    },
    {
        "text": "You've got 10 minutes to do this, that's not long at all.",
        "extra_info": ""
    },
    {
        "text": "Why? You have to do this the old-fashioned way.",
        "extra_info": ""
    },
    {
        "text": "In a mortar and pestle.",
        "extra_info": ""
    },
    {
        "text": "All that in 10 minutes? Guess they don't call it an elimination round for nothing.",
        "extra_info": ""
    },
    {
        "text": "The last thing you get to do is to have a taste.",
        "extra_info": ""
    },
    {
        "text": "So you know what you're aiming for.",
        "extra_info": ""
    },
    {
        "text": "What we're gonna look for is this classic Genovese style.",
        "extra_info": ""
    },
    {
        "text": "We wanna see a pesto that is brilliantly green,",
        "extra_info": ""
    },
    {
        "text": "that's maintained the color of the herb.",
        "extra_info": ""
    },
    {
        "text": "We wanna see a balance of flavors in the ingredients.",
        "extra_info": ""
    },
    {
        "text": "They all mesh together beautifully.",
        "extra_info": ""
    },
    {
        "text": "We have to make a classic Genovese style pesto,",
        "extra_info": ""
    },
    {
        "text": "so, basil, pine nuts, garlic, parmesan, and olive oil.",
        "extra_info": ""
    },
    {
        "text": "I'm fairly confident with that.",
        "extra_info": ""
    },
    {
        "text": "Your 10 minutes starts now.",
        "extra_info": ""
    },
    {
        "text": "The time starts, and it's a mad rush.",
        "extra_info": ""
    },
    {
        "text": "It's worse than the Boxing Day sale at Myer's.",
        "extra_info": ""
    },
    {
        "text": "It's just a mad scramble because there's no more friends in this competition,",
        "extra_info": ""
    },
    {
        "text": "it's just competitors.",
        "extra_info": ""
    },
    {
        "text": "Ten minutes isn't a long time. Everything goes out the window,",
        "extra_info": ""
    },
    {
        "text": "your train of thought, your brain, your calmness. Everything goes.",
        "extra_info": ""
    },
    {
        "text": "Basil flying everywhere, pine nuts being thrown across benches,",
        "extra_info": ""
    },
    {
        "text": "we've just got to be on autopilot and make things happen quickly.",
        "extra_info": ""
    },
    {
        "text": "I'm chopping my way through the basil,",
        "extra_info": ""
    },
    {
        "text": "and I'm doing one process at the same time as another,",
        "extra_info": ""
    },
    {
        "text": "and I've just toasted my pine nuts and thrown them all in",
        "extra_info": ""
    },
    {
        "text": "and I realized I've used probably about three times the amount I need.",
        "extra_info": ""
    },
    {
        "text": "I've snuck in a few cashews with my pine nuts,",
        "extra_info": ""
    },
    {
        "text": "just to add a creaminess to the pesto,",
        "extra_info": ""
    },
    {
        "text": "hoping the judges aren't gonna see or notice, that might just give me that edge.",
        "extra_info": ""
    },
    {
        "text": "Most of them picked up pine nuts, but Jake, he picked up cashews.",
        "extra_info": ""
    },
    {
        "text": "Yeah, not good.",
        "extra_info": ""
    },
    {
        "text": "Well, a classic Genovese pesto has to be basil,",
        "extra_info": ""
    },
    {
        "text": "has to be parmesan and pine nuts. That's principally what our pesto was.",
        "extra_info": ""
    },
    {
        "text": "There's no winner today. One of my teammates is going home, so",
        "extra_info": ""
    },
    {
        "text": "hopefully it's not me, but whoever it is, I'll be disappointed.",
        "extra_info": ""
    },
    {
        "text": "We only have ten minutes to make a classic Genovese style pesto.",
        "extra_info": ""
    },
    {
        "text": "The worst three performers will go into a sudden death elimination",
        "extra_info": ""
    },
    {
        "text": "where one person is going to go home.",
        "extra_info": ""
    },
    {
        "text": "Guys, you need more energy, you've got five minutes to go.",
        "extra_info": ""
    },
    {
        "text": "I'm not even thinking about amounts going in,",
        "extra_info": ""
    },
    {
        "text": "I'm just going psycho on the mortar and pestle.",
        "extra_info": ""
    },
    {
        "text": "I know I've got to make a cup and a cup sounds like a lot.",
        "extra_info": ""
    },
    {
        "text": "I decide to chuck another clove of garlic in to try and build my volume up.",
        "extra_info": ""
    },
    {
        "text": "The whole time I can hear this huge amount of noise.",
        "extra_info": ""
    },
    {
        "text": "There's nine mortar and pestles banging on those benches,",
        "extra_info": ""
    },
    {
        "text": "just going hell for leather.",
        "extra_info": ""
    },
    {
        "text": "As I'm pounding away, I can see that my pesto is going too thick,",
        "extra_info": ""
    },
    {
        "text": "and not the paste that I want.",
        "extra_info": ""
    },
    {
        "text": "As the time's slipping away, I'm starting to panic.",
        "extra_info": ""
    },
    {
        "text": "You have one minute to go, guys, pressure's on.",
        "extra_info": ""
    },
    {
        "text": "I taste my pesto.",
        "extra_info": ""
    },
    {
        "text": "I realize I've got too much parmesan in it,",
        "extra_info": ""
    },
    {
        "text": "so now what I have to do is start picking leaves in the last 60 seconds",
        "extra_info": ""
    },
    {
        "text": "and getting them into the pesto to bring out that basil flavor.",
        "extra_info": ""
    },
    {
        "text": "There's about 40 seconds to go, I've got to get this baby into the bowl,",
        "extra_info": ""
    },
    {
        "text": "I decide to taste it and... Whoa, baby, she's got some garlic in there.",
        "extra_info": ""
    },
    {
        "text": "It's an in your face pesto.",
        "extra_info": ""
    },
    {
        "text": "You have 10 seconds.",
        "extra_info": ""
    },
    {
        "text": "5",
        "extra_info": ""
    },
    {
        "text": "4",
        "extra_info": ""
    },
    {
        "text": "3",
        "extra_info": ""
    },
    {
        "text": "2",
        "extra_info": ""
    },
    {
        "text": "1",
        "extra_info": ""
    },
    {
        "text": "That's it, guys. Time's up. Step away from your benches.",
        "extra_info": ""
    },
    {
        "text": "So ten minutes is up. Pesto is done. Can't do anything about it now.",
        "extra_info": ""
    },
    {
        "text": "It's definitely too cheesy.",
        "extra_info": ""
    },
    {
        "text": "I've got a cup. I've got the right consistency, but...",
        "extra_info": ""
    },
    {
        "text": "Taste? Who knows?",
        "extra_info": ""
    },
    {
        "text": "You've just completed making a cup of traditional Genovese pesto.",
        "extra_info": ""
    },
    {
        "text": "The three least impressive pestoes will earn their makers possible elimination.",
        "extra_info": ""
    },
    {
        "text": "Let's taste our first pesto. Jake's.",
        "extra_info": ""
    },
    {
        "text": "Is there cashews in there?",
        "extra_info": ""
    },
    {
        "text": "Tiny amount.",
        "extra_info": ""
    },
    {
        "text": "Interesting.",
        "extra_info": ""
    },
    {
        "text": "It's nice and green, but the basil flavor is not there,",
        "extra_info": ""
    },
    {
        "text": "it's dominated by cheese and dominated by garlic.",
        "extra_info": ""
    },
    {
        "text": "Whoa.",
        "extra_info": ""
    },
    {
        "text": "In your face.",
        "extra_info": ""
    },
    {
        "text": "It's green, it's vibrant. It looks gorgeous.",
        "extra_info": ""
    },
    {
        "text": "And from a visual point of view, wow.",
        "extra_info": ""
    },
    {
        "text": "So much lemon in that. Could be spinach, when I close my eyes,",
        "extra_info": ""
    },
    {
        "text": "with a little bit of cheese.",
        "extra_info": ""
    },
    {
        "text": "Can't taste the basil.",
        "extra_info": ""
    },
    {
        "text": "The flavor of basil is the first flavor you taste.",
        "extra_info": ""
    },
    {
        "text": "The other flavorings are there as a support,",
        "extra_info": ""
    },
    {
        "text": "so the flavors are in balance, it's a good pesto,",
        "extra_info": ""
    },
    {
        "text": "it's a sort of pesto I was looking for.",
        "extra_info": ""
    },
    {
        "text": "Job well done.",
        "extra_info": ""
    },
    {
        "text": "I should be feeling really happy. I'm not.",
        "extra_info": ""
    },
    {
        "text": "I'm looking down the line, and I'm thinking,",
        "extra_info": ""
    },
    {
        "text": "one of these people is going home, and there's not a single one there",
        "extra_info": ""
    },
    {
        "text": "that I wanna lose.",
        "extra_info": ""
    },
    {
        "text": "We said from the start what we were looking for is the three worst pestoes.",
        "extra_info": ""
    },
    {
        "text": "Well, if you're gonna cross your fingers, do it now.",
        "extra_info": ""
    },
    {
        "text": "I'm just about to name the three people that failed to impress us",
        "extra_info": ""
    },
    {
        "text": "with their pestoes.",
        "extra_info": ""
    },
    {
        "text": "When I call your name, I'd like you to step forward.",
        "extra_info": ""
    },
    {
        "text": "The first person going through into the elimination round is",
        "extra_info": ""
    },
    {
        "text": "Daniel.",
        "extra_info": ""
    },
    {
        "text": "The next person",
        "extra_info": ""
    },
    {
        "text": "is Sharnee.",
        "extra_info": ""
    },
    {
        "text": "The third and final person in the elimination round is",
        "extra_info": ""
    },
    {
        "text": "The third and final person in the elimination round is",
        "extra_info": ""
    },
    {
        "text": "Courtney.",
        "extra_info": ""
    },
    {
        "text": "I'm relieved, but I'm not happy.",
        "extra_info": ""
    },
    {
        "text": "You know, one of my teammates and friends is going home.",
        "extra_info": ""
    },
    {
        "text": "Now unfortunately, you need to say goodbyes.",
        "extra_info": ""
    },
    {
        "text": "For one of these three, their journey in the MasterChef kitchen will be over.",
        "extra_info": ""
    },
    {
        "text": "You just work your butt off, okay? You can do it, okay?",
        "extra_info": ""
    },
    {
        "text": "I'm really not ready to go home,",
        "extra_info": ""
    },
    {
        "text": "because I don't feel like I've shown the judges what I'm capable of.",
        "extra_info": ""
    },
    {
        "text": "I'm extremely passionate about food.",
        "extra_info": ""
    },
    {
        "text": "It's the one thing I feel like I can really put all my personality into,",
        "extra_info": ""
    },
    {
        "text": "and I guess the search for perfection really drives me.",
        "extra_info": ""
    },
    {
        "text": "This is my last chance. If I don't get this right, I'm going home.",
        "extra_info": ""
    },
    {
        "text": "My food dream is to become a well respected chef",
        "extra_info": ""
    },
    {
        "text": "and own a restaurant that's booked out every night.",
        "extra_info": ""
    },
    {
        "text": "I really need to be in this for quite a bit longer to get what I want out of MasterChef.",
        "extra_info": ""
    },
    {
        "text": "For twelve years I've been putting all my time and efforts into something",
        "extra_info": ""
    },
    {
        "text": "that's now what I want to be doing at the end of the day.",
        "extra_info": ""
    },
    {
        "text": "Pouring beers certainly wasn't on my agenda when I left school.",
        "extra_info": ""
    },
    {
        "text": "I really do need to stay here long enough to sort out",
        "extra_info": ""
    },
    {
        "text": "what I wanna do.",
        "extra_info": ""
    },
    {
        "text": "Sharnee, Courtney, Daniel. The final round of this challenge will be",
        "extra_info": ""
    },
    {
        "text": "Name this herb.",
        "extra_info": ""
    },
    {
        "text": "Under each of these cloches behind me sits a culinary herb.",
        "extra_info": ""
    },
    {
        "text": "One by one, you will lift up the cloches and reveal a herb.",
        "extra_info": ""
    },
    {
        "text": "You'll be able to smell, touch and taste that herb,",
        "extra_info": ""
    },
    {
        "text": "then have 20 seconds to write down what you think the name of that herb is.",
        "extra_info": ""
    },
    {
        "text": "It is my last chance in the competition.",
        "extra_info": ""
    },
    {
        "text": "If I get one thing wrong here, that's it, I'm going home.",
        "extra_info": ""
    },
    {
        "text": "It's time to name that herb.",
        "extra_info": ""
    },
    {
        "text": "And the first herb that you need to name, is...",
        "extra_info": ""
    },
    {
        "text": "We kind of look at it and I go, just cooked with that.",
        "extra_info": ""
    },
    {
        "text": "But like always, you're worried that there's a trick in these things.",
        "extra_info": ""
    },
    {
        "text": "Are they tricking us?",
        "extra_info": ""
    },
    {
        "text": "Sharnee, Courtney, Daniel, reveal the name of the first herb, please.",
        "extra_info": ""
    },
    {
        "text": "Basil",
        "extra_info": ""
    },
    {
        "text": "Basil",
        "extra_info": ""
    },
    {
        "text": "Basil",
        "extra_info": ""
    },
    {
        "text": "All three of you are correct.",
        "extra_info": ""
    },
    {
        "text": "The first herb is basil.",
        "extra_info": ""
    },
    {
        "text": "I'm certainly relieved that it is, in fact, basil,",
        "extra_info": ""
    },
    {
        "text": "given that we just spent ten minutes making pesto.",
        "extra_info": ""
    },
    {
        "text": "Well done. Fantastic start. It's now time to name the second herb.",
        "extra_info": ""
    },
    {
        "text": "I look at it, I know straightaway it's mint.",
        "extra_info": ""
    },
    {
        "text": "But once again, I'm just looking for the trick, I think,",
        "extra_info": ""
    },
    {
        "text": "there's got to be more to this.",
        "extra_info": ""
    },
    {
        "text": "This is MasterChef, there's got to be more to this answer.",
        "extra_info": ""
    },
    {
        "text": "So I'm standing back in my spot writing mint, M-I-N-T,",
        "extra_info": ""
    },
    {
        "text": "and I can hear Courtney next to me writing something a lot longer.",
        "extra_info": ""
    },
    {
        "text": "Courtney has written something different, and I'm a little worried,",
        "extra_info": ""
    },
    {
        "text": "because she's not the sort of girl, that's gonna get this thing wrong.",
        "extra_info": ""
    },
    {
        "text": "Daniel, Courtney, Sharnee, time to reveal your answers.",
        "extra_info": ""
    },
    {
        "text": "Mint",
        "extra_info": ""
    },
    {
        "text": "Mint",
        "extra_info": ""
    },
    {
        "text": "Spearmint",
        "extra_info": ""
    },
    {
        "text": "Sharnee and Dan have both written mint, and I've written spearmint.",
        "extra_info": ""
    },
    {
        "text": "I know in the back of my head, I'm going, oh my God,",
        "extra_info": ""
    },
    {
        "text": "I've thought about this too much.",
        "extra_info": ""
    },
    {
        "text": "I hope I haven't been too cocky, and I'm sort of thinking,",
        "extra_info": ""
    },
    {
        "text": "why didn't I at least just bloody tasted the herb, you know.",
        "extra_info": ""
    },
    {
        "text": "Well, we've got two mints, and one spearmint.",
        "extra_info": ""
    },
    {
        "text": "And Courtney, that means that if you got this right,",
        "extra_info": ""
    },
    {
        "text": "you've saved yourself in this competition, you don't have to name any other herbs.",
        "extra_info": ""
    },
    {
        "text": "If you got it wrong, it means that you're walking out those doors tonight",
        "extra_info": ""
    },
    {
        "text": "and this is the last time you'll see the MasterChef kitchen.",
        "extra_info": ""
    },
    {
        "text": "The three of us were all sort of thinking, someone's right here, someone's wrong,",
        "extra_info": ""
    },
    {
        "text": "someone's staying and someone's going.",
        "extra_info": ""
    },
    {
        "text": "Sharnee, Daniel, Courtney, I can now reveal that that herb you've named",
        "extra_info": ""
    },
    {
        "text": "is in fact...",
        "extra_info": ""
    },
    {
        "text": "Sharnee, Daniel, Courtney, I can now reveal that that herb you've named",
        "extra_info": ""
    },
    {
        "text": "is in fact",
        "extra_info": ""
    },
    {
        "text": "mint",
        "extra_info": ""
    },
    {
        "text": "and not spearmint.",
        "extra_info": ""
    },
    {
        "text": "I didn't quite imagine this moment happening for a little while in this competition.",
        "extra_info": ""
    },
    {
        "text": "I hadn't pinned myself for one of the best cooks,",
        "extra_info": ""
    },
    {
        "text": "but I certainly hadn't pinned myself as number nineteen.",
        "extra_info": ""
    },
    {
        "text": "Courtney, I'm afraid that means you've been eliminated from this competition.",
        "extra_info": ""
    },
    {
        "text": "Yeah.",
        "extra_info": ""
    },
    {
        "text": "It's really disappointing because, you know,",
        "extra_info": ""
    },
    {
        "text": "she's one of the strongest cooks in this competition, she's a great girl and",
        "extra_info": ""
    },
    {
        "text": "you know, we're all gonna miss her.",
        "extra_info": ""
    },
    {
        "text": "Courtney, what are some of your proudest moments here in the MasterChef kitchen?",
        "extra_info": ""
    },
    {
        "text": "I think, yesterday.",
        "extra_info": ""
    },
    {
        "text": "Standing in the room, and I just thought, this is a once in a lifetime thing.",
        "extra_info": ""
    },
    {
        "text": "Couple of months ago, I was pouring beers looking out of the window,",
        "extra_info": ""
    },
    {
        "text": "never would have put myself in that room, so",
        "extra_info": ""
    },
    {
        "text": "gotta be happy with that.",
        "extra_info": ""
    },
    {
        "text": "I hope you've enjoyed your time at the MasterChef kitchen,",
        "extra_info": ""
    },
    {
        "text": "I hope you've learned as much as you possibly could.",
        "extra_info": ""
    },
    {
        "text": "Unfortunately, now it's time to say your final goodbyes,",
        "extra_info": ""
    },
    {
        "text": "and to leave us here in the MasterChef kitchen.",
        "extra_info": ""
    },
    {
        "text": "Thank you, Courtney.",
        "extra_info": ""
    },
    {
        "text": "She's a fantastic cook. She's a fantastic person,",
        "extra_info": ""
    },
    {
        "text": "she brings such positive energy into everything she does.",
        "extra_info": ""
    },
    {
        "text": "I think everyone is just gonna be devastated",
        "extra_info": ""
    },
    {
        "text": "that she's leaving the competition.",
        "extra_info": ""
    },
    {
        "text": "The hardest part is I just wasn't ready to go.",
        "extra_info": ""
    },
    {
        "text": "Really feel like I was just finding my feet.",
        "extra_info": ""
    },
    {
        "text": "Sometimes of all the time in life you need a bit of luck.",
        "extra_info": ""
    },
    {
        "text": "Today I just didn't have it.",
        "extra_info": ""
    },
    {
        "text": "We've been to the reward lunch, and we're now back at the house waiting for",
        "extra_info": ""
    },
    {
        "text": "the red team.",
        "extra_info": ""
    },
    {
        "text": "- Everyone in that team is skilled... - I know that someone's not gonna be",
        "extra_info": ""
    },
    {
        "text": "coming home and that's certainly something that we all were thinking about.",
        "extra_info": ""
    },
    {
        "text": "We hear the clumps coming down the stairs and there's three missing.",
        "extra_info": ""
    },
    {
        "text": "Courtney, Dan and Sharnee.",
        "extra_info": ""
    },
    {
        "text": "I don't think I would pick them as the bottom three.",
        "extra_info": ""
    },
    {
        "text": "They're all... all three of those people are really strong cooks.",
        "extra_info": ""
    },
    {
        "text": "Oh, Courtney's gone?",
        "extra_info": ""
    },
    {
        "text": "The lift doors open and Dan and Sharnee walk out,",
        "extra_info": ""
    },
    {
        "text": "and there's just a gasp.",
        "extra_info": ""
    },
    {
        "text": "If I had to pick at the start of the day who's the most likely to go,",
        "extra_info": ""
    },
    {
        "text": "Courtney wouldn't have been anywhere near the top of the list.",
        "extra_info": ""
    },
    {
        "text": "We all thought Courtney would be here until the very end.",
        "extra_info": ""
    },
    {
        "text": "She was a great cook, and I think everyone's really shocked.",
        "extra_info": ""
    },
    {
        "text": "I'm happy you guys have made it through, I mean, seriously, congratulations.",
        "extra_info": ""
    },
    {
        "text": "I'm glad to be back at the house but I'm still quite in shock.",
        "extra_info": ""
    },
    {
        "text": "Courtney's gone, she was definitely one of the favorites in the house,",
        "extra_info": ""
    },
    {
        "text": "and I guess me staying on meant her going and that's...",
        "extra_info": ""
    },
    {
        "text": "never leaves a pleasant feeling.",
        "extra_info": ""
    },
    {
        "text": "I'm extremely gutted and disappointed to be back so soon,",
        "extra_info": ""
    },
    {
        "text": "but coming home does put things in perspective.",
        "extra_info": ""
    },
    {
        "text": "It's not the end of the world, your mates are still here,",
        "extra_info": ""
    },
    {
        "text": "and your friends are proud of you. - Well done.",
        "extra_info": ""
    },
    {
        "text": "Three gees for Courtney.",
        "extra_info": ""
    },
    {
        "text": "I think pouring beers is a thing of the past for me.",
        "extra_info": ""
    },
    {
        "text": "I'm not back to the bowling club.",
        "extra_info": ""
    },
    {
        "text": "Sometimes you need a bit of a push and shove in life,",
        "extra_info": ""
    },
    {
        "text": "and MasterChef's given me that little push and shove that I've needed.",
        "extra_info": ""
    },
    {
        "text": "Everybody, I propose a toast for Courtney, for job well done, and bad luck.",
        "extra_info": ""
    },
    {
        "text": "Courtney has taken extended leave from the bowls club to realise",
        "extra_info": ""
    },
    {
        "text": "her dream of launching a boutique catering company.",
        "extra_info": ""
    },
    {
        "text": "She has made her peace with pesto and now once again, cooks it regularly.",
        "extra_info": ""
    },
    {
        "text": "Tomorrow night on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "It's the joy of watching George and I cook.",
        "extra_info": ""
    },
    {
        "text": "It's time for MasterClass, as Gary and George serve up duck two ways.",
        "extra_info": ""
    },
    {
        "text": "That's all. As simple as that.",
        "extra_info": ""
    },
    {
        "text": "And George shows you how to make the ultimate creme brulee.",
        "extra_info": ""
    },
    {
        "text": "Gary's gonna love this.",
        "extra_info": ""
    },
    {
        "text": "Plus, Justin North shows you the tricks for perfect pork crackling.",
        "extra_info": ""
    },
    {
        "text": "And the Master of Indian cuisine, Kumar Mahadevan,",
        "extra_info": ""
    },
    {
        "text": "drops by to cook a spicy prawn curry.",
        "extra_info": ""
    },
    {
        "text": "Oh, I love this, it's fantastic.",
        "extra_info": ""
    }
]