[
    {
        "text": "Last night on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "You'll all face a basic skills test.",
        "extra_info": ""
    },
    {
        "text": "The red team faced an elimination challenge.",
        "extra_info": ""
    },
    {
        "text": "There's no more friends in this competition, it's just competitors.",
        "extra_info": ""
    },
    {
        "text": "And for Courtney, the MasterChef journey ended.",
        "extra_info": ""
    },
    {
        "text": "Sometimes in life you need a bit of luck, today just I didn't have it.",
        "extra_info": ""
    },
    {
        "text": "Tonight, Gary and George take over the kitchen for another MasterClass.",
        "extra_info": ""
    },
    {
        "text": "The joy of watching George and I cook.",
        "extra_info": ""
    },
    {
        "text": "First up on the menu, duck cooked two ways.",
        "extra_info": ""
    },
    {
        "text": "Nothing too extravagant, but real tasty dish.",
        "extra_info": ""
    },
    {
        "text": "And George serves up the ultimate creme brulee.",
        "extra_info": ""
    },
    {
        "text": "- There is pleasure in that, isn't it. - Not hard, is it?",
        "extra_info": ""
    },
    {
        "text": "Plus, Justin North shows us the tricks for perfect pork crackling,",
        "extra_info": ""
    },
    {
        "text": "and the master of Indian cuisine, Kumar Mahadevan,",
        "extra_info": ""
    },
    {
        "text": "drops by to cook a spicy prawn curry.",
        "extra_info": ""
    },
    {
        "text": "I love this, it's fantastic.",
        "extra_info": ""
    },
    {
        "text": "Gary and George between them have so much knowledge.",
        "extra_info": ""
    },
    {
        "text": "For me, MasterClass is training.",
        "extra_info": ""
    },
    {
        "text": "MasterClass is probably the most relaxing time of the week for everyone,",
        "extra_info": ""
    },
    {
        "text": "noone's gonna get kicked off, but at the same we're all switched on,",
        "extra_info": ""
    },
    {
        "text": "cause we're ready to learn from what George and Gary have got to say.",
        "extra_info": ""
    },
    {
        "text": "Well, it's that time of the week again. MasterClass!",
        "extra_info": ""
    },
    {
        "text": "Georgie and I's favorite day, we can get, put our jackets on,",
        "extra_info": ""
    },
    {
        "text": "and do a bit of cooking.",
        "extra_info": ""
    },
    {
        "text": "You should be sitting there with an immense sense of pride.",
        "extra_info": ""
    },
    {
        "text": "Top 18 amateur cooks in this country.",
        "extra_info": ""
    },
    {
        "text": "We tested you this week, we put you through the firing line,",
        "extra_info": ""
    },
    {
        "text": "but a week I'm sure you'll never forget in your life.",
        "extra_info": ""
    },
    {
        "text": "So let's remind ourselves of that bumpy and eventful week.",
        "extra_info": ""
    },
    {
        "text": "You had the Indian-themed invention test.",
        "extra_info": ""
    },
    {
        "text": "There's two parts to this challenge,",
        "extra_info": ""
    },
    {
        "text": "one is the Indian part and the other part is the invention.",
        "extra_info": ""
    },
    {
        "text": "And Joanne, Matthew and Dom of course were our worst performers",
        "extra_info": ""
    },
    {
        "text": "on the day.",
        "extra_info": ""
    },
    {
        "text": "Dominic, I'm sorry mate, you're out.",
        "extra_info": ""
    },
    {
        "text": "Matthew, you lost a good mate, didn't you?",
        "extra_info": ""
    },
    {
        "text": "Seeing him go out was, you know, quite a hard thing, cause I was",
        "extra_info": ""
    },
    {
        "text": "in part involved in that elimination process with him so yeah,",
        "extra_info": ""
    },
    {
        "text": "it was a tough day.",
        "extra_info": ""
    },
    {
        "text": "Now after all that, the next big thing on the list was,",
        "extra_info": ""
    },
    {
        "text": "and look at Marion grinning there, was our French team challenge.",
        "extra_info": ""
    },
    {
        "text": "We had stars on this one, culinary luminaries.",
        "extra_info": ""
    },
    {
        "text": "Michel Roux from the Waterside Inn in London, three Michelin stars.",
        "extra_info": ""
    },
    {
        "text": "That's it, whisk, whisk.",
        "extra_info": ""
    },
    {
        "text": "And also Tony Bilson, the godfather of French and modern Australian cuisine",
        "extra_info": ""
    },
    {
        "text": "here in Australia.",
        "extra_info": ""
    },
    {
        "text": "- They just need to rest now, okay? - Sure.",
        "extra_info": ""
    },
    {
        "text": "And then they'll become more tender.",
        "extra_info": ""
    },
    {
        "text": "The judging panel was stratospheric.",
        "extra_info": ""
    },
    {
        "text": "Tetsuya Wakada, Guillaume Brahimi. And you had Matt Preston.",
        "extra_info": ""
    },
    {
        "text": "Now of course, the red team lost, captained by Daniel.",
        "extra_info": ""
    },
    {
        "text": "Shattering.",
        "extra_info": ""
    },
    {
        "text": "And unfortunately, what happened from there,",
        "extra_info": ""
    },
    {
        "text": "is the whole of the red team went through into an elimination.",
        "extra_info": ""
    },
    {
        "text": "This was a basic skills test.",
        "extra_info": ""
    },
    {
        "text": "And the first one up was to make a Genovese style pesto.",
        "extra_info": ""
    },
    {
        "text": "Daniel, Courtney and Sharnee went through into the second round",
        "extra_info": ""
    },
    {
        "text": "of that basic skills test, which was Name this herb.",
        "extra_info": ""
    },
    {
        "text": "Courtney slipped up, and for her, that was the end of her journey",
        "extra_info": ""
    },
    {
        "text": "here in the MasterChef kitchen.",
        "extra_info": ""
    },
    {
        "text": "Phil, how are you feeling that Courtney left?",
        "extra_info": ""
    },
    {
        "text": "It's a shame that such a talented, great cook and a beautiful person",
        "extra_info": ""
    },
    {
        "text": "leaves this early in the competition.",
        "extra_info": ""
    },
    {
        "text": "When George and I chatted about what you guys have done",
        "extra_info": ""
    },
    {
        "text": "this past week and what we need to teach you, what we need to recap,",
        "extra_info": ""
    },
    {
        "text": "one of the things that stood out was the invention test.",
        "extra_info": ""
    },
    {
        "text": "It was really difficult for you guys to pick out the cuts",
        "extra_info": ""
    },
    {
        "text": "and to butcher those down even further and know how to use them.",
        "extra_info": ""
    },
    {
        "text": "I'm really excited about the goat, I just hope I can pull it off.",
        "extra_info": ""
    },
    {
        "text": "Don't like it. It's dry and...",
        "extra_info": ""
    },
    {
        "text": "The meat is chewy.",
        "extra_info": ""
    },
    {
        "text": "So we've chosen four people that we think need a little bit of boost in terms of",
        "extra_info": ""
    },
    {
        "text": "gathering their skills and bring them up to speed.",
        "extra_info": ""
    },
    {
        "text": "Now that MasterClass is with a very special chef,",
        "extra_info": ""
    },
    {
        "text": "very experienced chef, somebody who runs one of the best restaurants in the country.",
        "extra_info": ""
    },
    {
        "text": "And that's Justin North from Becasse.",
        "extra_info": ""
    },
    {
        "text": "And you're gonna go and have a private MasterClass at Becasse.",
        "extra_info": ""
    },
    {
        "text": "Now those four people are Joanne, Daniel, Marion and Jake.",
        "extra_info": ""
    },
    {
        "text": "So, without further ado, you're lucky four, gather your stuff and get out of here.",
        "extra_info": ""
    },
    {
        "text": "Make sure you take your notebooks. Brilliant. Good luck, guys.",
        "extra_info": ""
    },
    {
        "text": "- Enjoy. - Enjoy your day.",
        "extra_info": ""
    },
    {
        "text": "Two months ago I was answering phones in an office,",
        "extra_info": ""
    },
    {
        "text": "and now I'm having a private MasterClass with Justin North.",
        "extra_info": ""
    },
    {
        "text": "He's a fairly major figure and I'm really looking forward to doing this.",
        "extra_info": ""
    },
    {
        "text": "Okay, first up on MasterClass, we're going to revisit the mystery box challenge.",
        "extra_info": ""
    },
    {
        "text": "You pulled the lid off that mystery box and go, Oh.",
        "extra_info": ""
    },
    {
        "text": "But this was a good one. You had duck, raspberries, lavender,",
        "extra_info": ""
    },
    {
        "text": "you had some great ingredients, and we had a good mix of dishes from all of you.",
        "extra_info": ""
    },
    {
        "text": "Skye, you won that challenge, yours was absolutely fantastic.",
        "extra_info": ""
    },
    {
        "text": "You kept the duck breast whole, you didn't slice it.",
        "extra_info": ""
    },
    {
        "text": "It was juicy, it was succulent, the fat was rendered beautifully,",
        "extra_info": ""
    },
    {
        "text": "and you had this lovely crisp red cabbage salad.",
        "extra_info": ""
    },
    {
        "text": "- That was a good job. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "So George and I have decided to do a duck dish,",
        "extra_info": ""
    },
    {
        "text": "and we're gonna split the duck and do it two different ways.",
        "extra_info": ""
    },
    {
        "text": "We're going to use different parts, the leg and the breast.",
        "extra_info": ""
    },
    {
        "text": "George, what's your dish?",
        "extra_info": ""
    },
    {
        "text": "Well, Gary, I'm just gonna go back to basics and do a simple confit duck leg",
        "extra_info": ""
    },
    {
        "text": "served up with simple lentils, nothing too extravagant,",
        "extra_info": ""
    },
    {
        "text": "but a real tasty dish. - Beautiful.",
        "extra_info": ""
    },
    {
        "text": "And I'm gonna roast the duck breast on the crown,",
        "extra_info": ""
    },
    {
        "text": "use some baby lettuces and some flowers, just to make a really delicate salad",
        "extra_info": ""
    },
    {
        "text": "using orange and blackberry.",
        "extra_info": ""
    },
    {
        "text": "So we've got a beautiful whole duck here.",
        "extra_info": ""
    },
    {
        "text": "We'll take the neck off and then you take the winglets off, and then the wishbone out.",
        "extra_info": ""
    },
    {
        "text": "If you don't take the wishbone out of the chicken or the wishbone out of the duck,",
        "extra_info": ""
    },
    {
        "text": "when you carve it off the bone, you leave a massive amount of meat on the carcass.",
        "extra_info": ""
    },
    {
        "text": "And to do that, you put the tip of a sharp knife in, and then clip in behind it,",
        "extra_info": ""
    },
    {
        "text": "and then push your fingers in behind the wishbone itself,",
        "extra_info": ""
    },
    {
        "text": "and pull it out. And it's a really different wishbone to one you see off a chicken,",
        "extra_info": ""
    },
    {
        "text": "which is more pointy and more V-shaped. Alright?",
        "extra_info": ""
    },
    {
        "text": "Can use it as a mouth guard.",
        "extra_info": ""
    },
    {
        "text": "Yeah.",
        "extra_info": ""
    },
    {
        "text": "Wishbone out, now legs off.",
        "extra_info": ""
    },
    {
        "text": "The legs take quite a long time to cook on a duck,",
        "extra_info": ""
    },
    {
        "text": "by the time you've cooked those duck legs, so they are just a tiny bit pink,",
        "extra_info": ""
    },
    {
        "text": "the breast is going to be really overcooked.",
        "extra_info": ""
    },
    {
        "text": "That's the biggest problem with cooking duck.",
        "extra_info": ""
    },
    {
        "text": "Now, what's important is not to hack in, and destroy the skin on the breast side.",
        "extra_info": ""
    },
    {
        "text": "So make sure that the incision you make is towards the leg.",
        "extra_info": ""
    },
    {
        "text": "And then push your fingers down into the cavity or the pocket that you make,",
        "extra_info": ""
    },
    {
        "text": "and then straight line down, and make sure you go behind",
        "extra_info": ""
    },
    {
        "text": "that little sweet piece of meat behind the back of the thigh.",
        "extra_info": ""
    },
    {
        "text": "And then once that's off you can just pull it back and it will take off the leg.",
        "extra_info": ""
    },
    {
        "text": "- So George. - Beautiful.",
        "extra_info": ""
    },
    {
        "text": "- There's your legs. - Thanks, Gary.",
        "extra_info": ""
    },
    {
        "text": "Now, next little stage then to make it a crown roast,",
        "extra_info": ""
    },
    {
        "text": "is that you just need to come in behind the breast and just take off the majority",
        "extra_info": ""
    },
    {
        "text": "of that carcass. Now what this will do, is allow the heat to penetrate",
        "extra_info": ""
    },
    {
        "text": "into the bird much quicker, it's gonna cook evenly and quickly,",
        "extra_info": ""
    },
    {
        "text": "so you can keep those breasts nice and pink,",
        "extra_info": ""
    },
    {
        "text": "and then you can use these bones to build your sauce or jus,",
        "extra_info": ""
    },
    {
        "text": "which is what we are going to do.",
        "extra_info": ""
    },
    {
        "text": "So, a couple of shallots.",
        "extra_info": ""
    },
    {
        "text": "Just pop them in there.",
        "extra_info": ""
    },
    {
        "text": "Little bit of thyme, just to put flavor into the carcass,",
        "extra_info": ""
    },
    {
        "text": "and also into the pan, which is quite important.",
        "extra_info": ""
    },
    {
        "text": "Good pinch of salt,",
        "extra_info": ""
    },
    {
        "text": "and then what I'm going to do is I'm going to score that skin,",
        "extra_info": ""
    },
    {
        "text": "and the reason I want to do that is even though this is not exceptionally fatty,",
        "extra_info": ""
    },
    {
        "text": "and I can see the flesh through the skin, I still want to channel the fat",
        "extra_info": ""
    },
    {
        "text": "away from the skin, so it's nice and crisp, okay?",
        "extra_info": ""
    },
    {
        "text": "And by scoring it, that's what it allows it to do.",
        "extra_info": ""
    },
    {
        "text": "And then I'm just going to season lightly.",
        "extra_info": ""
    },
    {
        "text": "And then for the pan, shallots, half a head of garlic, little bit of thyme,",
        "extra_info": ""
    },
    {
        "text": "and a couple of bay leaves.",
        "extra_info": ""
    },
    {
        "text": "And then just a tiny bit of olive oil, just to get it started,",
        "extra_info": ""
    },
    {
        "text": "cause you'll see, you're gonna get a lot of oil out of this.",
        "extra_info": ""
    },
    {
        "text": "Now, little technique that I'm going to show you is that put this",
        "extra_info": ""
    },
    {
        "text": "on one side, and put that against the side of the pan, and then you can turn that",
        "extra_info": ""
    },
    {
        "text": "in, say, four or five minutes, onto the other side facing the edge of the pan,",
        "extra_info": ""
    },
    {
        "text": "and then you can cook it for another five minutes completely down on the breast,",
        "extra_info": ""
    },
    {
        "text": "and you'll get the same render, because it's cooking it evenly on that pan surface",
        "extra_info": ""
    },
    {
        "text": "rather than cooking it always up. And remember if you don't render the duck,",
        "extra_info": ""
    },
    {
        "text": "then we're going to run into problems.",
        "extra_info": ""
    },
    {
        "text": "Now, Callum, can I borrow you?",
        "extra_info": ""
    },
    {
        "text": "I just want you to come and look after this while it's browning.",
        "extra_info": ""
    },
    {
        "text": "What I want you to make sure is that you get a really nice even color",
        "extra_info": ""
    },
    {
        "text": "even a little bit more than that all over the bird, alright?",
        "extra_info": ""
    },
    {
        "text": "So, just the bones in at the moment into the other side of the pan.",
        "extra_info": ""
    },
    {
        "text": "All right?",
        "extra_info": ""
    },
    {
        "text": "And what we're going to do is build a little bit of a gravy in the pan,",
        "extra_info": ""
    },
    {
        "text": "it's acting as a trivet while it's cooking, then it's adding flavor to the pan.",
        "extra_info": ""
    },
    {
        "text": "So that's nearly ready to turn over.",
        "extra_info": ""
    },
    {
        "text": "That's it.",
        "extra_info": ""
    },
    {
        "text": "Careful with your fingers.",
        "extra_info": ""
    },
    {
        "text": "You see what it's doing?",
        "extra_info": ""
    },
    {
        "text": "It's browning and rendering that side. Think about what you want.",
        "extra_info": ""
    },
    {
        "text": "Nice, crisp skin and pink rose duck meat.",
        "extra_info": ""
    },
    {
        "text": "Not raw. Pink and rose. All right?",
        "extra_info": ""
    },
    {
        "text": "So keep an eye on those. You can flip the bones a little bit.",
        "extra_info": ""
    },
    {
        "text": "So we're just going to chuck those shallots and garlic and thyme in.",
        "extra_info": ""
    },
    {
        "text": "The reason we didn't put them in earlier is because",
        "extra_info": ""
    },
    {
        "text": "you need to gather the color on all those little bones,",
        "extra_info": ""
    },
    {
        "text": "and if you put them in at the beginning,",
        "extra_info": ""
    },
    {
        "text": "then the shallots and the garlic obviously would be burned.",
        "extra_info": ""
    },
    {
        "text": "And now what you're getting is really lovely fresh flavors coming through.",
        "extra_info": ""
    },
    {
        "text": "Flip it over, let's have a look.",
        "extra_info": ""
    },
    {
        "text": "Oh, look at that. Beautiful.",
        "extra_info": ""
    },
    {
        "text": "Just going to pop that in the oven now.",
        "extra_info": ""
    },
    {
        "text": "And that's 200 degrees.",
        "extra_info": ""
    },
    {
        "text": "Okay, George, I need to take my duck out, it's been in for about 15 minutes.",
        "extra_info": ""
    },
    {
        "text": "And it's looking good.",
        "extra_info": ""
    },
    {
        "text": "I just feel that at the thickest part, which is just under the wing,",
        "extra_info": ""
    },
    {
        "text": "and I should get a good bit of spring and resistance to that.",
        "extra_info": ""
    },
    {
        "text": "And I'll just let that rest for a good ten minutes.",
        "extra_info": ""
    },
    {
        "text": "And I'm gonna drain the oil, the rest of the oil off these bones.",
        "extra_info": ""
    },
    {
        "text": "And that's gonna form a little vinaigrette that I'm going to make from the juices",
        "extra_info": ""
    },
    {
        "text": "and from the caramelized bones in the pan.",
        "extra_info": ""
    },
    {
        "text": "All right, we need orange.",
        "extra_info": ""
    },
    {
        "text": "What I'm going to do is just peel a few bits of zest into the pan.",
        "extra_info": ""
    },
    {
        "text": "We're going to put in about two tablespoons full of the sweet vinegar,",
        "extra_info": ""
    },
    {
        "text": "and then we're going to put in the juice of one of the oranges,",
        "extra_info": ""
    },
    {
        "text": "which is going to give it a bit of sweetness.",
        "extra_info": ""
    },
    {
        "text": "And I'm just going to put that on a low heat",
        "extra_info": ""
    },
    {
        "text": "and let that simmer for about three minutes",
        "extra_info": ""
    },
    {
        "text": "just to pull off a little bit of that flavor from the roasting bones,",
        "extra_info": ""
    },
    {
        "text": "a little bit of that duck fat and sediment which sort of create the vinaigrette.",
        "extra_info": ""
    },
    {
        "text": "And don't forget that the fat, like a lot of oils,",
        "extra_info": ""
    },
    {
        "text": "is gonna hold the flavor on your tongue.",
        "extra_info": ""
    },
    {
        "text": "And now I'm gonna strain that.",
        "extra_info": ""
    },
    {
        "text": "I'm just gonna keep that warm",
        "extra_info": ""
    },
    {
        "text": "for my salad, and what I'm doing here is just",
        "extra_info": ""
    },
    {
        "text": "squeezing every little last bit out of the garlic and the shallots",
        "extra_info": ""
    },
    {
        "text": "just to make sure that I get all of that crucial flavor.",
        "extra_info": ""
    },
    {
        "text": "All my components for this salad are coming together.",
        "extra_info": ""
    },
    {
        "text": "I've got some oranges, some lovely little blackberries,",
        "extra_info": ""
    },
    {
        "text": "some little flowers,",
        "extra_info": ""
    },
    {
        "text": "and then I've got some baby lettuces.",
        "extra_info": ""
    },
    {
        "text": "Now we're just going to carve this duck off the bone.",
        "extra_info": ""
    },
    {
        "text": "Because we've taken the wishbone out, remember, I can go straight the way down.",
        "extra_info": ""
    },
    {
        "text": "If that wishbone was there, I've got to go round it,",
        "extra_info": ""
    },
    {
        "text": "and you leave the big chunk of meat that's in there.",
        "extra_info": ""
    },
    {
        "text": "All right? So I'm just following the meat really close to the bone,",
        "extra_info": ""
    },
    {
        "text": "which is important. And don't forget, when you cook it close to the bone,",
        "extra_info": ""
    },
    {
        "text": "then you get that lovely sweetness.",
        "extra_info": ""
    },
    {
        "text": "And of course, it keeps its shape as well.",
        "extra_info": ""
    },
    {
        "text": "This is perfect for me, right? It's just, you can see the heat's penetrated",
        "extra_info": ""
    },
    {
        "text": "all of that duck.",
        "extra_info": ""
    },
    {
        "text": "Now I'm just gonna carve that.",
        "extra_info": ""
    },
    {
        "text": "Sorry, George.",
        "extra_info": ""
    },
    {
        "text": "Gee. That is tender.",
        "extra_info": ""
    },
    {
        "text": "Very tender.",
        "extra_info": ""
    },
    {
        "text": "George, it's coming.",
        "extra_info": ""
    },
    {
        "text": "All right?",
        "extra_info": ""
    },
    {
        "text": "Little chef's treats.",
        "extra_info": ""
    },
    {
        "text": "And then what we're gonna do is construct this salad.",
        "extra_info": ""
    },
    {
        "text": "So first of all, this orange burnt butter mayonnaise,",
        "extra_info": ""
    },
    {
        "text": "which I made earlier, which is a perfect accompaniment with duck.",
        "extra_info": ""
    },
    {
        "text": "And then what I'm gonna do is just use these baby leaves",
        "extra_info": ""
    },
    {
        "text": "just randomly along the plate,",
        "extra_info": ""
    },
    {
        "text": "and then some little flowers. So these are violas,",
        "extra_info": ""
    },
    {
        "text": "and then these are marigolds.",
        "extra_info": ""
    },
    {
        "text": "What people forget is that flowers have been eaten for thousands of years.",
        "extra_info": ""
    },
    {
        "text": "A couple of chunks of orange.",
        "extra_info": ""
    },
    {
        "text": "Few blackberries.",
        "extra_info": ""
    },
    {
        "text": "And then just before I put the duck down,",
        "extra_info": ""
    },
    {
        "text": "I'm just gonna... this little orangey sort of sweet vinaigrette.",
        "extra_info": ""
    },
    {
        "text": "Tiny little bit over the lettuce. Tiny bit, Because it's really meaty.",
        "extra_info": ""
    },
    {
        "text": "You don't want to slather this. It's very delicate, very beautiful.",
        "extra_info": ""
    },
    {
        "text": "And then just drop in some gorgeous little bits of duck.",
        "extra_info": ""
    },
    {
        "text": "That's it.",
        "extra_info": ""
    },
    {
        "text": "A little summer garden salad of the roasted duck on the crown",
        "extra_info": ""
    },
    {
        "text": "with baby leaves and flowers.",
        "extra_info": ""
    },
    {
        "text": "Peter, Claire, come up and taste the duck breast.",
        "extra_info": ""
    },
    {
        "text": "So happy to eat this.",
        "extra_info": ""
    },
    {
        "text": "That duck is so tender and beautiful.",
        "extra_info": ""
    },
    {
        "text": "- The flowers are a bit girly, but... - You know, sometimes you just got to",
        "extra_info": ""
    },
    {
        "text": "let yourself go, Peter. Embrace the inner woman in yourself.",
        "extra_info": ""
    },
    {
        "text": "Nothing wrong with being girly.",
        "extra_info": ""
    },
    {
        "text": "Can I, another bit?",
        "extra_info": ""
    },
    {
        "text": "But no joke, try... if you're not keen, just try.",
        "extra_info": ""
    },
    {
        "text": "It's beautiful.",
        "extra_info": ""
    },
    {
        "text": "And that would be perfect as like a warm salad or a cold salad.",
        "extra_info": ""
    },
    {
        "text": "Yeah, gorgeous. And that's not just one portion, that's to share.",
        "extra_info": ""
    },
    {
        "text": "Okay, guys, thanks very much.",
        "extra_info": ""
    },
    {
        "text": "Nice work, Peter.",
        "extra_info": ""
    },
    {
        "text": "Right, top tip number one, roasting the whole bird like chicken or duck,",
        "extra_info": ""
    },
    {
        "text": "consider sometimes it's a good idea to remove the legs.",
        "extra_info": ""
    },
    {
        "text": "The duck breast and the duck leg take different times to cook.",
        "extra_info": ""
    },
    {
        "text": "Tip number two, think about caramelization.",
        "extra_info": ""
    },
    {
        "text": "If you take the duck breast off the bone,",
        "extra_info": ""
    },
    {
        "text": "make sure you cook for three quarters of the time",
        "extra_info": ""
    },
    {
        "text": "in the pan on the skin to render the fat away.",
        "extra_info": ""
    },
    {
        "text": "Otherwise, you're gonna have flabby, undercooked skin on the top,",
        "extra_info": ""
    },
    {
        "text": "nothing worse on duck.",
        "extra_info": ""
    },
    {
        "text": "Tip number three, don't underestimate how much flavor you can get out of the pan.",
        "extra_info": ""
    },
    {
        "text": "Take out whatever you're cooking and deglaze a pan with something,",
        "extra_info": ""
    },
    {
        "text": "create something out of it.",
        "extra_info": ""
    },
    {
        "text": "After the break.",
        "extra_info": ""
    },
    {
        "text": "George prepares his delicious duck confit with lentils.",
        "extra_info": ""
    },
    {
        "text": "That's out of this world, I could eat about ten of them.",
        "extra_info": ""
    },
    {
        "text": "Then later.",
        "extra_info": ""
    },
    {
        "text": "Exactly what we want.",
        "extra_info": ""
    },
    {
        "text": "The secrets to preparing succulent roast pork",
        "extra_info": ""
    },
    {
        "text": "with award-winning chef Justin North.",
        "extra_info": ""
    },
    {
        "text": "And then finish with a lovely big chunk of beautiful crispy crackling.",
        "extra_info": ""
    },
    {
        "text": "- It's gorgeous. - Plus.",
        "extra_info": ""
    },
    {
        "text": "An amazing prawn and okra curry from guest chef Kumar Mahadevan.",
        "extra_info": ""
    },
    {
        "text": "You'd think they'd be burnt when they're black.",
        "extra_info": ""
    },
    {
        "text": "No. It's the right flavor.",
        "extra_info": ""
    },
    {
        "text": "So George and I are cooking duck two ways.",
        "extra_info": ""
    },
    {
        "text": "- George, over to you with the confit legs. - Done.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna do a really simple dish, a confit duck leg with simple lentils.",
        "extra_info": ""
    },
    {
        "text": "Confit basically means cooking in its own fat,",
        "extra_info": ""
    },
    {
        "text": "so hence we're going to cook the duck legs in duck fat.",
        "extra_info": ""
    },
    {
        "text": "First things first, little bit of salt on the bottom of the tray,",
        "extra_info": ""
    },
    {
        "text": "and I just want to make an incision",
        "extra_info": ""
    },
    {
        "text": "there. Okay, basically score the top of the leg,",
        "extra_info": ""
    },
    {
        "text": "and there's a reason why.",
        "extra_info": ""
    },
    {
        "text": "Is when we actually confit that, that bit contracts,",
        "extra_info": ""
    },
    {
        "text": "and I don't want it to tear the fat up this end,",
        "extra_info": ""
    },
    {
        "text": "so I prefer to do it there because I'm going to actually French that,",
        "extra_info": ""
    },
    {
        "text": "and present that bone.",
        "extra_info": ""
    },
    {
        "text": "Legs on top of the salt.",
        "extra_info": ""
    },
    {
        "text": "Some more salt on top.",
        "extra_info": ""
    },
    {
        "text": "And then the process of some aromats, some real basic aromats.",
        "extra_info": ""
    },
    {
        "text": "Garlic, bay leaf, pepper corns, thyme.",
        "extra_info": ""
    },
    {
        "text": "So then a little bit of plastic wrap.",
        "extra_info": ""
    },
    {
        "text": "And then that goes in the fridge for about two to three hours.",
        "extra_info": ""
    },
    {
        "text": "These legs have been in the fridge and basically what's happened",
        "extra_info": ""
    },
    {
        "text": "is the salt has pulled out the moisture, but it's also given",
        "extra_info": ""
    },
    {
        "text": "the duck legs lots of flavor.",
        "extra_info": ""
    },
    {
        "text": "Now, from there, all these little aromats, we want to keep,",
        "extra_info": ""
    },
    {
        "text": "because we're actually gonna use these to cook the legs.",
        "extra_info": ""
    },
    {
        "text": "So we just pull them all out.",
        "extra_info": ""
    },
    {
        "text": "And then from there, we just degorge these in water,",
        "extra_info": ""
    },
    {
        "text": "to remove any excess salt. Okay?",
        "extra_info": ""
    },
    {
        "text": "And then we just dry the legs out on a cloth.",
        "extra_info": ""
    },
    {
        "text": "They go into our pan with all our aromats.",
        "extra_info": ""
    },
    {
        "text": "And then we're gonna tip some duck fat over it.",
        "extra_info": ""
    },
    {
        "text": "I'm just gonna cover it with some grease-proof paper first.",
        "extra_info": ""
    },
    {
        "text": "Grease-proof will just act as a nice little insulation,",
        "extra_info": ""
    },
    {
        "text": "so I'm just gonna make a cartouche.",
        "extra_info": ""
    },
    {
        "text": "Put a little hole on it, so it breathes,",
        "extra_info": ""
    },
    {
        "text": "so I can see out through the top.",
        "extra_info": ""
    },
    {
        "text": "The greaseproof paper on the top also helps",
        "extra_info": ""
    },
    {
        "text": "so the foil doesn't stick to the top of the legs.",
        "extra_info": ""
    },
    {
        "text": "That now goes into an oven, 110 degrees for about an hour and 30 minutes.",
        "extra_info": ""
    },
    {
        "text": "Next job is to cook the lentils. I've got these lentils here,",
        "extra_info": ""
    },
    {
        "text": "they're just stock standard brown lentils, they're Australian,",
        "extra_info": ""
    },
    {
        "text": "they're beautiful and small. So basically for every one part of lentils,",
        "extra_info": ""
    },
    {
        "text": "I go four parts of water.",
        "extra_info": ""
    },
    {
        "text": "They'll take about 20 to 25 minutes.",
        "extra_info": ""
    },
    {
        "text": "While those lentils are going, we're gonna",
        "extra_info": ""
    },
    {
        "text": "create the flavoring that's gonna go with the lentils.",
        "extra_info": ""
    },
    {
        "text": "Pan on, olive oil, half an onion, diced, thin slivers of garlic.",
        "extra_info": ""
    },
    {
        "text": "We'll just get that starting to sweat down,",
        "extra_info": ""
    },
    {
        "text": "we wanna sweat it without color.",
        "extra_info": ""
    },
    {
        "text": "Next step is our carrots, so we've just diced one whole carrot,",
        "extra_info": ""
    },
    {
        "text": "some thyme, one stick of celery, and then our cooked lentils.",
        "extra_info": ""
    },
    {
        "text": "I've cooked them for about 25 to 30 minutes.",
        "extra_info": ""
    },
    {
        "text": "I've strained all the excess liquid off and I've just popped them in a bowl.",
        "extra_info": ""
    },
    {
        "text": "That's all. As simple as that.",
        "extra_info": ""
    },
    {
        "text": "Couple of spoons of the lentils go in.",
        "extra_info": ""
    },
    {
        "text": "Now what I've got here is some",
        "extra_info": ""
    },
    {
        "text": "Cabernet Sauvignon vinegar, foreign vinegar.",
        "extra_info": ""
    },
    {
        "text": "And this is a really delicious, tasty, yummy vinegar.",
        "extra_info": ""
    },
    {
        "text": "We add a good glug of that.",
        "extra_info": ""
    },
    {
        "text": "And then what I've got here is just a simple duck stock.",
        "extra_info": ""
    },
    {
        "text": "You can use any brown stock, brown chicken stock, brown veal stock,",
        "extra_info": ""
    },
    {
        "text": "that's up to you.",
        "extra_info": ""
    },
    {
        "text": "At this point, the consistency of the lentils is sort of",
        "extra_info": ""
    },
    {
        "text": "in between saucy, soupy, but it's still together.",
        "extra_info": ""
    },
    {
        "text": "And this is the point where I want them.",
        "extra_info": ""
    },
    {
        "text": "I'm just gonna pull these to the side and I'm gonna let the lentils soak up",
        "extra_info": ""
    },
    {
        "text": "all that flavor.",
        "extra_info": ""
    },
    {
        "text": "All right, guys, these duck legs have been in the oven",
        "extra_info": ""
    },
    {
        "text": "for an hour and a half at 110 degrees.",
        "extra_info": ""
    },
    {
        "text": "The essence of confit is that when you pull it out,",
        "extra_info": ""
    },
    {
        "text": "there should be no bubbling. When it's bubbling, it means it's frying them.",
        "extra_info": ""
    },
    {
        "text": "But what we're gonna do is basically take these out",
        "extra_info": ""
    },
    {
        "text": "and these go into a fridge.",
        "extra_info": ""
    },
    {
        "text": "We will let these cool down, and we're gonna clean them up.",
        "extra_info": ""
    },
    {
        "text": "These are our duck legs that have been in the fridge",
        "extra_info": ""
    },
    {
        "text": "for about half an hour, 45 minutes, chilling down,",
        "extra_info": ""
    },
    {
        "text": "and what we're gonna do now is just trim them up,",
        "extra_info": ""
    },
    {
        "text": "so they're nice and presentable.",
        "extra_info": ""
    },
    {
        "text": "Just trim up this presentation bone.",
        "extra_info": ""
    },
    {
        "text": "When I take the knuckle off, end of the board, all right, nice and flat.",
        "extra_info": ""
    },
    {
        "text": "Now it's time to heat the duck confit back up",
        "extra_info": ""
    },
    {
        "text": "and get that skin nice and crisp. Just a little bit of olive oil.",
        "extra_info": ""
    },
    {
        "text": "Skin side up.",
        "extra_info": ""
    },
    {
        "text": "There's a technique to reheat these legs back up,",
        "extra_info": ""
    },
    {
        "text": "cause if I throw these back into an oven right now like that,",
        "extra_info": ""
    },
    {
        "text": "it's gonna dry up, alright?",
        "extra_info": ""
    },
    {
        "text": "So what I wanna do is be able to get a balance of",
        "extra_info": ""
    },
    {
        "text": "the duck leg being nice and moist and hot inside,",
        "extra_info": ""
    },
    {
        "text": "but that skin, that cap on the top, nice and golden and caramelized.",
        "extra_info": ""
    },
    {
        "text": "Right, at this point here, chicken stock goes in.",
        "extra_info": ""
    },
    {
        "text": "Just enough to cover the bottom of the pan,",
        "extra_info": ""
    },
    {
        "text": "and then some butter.",
        "extra_info": ""
    },
    {
        "text": "And the butter is just gonna get a nice glaze on that skin.",
        "extra_info": ""
    },
    {
        "text": "Some thyme leaves.",
        "extra_info": ""
    },
    {
        "text": "And then into an oven, 210 degrees,",
        "extra_info": ""
    },
    {
        "text": "for about eight to ten minutes.",
        "extra_info": ""
    },
    {
        "text": "So you've got nice, soft, juicy confit duck leg,",
        "extra_info": ""
    },
    {
        "text": "but crisp on the outside.",
        "extra_info": ""
    },
    {
        "text": "We just need to finish the lentils here so back onto the heat,",
        "extra_info": ""
    },
    {
        "text": "add some fresh parsley, and then a few of these sour dried cherries,",
        "extra_info": ""
    },
    {
        "text": "and that will just add some sweetness and some savoriness again to the dish.",
        "extra_info": ""
    },
    {
        "text": "Stir that through.",
        "extra_info": ""
    },
    {
        "text": "Over to our plate.",
        "extra_info": ""
    },
    {
        "text": "Then our duck.",
        "extra_info": ""
    },
    {
        "text": "Then, of course, few little cresses.",
        "extra_info": ""
    },
    {
        "text": "There you have it. Duck confit with lentils.",
        "extra_info": ""
    },
    {
        "text": "Aaron, Adam, would you like to come up and taste the duck confit",
        "extra_info": ""
    },
    {
        "text": "with lentils?",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "Wow.",
        "extra_info": ""
    },
    {
        "text": "That's amazing, the sourness in the lentils really offsets the duck well.",
        "extra_info": ""
    },
    {
        "text": "That from cherries? Beautiful.",
        "extra_info": ""
    },
    {
        "text": "That's out of this world. I could eat about then of them. It's great. Really cool.",
        "extra_info": ""
    },
    {
        "text": "Fantastic.",
        "extra_info": ""
    },
    {
        "text": "- Thank you. - Thanks, boys.",
        "extra_info": ""
    },
    {
        "text": "- Fantastic. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "Top three tips for cooking duck confit with lentils.",
        "extra_info": ""
    },
    {
        "text": "With the lentils, make sure you don't salt the water when you boil them,",
        "extra_info": ""
    },
    {
        "text": "when you cook them, or you'll retard the skins",
        "extra_info": ""
    },
    {
        "text": "and they'll go really tough and chalky.",
        "extra_info": ""
    },
    {
        "text": "Tip number two.",
        "extra_info": ""
    },
    {
        "text": "Penetrate it with aromats to add flavor.",
        "extra_info": ""
    },
    {
        "text": "Whatever aromats you want. Bayleaf, thyme, garlic,",
        "extra_info": ""
    },
    {
        "text": "sechuan, star anise, it's up to you, the sky's the limit.",
        "extra_info": ""
    },
    {
        "text": "Top tip number three.",
        "extra_info": ""
    },
    {
        "text": "When confiting the duck leg, you don't want to see the fat boiling.",
        "extra_info": ""
    },
    {
        "text": "When you start seeing lots of bubbles, it means you're gonna fry that duck leg.",
        "extra_info": ""
    },
    {
        "text": "There you have it. Duck confit with lentils.",
        "extra_info": ""
    },
    {
        "text": "Next on MasterClass.",
        "extra_info": ""
    },
    {
        "text": "Oh yeah, see that?",
        "extra_info": ""
    },
    {
        "text": "Award-winning chef Justin North has the essential guide to cooking perfect pork.",
        "extra_info": ""
    },
    {
        "text": "Nice, even caramelization all the way around it.",
        "extra_info": ""
    },
    {
        "text": "I've been chosen for a private MasterClass with Justin North at Becasse.",
        "extra_info": ""
    },
    {
        "text": "I can't believe it. I'm so excited.",
        "extra_info": ""
    },
    {
        "text": "It'll just pick me up a little bit after what I've been through this week.",
        "extra_info": ""
    },
    {
        "text": "Wow.",
        "extra_info": ""
    },
    {
        "text": "I walk into Becasse and immediately there is just this",
        "extra_info": ""
    },
    {
        "text": "beautiful sense of elegance.",
        "extra_info": ""
    },
    {
        "text": "And heading towards the kitchen, Justin North is there, waiting for us.",
        "extra_info": ""
    },
    {
        "text": "Hi, guys. Welcome to the Becasse kitchen.",
        "extra_info": ""
    },
    {
        "text": "This is my kitchen, where we cook every day, we do eleven services per week,",
        "extra_info": ""
    },
    {
        "text": "we cook up to about 60 guests per service,",
        "extra_info": ""
    },
    {
        "text": "and in this tiny little space we have about ten chefs working at once.",
        "extra_info": ""
    },
    {
        "text": "It gets very, very hectic, but it's extremely well organized.",
        "extra_info": ""
    },
    {
        "text": "It's very hot, and it's good fun.",
        "extra_info": ""
    },
    {
        "text": "Today we're gonna cook roast rump of pork with crackling,",
        "extra_info": ""
    },
    {
        "text": "buttered cabbage, charcuterie jus and potato puree.",
        "extra_info": ""
    },
    {
        "text": "The first step is we're going to salt the pork skin",
        "extra_info": ""
    },
    {
        "text": "to get a really beautiful, airy crunchy crackling,",
        "extra_info": ""
    },
    {
        "text": "and in order to do that, we need to score it and make wonderful incisions in it,",
        "extra_info": ""
    },
    {
        "text": "so Joanne, can you come through and give me a hand scoring it please?",
        "extra_info": ""
    },
    {
        "text": "Thanks.",
        "extra_info": ""
    },
    {
        "text": "This pork rump is about a one kilo piece, so I'll make first couple incisions for you,",
        "extra_info": ""
    },
    {
        "text": "So start at one side and we'll just gently run your knife through there like so.",
        "extra_info": ""
    },
    {
        "text": "Probably... yeah, about half a centimeter to a centimeter, it's not that important,",
        "extra_info": ""
    },
    {
        "text": "but as long as they're fairly close together.",
        "extra_info": ""
    },
    {
        "text": "- So do you want to have a go? - I'll try.",
        "extra_info": ""
    },
    {
        "text": "- Very nervous. - That's all right.",
        "extra_info": ""
    },
    {
        "text": "- Just remember the most... - Justin North and I'm cutting pork.",
        "extra_info": ""
    },
    {
        "text": "That looks perfect. You will notice it's an incredibly fatty pork.",
        "extra_info": ""
    },
    {
        "text": "The fat carries a huge amount of flavor, and it'll just dissolve into the meat.",
        "extra_info": ""
    },
    {
        "text": "So we have this beautiful juicy flavorsome pork",
        "extra_info": ""
    },
    {
        "text": "with a lovely crunchy crackling on it.",
        "extra_info": ""
    },
    {
        "text": "You've done a really good job. It's great. Really good.",
        "extra_info": ""
    },
    {
        "text": "And then we're gonna salt it.",
        "extra_info": ""
    },
    {
        "text": "Joanne, what are you like at giving massages?",
        "extra_info": ""
    },
    {
        "text": "- I think I give a good massage. - Excellent. What you wanna do here,",
        "extra_info": ""
    },
    {
        "text": "we're gonna put the salt on, just sprinkling an even layer over it.",
        "extra_info": ""
    },
    {
        "text": "Now, if you just wanna massage that into the pork and get it into the incisions, yeah.",
        "extra_info": ""
    },
    {
        "text": "Get in there.",
        "extra_info": ""
    },
    {
        "text": "And we're gonna massage that salt right into the pork there,",
        "extra_info": ""
    },
    {
        "text": "and we're gonna put it into our fridge, give it about 4 hours to salt,",
        "extra_info": ""
    },
    {
        "text": "and then we'll have a look at it.",
        "extra_info": ""
    },
    {
        "text": "Perfect.",
        "extra_info": ""
    },
    {
        "text": "And you're done. Thanks very much for that, Joanne.",
        "extra_info": ""
    },
    {
        "text": "Cheers.",
        "extra_info": ""
    },
    {
        "text": "Okay, here's the pork rump, that's been salting for about four hours,",
        "extra_info": ""
    },
    {
        "text": "and you can see how it's got these little bubbles of moisture on it,",
        "extra_info": ""
    },
    {
        "text": "so excess salt has all dissolved and it's drawn out that moisture there.",
        "extra_info": ""
    },
    {
        "text": "And you can see by leaving it uncovered,",
        "extra_info": ""
    },
    {
        "text": "that rind on there is starting to dry out quite a lot.",
        "extra_info": ""
    },
    {
        "text": "So just to get rid of any excess salt that might be on there,",
        "extra_info": ""
    },
    {
        "text": "just gonna rub that off. You do want your cloth a little bit damp",
        "extra_info": ""
    },
    {
        "text": "just to have that excess salt will stick to it.",
        "extra_info": ""
    },
    {
        "text": "Now what we're gonna do is cut this in half.",
        "extra_info": ""
    },
    {
        "text": "Basically, it will make it easier for us to caramelize.",
        "extra_info": ""
    },
    {
        "text": "So you sort of get a good idea how that's gonna go.",
        "extra_info": ""
    },
    {
        "text": "Now get a pan nice and hot, we're gonna start with a little bit of oil.",
        "extra_info": ""
    },
    {
        "text": "We always use a non-scented oil, something like a grapeseed or rice bran,",
        "extra_info": ""
    },
    {
        "text": "where it's not gonna impart too much flavor.",
        "extra_info": ""
    },
    {
        "text": "So we're gonna put that into the pan, and caramelize it really, really gently",
        "extra_info": ""
    },
    {
        "text": "on the side before we put it into the oven.",
        "extra_info": ""
    },
    {
        "text": "This will probably take about eight to ten minutes.",
        "extra_info": ""
    },
    {
        "text": "Okay.",
        "extra_info": ""
    },
    {
        "text": "So we'll just leave it there on the side of the stove just on a medium heat.",
        "extra_info": ""
    },
    {
        "text": "And then while the pork is caramelizing there, we're gonna get our potatoes ready",
        "extra_info": ""
    },
    {
        "text": "for the pomme puree, the best pomme puree you've ever cooked.",
        "extra_info": ""
    },
    {
        "text": "We're gonna start it in cold water so they cook evenly.",
        "extra_info": ""
    },
    {
        "text": "If you were to put them in boiling water, they'll overcook on the outside",
        "extra_info": ""
    },
    {
        "text": "and still be a little bit raw in the middle.",
        "extra_info": ""
    },
    {
        "text": "And that way your potato's gonna be grainy.",
        "extra_info": ""
    },
    {
        "text": "So put it on the stove over high heat.",
        "extra_info": ""
    },
    {
        "text": "Well, while that comes to the boil, we'll have a look at our pork.",
        "extra_info": ""
    },
    {
        "text": "Been about ten minutes.",
        "extra_info": ""
    },
    {
        "text": "Oh yeah, see that? Absolutely perfect. So that's exactly what we want.",
        "extra_info": ""
    },
    {
        "text": "It's got a beautiful golden brown crackling all over it.",
        "extra_info": ""
    },
    {
        "text": "Absolutely stunning. So we're gonna put that on a roasting tray,",
        "extra_info": ""
    },
    {
        "text": "and the reason for that is we want a nice, even caramelization",
        "extra_info": ""
    },
    {
        "text": "all the way round it.",
        "extra_info": ""
    },
    {
        "text": "Okay, we're gonna go into our oven at 190 degrees Celsius",
        "extra_info": ""
    },
    {
        "text": "for about 25 minutes.",
        "extra_info": ""
    },
    {
        "text": "What brings this dish all together is a beautiful charcuterie jus.",
        "extra_info": ""
    },
    {
        "text": "Charcuterie, have this with all your cured meats, or your smoked bacon,",
        "extra_info": ""
    },
    {
        "text": "you terrines, your pates, basically everything that comes from your pork",
        "extra_info": ""
    },
    {
        "text": "that's been aged and cured and traditionally, to garnish fat,",
        "extra_info": ""
    },
    {
        "text": "you'd have something to cut that richness of the meat.",
        "extra_info": ""
    },
    {
        "text": "So things like mustards and pickles, and beautiful things like that.",
        "extra_info": ""
    },
    {
        "text": "So that's basically where we get the name charcuterie jus from.",
        "extra_info": ""
    },
    {
        "text": "We want to start with some lovely pork trimmings, about 300 grams.",
        "extra_info": ""
    },
    {
        "text": "Just roughly diced. Again, it doesn't have to be uniform, just want it to be",
        "extra_info": ""
    },
    {
        "text": "similar size so they caramelize about the same time.",
        "extra_info": ""
    },
    {
        "text": "So we're gonna use about 30 mils of non-scented oil,",
        "extra_info": ""
    },
    {
        "text": "like grape seed oil again.",
        "extra_info": ""
    },
    {
        "text": "And we're gonna put our pork trimmings into the pan.",
        "extra_info": ""
    },
    {
        "text": "Just want a nice even layer on the pan,",
        "extra_info": ""
    },
    {
        "text": "you don't want to pile it up so we're gonna get nice high heat.",
        "extra_info": ""
    },
    {
        "text": "You can hear that beautiful crackling and sizzling going on,",
        "extra_info": ""
    },
    {
        "text": "so we're just gonna let that caramelize in there.",
        "extra_info": ""
    },
    {
        "text": "And we're gonna add a little bit of butter to it,",
        "extra_info": ""
    },
    {
        "text": "and get the butter, not burned but so it just starts to foam.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna put two sliced shallots and one sliced clove of garlic in,",
        "extra_info": ""
    },
    {
        "text": "few sprigs of thyme,",
        "extra_info": ""
    },
    {
        "text": "and we're gonna keep that caramelization process going for about another 5-8 minutes,",
        "extra_info": ""
    },
    {
        "text": "and you'll get this beautiful wafting lovely lovely smell of caramelized pork.",
        "extra_info": ""
    },
    {
        "text": "You get the shallots, lovely perfume of garlic,",
        "extra_info": ""
    },
    {
        "text": "and the beautiful aromatic thyme as well.",
        "extra_info": ""
    },
    {
        "text": "When we return...",
        "extra_info": ""
    },
    {
        "text": "You can see how really light and dry and fluffy it is.",
        "extra_info": ""
    },
    {
        "text": "Justin makes the smoothest mash to go with his pork.",
        "extra_info": ""
    },
    {
        "text": "Can we have some?",
        "extra_info": ""
    },
    {
        "text": "Today we're cooking roast rump of pork with crackling,",
        "extra_info": ""
    },
    {
        "text": "buttered cabbage, charcuterie jus and potato puree.",
        "extra_info": ""
    },
    {
        "text": "Now, the sauce we're pretty much in. Now, you see, when we...",
        "extra_info": ""
    },
    {
        "text": "see, look at that, that's perfect. That's amazing.",
        "extra_info": ""
    },
    {
        "text": "Look at that.",
        "extra_info": ""
    },
    {
        "text": "So get our straining implement set up,",
        "extra_info": ""
    },
    {
        "text": "so we're just gonna pour off all that excess fat.",
        "extra_info": ""
    },
    {
        "text": "Now, the worst thing you can do, is put this in the washup.",
        "extra_info": ""
    },
    {
        "text": "That base sauce is... absolutely imperative.",
        "extra_info": ""
    },
    {
        "text": "So get all that fat off, push out any more excess fat.",
        "extra_info": ""
    },
    {
        "text": "Back to our pan.",
        "extra_info": ""
    },
    {
        "text": "So now we've got a dry pan, no fat in there,",
        "extra_info": ""
    },
    {
        "text": "beautiful caramelization. About 100 mils of white wine.",
        "extra_info": ""
    },
    {
        "text": "I'm going to bring this over here so you can have a look,",
        "extra_info": ""
    },
    {
        "text": "but you can see how quickly... look how clean that pan is now.",
        "extra_info": ""
    },
    {
        "text": "Just lift it all up and scrape all those last little bits off.",
        "extra_info": ""
    },
    {
        "text": "But see, you've got a beautiful depth and color to your sauce already.",
        "extra_info": ""
    },
    {
        "text": "And that's from white wine. Look at the color of that already.",
        "extra_info": ""
    },
    {
        "text": "Beautiful.",
        "extra_info": ""
    },
    {
        "text": "So now we're going to add 500 mils of pork stock to our base of our jus.",
        "extra_info": ""
    },
    {
        "text": "And see how it's beautiful, gelatinous, nice and shiny.",
        "extra_info": ""
    },
    {
        "text": "So you can see all of those impurities that we spoke about.",
        "extra_info": ""
    },
    {
        "text": "So in order to remove all them, we need a little ladle,",
        "extra_info": ""
    },
    {
        "text": "and some cold water. Basically, what it will do,",
        "extra_info": ""
    },
    {
        "text": "it will allow us to clean the ladle each time we go in.",
        "extra_info": ""
    },
    {
        "text": "So this way we can take off a little bit of scum, all the impurities,",
        "extra_info": ""
    },
    {
        "text": "and then back into the pan, rinse it around,",
        "extra_info": ""
    },
    {
        "text": "and we got a lovely clean ladle each time we are going back in.",
        "extra_info": ""
    },
    {
        "text": "That's looking pretty good.",
        "extra_info": ""
    },
    {
        "text": "Okay, so our pork's been in for about 25 minutes now,",
        "extra_info": ""
    },
    {
        "text": "so it's time to pull it out and have a look, see how it's going.",
        "extra_info": ""
    },
    {
        "text": "Oh, wow. Smells fantastic.",
        "extra_info": ""
    },
    {
        "text": "You can see and hear how wonderful that crackling",
        "extra_info": ""
    },
    {
        "text": "has got a real beautiful crunch to it.",
        "extra_info": ""
    },
    {
        "text": "And you see how the nice scored lines have gone right through,",
        "extra_info": ""
    },
    {
        "text": "and it's got beautiful crackling, the lovely layer of fat there.",
        "extra_info": ""
    },
    {
        "text": "And that will still need probably another 5-8 minutes resting time,",
        "extra_info": ""
    },
    {
        "text": "so keep that in a warm place, let it rest, then we'll get stuck on our cabbage.",
        "extra_info": ""
    },
    {
        "text": "Okay, to prepare our cabbage, it's very simple,",
        "extra_info": ""
    },
    {
        "text": "we're just gonna take off that little bit of core,",
        "extra_info": ""
    },
    {
        "text": "turn it over, take off the outside layers, and then we're just gonna roughly dice it,",
        "extra_info": ""
    },
    {
        "text": "doesn't matter too much about shape or size, as long as",
        "extra_info": ""
    },
    {
        "text": "they're roughly around about the same sort of size so they don't overcook.",
        "extra_info": ""
    },
    {
        "text": "Potatoes should just about be cooked now.",
        "extra_info": ""
    },
    {
        "text": "So have a little look.",
        "extra_info": ""
    },
    {
        "text": "We're gonna drain them off and then steam dry them.",
        "extra_info": ""
    },
    {
        "text": "The reason why we steam dry it is basically to keep the potato",
        "extra_info": ""
    },
    {
        "text": "lovely and fluffy and light and dry.",
        "extra_info": ""
    },
    {
        "text": "So leave it for a minute, and then we'll get a little bench set up,",
        "extra_info": ""
    },
    {
        "text": "so we can pass them through a drum sieve.",
        "extra_info": ""
    },
    {
        "text": "Our jus has been on now for about 15-20 minutes and you can see",
        "extra_info": ""
    },
    {
        "text": "how that consistency has changed.",
        "extra_info": ""
    },
    {
        "text": "Get that smell to see the aromas, that beautiful caramelized nice porky taste.",
        "extra_info": ""
    },
    {
        "text": "Obviously, think about the aroma and the texture in your mouth,",
        "extra_info": ""
    },
    {
        "text": "see how the texture change a lot, but you'll also notice",
        "extra_info": ""
    },
    {
        "text": "that all those little individual flavors that we were talking about before",
        "extra_info": ""
    },
    {
        "text": "have sort of become one beautiful flavor.",
        "extra_info": ""
    },
    {
        "text": "Yeah, they've all sort of blended together to give a beautifully well balanced sauce.",
        "extra_info": ""
    },
    {
        "text": "- What do you reckon? - Divine.",
        "extra_info": ""
    },
    {
        "text": "Now, what we want to do is strain this through a fine sieve.",
        "extra_info": ""
    },
    {
        "text": "There's a lot of impurities still in here, and to prevent us getting a grainy sauce,",
        "extra_info": ""
    },
    {
        "text": "if I was to push that through,",
        "extra_info": ""
    },
    {
        "text": "we'd get a lot of those little bits of granules in our sauce.",
        "extra_info": ""
    },
    {
        "text": "If you have a look at the consistency of it.",
        "extra_info": ""
    },
    {
        "text": "Wow",
        "extra_info": ""
    },
    {
        "text": "See that beautiful sheen on it? That's what we're talking about.",
        "extra_info": ""
    },
    {
        "text": "We're gonna keep that warm on the side of the stove",
        "extra_info": ""
    },
    {
        "text": "while we finish off the potato puree.",
        "extra_info": ""
    },
    {
        "text": "The next stage for the potato puree is still steam drying the potatoes,",
        "extra_info": ""
    },
    {
        "text": "so we need to put our emulsion on, which is 100 grams of butter.",
        "extra_info": ""
    },
    {
        "text": "But there's 150 grams here, so keep 50 grams back to finish it with,",
        "extra_info": ""
    },
    {
        "text": "100 mils of milk",
        "extra_info": ""
    },
    {
        "text": "and 100 mils of fresh pouring cream.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna put that on the heat just enough to melt it and bring it all together.",
        "extra_info": ""
    },
    {
        "text": "So the next stage is we're gonna push the lovely dried fluffy potatoes",
        "extra_info": ""
    },
    {
        "text": "through the drum sieve. Daniel, if you wanna come in and give me a hand please.",
        "extra_info": ""
    },
    {
        "text": "Have you ever used a sieve like this before?",
        "extra_info": ""
    },
    {
        "text": "No, not a drum sieve. Just a standard old round one.",
        "extra_info": ""
    },
    {
        "text": "Brilliant. Well, what we're gonna do is we're gonna pass it through",
        "extra_info": ""
    },
    {
        "text": "the sieve instead of mashing it in the traditional sense.",
        "extra_info": ""
    },
    {
        "text": "Now, the key to this here is taking a small amount of potato at a time.",
        "extra_info": ""
    },
    {
        "text": "Sometimes you can get a little bit excited, add too much on there",
        "extra_info": ""
    },
    {
        "text": "because you don't want to work the poattoes too much because",
        "extra_info": ""
    },
    {
        "text": "it will become really starchy and grainy.",
        "extra_info": ""
    },
    {
        "text": "So just sort of work within that top part of the sieve,",
        "extra_info": ""
    },
    {
        "text": "and just see, we're not sort of working them so much,",
        "extra_info": ""
    },
    {
        "text": "we're just pushing them through the sieve.",
        "extra_info": ""
    },
    {
        "text": "So just take a few potatoes at a time,",
        "extra_info": ""
    },
    {
        "text": "and the top part of the sieve.",
        "extra_info": ""
    },
    {
        "text": "You don't have to apply too much pressure.",
        "extra_info": ""
    },
    {
        "text": "And with your left hand, just hold the sieve in place, that's right,",
        "extra_info": ""
    },
    {
        "text": "and then just pushing it through in one sort of nice movement.",
        "extra_info": ""
    },
    {
        "text": "Excellent.",
        "extra_info": ""
    },
    {
        "text": "That ladle is just crushing the potato through that sieve,",
        "extra_info": ""
    },
    {
        "text": "and you'll see when we turn it over, it'll come out in these beautiful fluffy strands.",
        "extra_info": ""
    },
    {
        "text": "Lift that up to reveal.",
        "extra_info": ""
    },
    {
        "text": "Now you can see how really light and dry and fluffy it is.",
        "extra_info": ""
    },
    {
        "text": "And that's absolutely perfect.",
        "extra_info": ""
    },
    {
        "text": "- Thanks very much for that, Daniel. - No problem, Justin. Thank you.",
        "extra_info": ""
    },
    {
        "text": "So emulsion's ready, and then we'll add a little bit of that to our potato.",
        "extra_info": ""
    },
    {
        "text": "Just mix it around, so it all incorporates in there.",
        "extra_info": ""
    },
    {
        "text": "We want to basically mix it around, so it just",
        "extra_info": ""
    },
    {
        "text": "leaves the sides of the pan, and is beautiful and firm.",
        "extra_info": ""
    },
    {
        "text": "Then we're gonna add about 50 grams of cold butter,",
        "extra_info": ""
    },
    {
        "text": "basically cause if you're gonna add warm butter or room temperature butter",
        "extra_info": ""
    },
    {
        "text": "to your warm potato, the chance of the butter splitting is quite high.",
        "extra_info": ""
    },
    {
        "text": "So you just wanna add cold butter to it, and then it will help emulsify it.",
        "extra_info": ""
    },
    {
        "text": "So just mix it around a few times and then put that back on the stove.",
        "extra_info": ""
    },
    {
        "text": "Okay guys, for the cabbage, we're gonna blanch it in boiling salted water,",
        "extra_info": ""
    },
    {
        "text": "so a couple of spoons of salt in there,",
        "extra_info": ""
    },
    {
        "text": "and then we add our cabbage, and let that cook for about one minute.",
        "extra_info": ""
    },
    {
        "text": "So while the cabbage is cooking, we're just gonna carve our pork now.",
        "extra_info": ""
    },
    {
        "text": "So first of all, we've obviously got that beautiful layer of fat through there.",
        "extra_info": ""
    },
    {
        "text": "So we're gonna take off a little bit of that,",
        "extra_info": ""
    },
    {
        "text": "take the crackling off first.",
        "extra_info": ""
    },
    {
        "text": "And the pork has been resting for probably about 5 or 10 minutes now,",
        "extra_info": ""
    },
    {
        "text": "and I'll take off that excess fat there.",
        "extra_info": ""
    },
    {
        "text": "Of course, you can leave it on if you like a lovely bit of fat.",
        "extra_info": ""
    },
    {
        "text": "We're just gonna carve that so you can see how wonderful and juicy",
        "extra_info": ""
    },
    {
        "text": "and gorgeous that looks, and it's just cooked.",
        "extra_info": ""
    },
    {
        "text": "So carve it into little medallions.",
        "extra_info": ""
    },
    {
        "text": "So the cabbage will be just cooked, strain it off.",
        "extra_info": ""
    },
    {
        "text": "And then we're gonna toss that in a little bit of butter,",
        "extra_info": ""
    },
    {
        "text": "about 50 grams of butter,",
        "extra_info": ""
    },
    {
        "text": "a little pinch of salt,",
        "extra_info": ""
    },
    {
        "text": "a little bit of black pepper.",
        "extra_info": ""
    },
    {
        "text": "Ok, guys, the final stage of this dish is finishing off the charcuterie jus",
        "extra_info": ""
    },
    {
        "text": "we made before. Now we're gonna add one cooked diced tomato,",
        "extra_info": ""
    },
    {
        "text": "one tablespoon of chopped flat-leaf parsley,",
        "extra_info": ""
    },
    {
        "text": "four baby pickled onions, which have been finely chopped,",
        "extra_info": ""
    },
    {
        "text": "and six little baby cornichons, it's also been finely chopped.",
        "extra_info": ""
    },
    {
        "text": "One teaspoon of finely chopped salted capers",
        "extra_info": ""
    },
    {
        "text": "and a couple of teaspoons of grain mustard.",
        "extra_info": ""
    },
    {
        "text": "And we'll mix all that around, and you can see there's beautiful colors in there,",
        "extra_info": ""
    },
    {
        "text": "and when we eat it, we'll think about, obviously, the richness of pork,",
        "extra_info": ""
    },
    {
        "text": "and those lovely pickled, sweet, juicy flavors,",
        "extra_info": ""
    },
    {
        "text": "cutting the richness of the pork.",
        "extra_info": ""
    },
    {
        "text": "To plate a dish, basically gonna start with a potato puree,",
        "extra_info": ""
    },
    {
        "text": "and we're just gonna make what we call a quenelle,",
        "extra_info": ""
    },
    {
        "text": "a lovely little scoop at the top of the plate like so.",
        "extra_info": ""
    },
    {
        "text": "And then the buttered peppered cabbage, gonna place a nice mound on here,",
        "extra_info": ""
    },
    {
        "text": "that the roast pork is gonna sit on.",
        "extra_info": ""
    },
    {
        "text": "And the pork, we'll add three beautiful slices,",
        "extra_info": ""
    },
    {
        "text": "and then spoon lovely charcuterie jus all over",
        "extra_info": ""
    },
    {
        "text": "and then finish with a lovely big chunk of beautiful crispy crackling.",
        "extra_info": ""
    },
    {
        "text": "What do you reckon, guys? Do you wanna try?",
        "extra_info": ""
    },
    {
        "text": "- It looks awesome. - Can we have some?",
        "extra_info": ""
    },
    {
        "text": "Have a taste of the pork and tell me what you think about the flavors.",
        "extra_info": ""
    },
    {
        "text": "Get a little bit of everything all together.",
        "extra_info": ""
    },
    {
        "text": "But you can see how beautiful and juicy and moist that pork is",
        "extra_info": ""
    },
    {
        "text": "from being protected by all that fat on the outside.",
        "extra_info": ""
    },
    {
        "text": "So much different flavors, and you've got that really base, beautiful savory",
        "extra_info": ""
    },
    {
        "text": "flavor of the sauce and all those little extra bits.",
        "extra_info": ""
    },
    {
        "text": "That's why the sauce is so important in French cookery,",
        "extra_info": ""
    },
    {
        "text": "it really brings our dish together, and just grounds it all up.",
        "extra_info": ""
    },
    {
        "text": "- That crackling is to die for. - It's nice, isn't it?",
        "extra_info": ""
    },
    {
        "text": "It's a lovely sound, isn't it?",
        "extra_info": ""
    },
    {
        "text": "The cabbage is beautiful, complements the pork and the jus.",
        "extra_info": ""
    },
    {
        "text": "It really cuts the richness of the... spice.",
        "extra_info": ""
    },
    {
        "text": "Yeah, nice sharp pickledness from the acidity",
        "extra_info": ""
    },
    {
        "text": "and the mustard and saltiness of the capers.",
        "extra_info": ""
    },
    {
        "text": "- Yeah, and the cornichons. - Absolutely.",
        "extra_info": ""
    },
    {
        "text": "The three most important things to remember with this dish, guys,",
        "extra_info": ""
    },
    {
        "text": "is choosing the right cut of pork to get the best results,",
        "extra_info": ""
    },
    {
        "text": "having an excellent quality stock,",
        "extra_info": ""
    },
    {
        "text": "and not cooking potatoes too rapidly, just having them at gentle poach",
        "extra_info": ""
    },
    {
        "text": "to get that velvet smooth potato puree.",
        "extra_info": ""
    },
    {
        "text": "Thanks very much, guys, it's been fantastic having you in the kitchen today.",
        "extra_info": ""
    },
    {
        "text": "Best of luck with the rest of the competition, I wish you well.",
        "extra_info": ""
    },
    {
        "text": "Gary and George are expecting you back so please have a great day. See you later.",
        "extra_info": ""
    },
    {
        "text": "- Thank you very much. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "- Three... - Up next,",
        "extra_info": ""
    },
    {
        "text": "Indian made easy with guest chef Kumar Mahadevan.",
        "extra_info": ""
    },
    {
        "text": "We don't want the whole spices to burn.",
        "extra_info": ""
    },
    {
        "text": "We only want them to sweat.",
        "extra_info": ""
    },
    {
        "text": "And a little later, George shows how to make the French classic, creme brulee.",
        "extra_info": ""
    },
    {
        "text": "- How hard is it? - Georgie...",
        "extra_info": ""
    },
    {
        "text": "that is delicious.",
        "extra_info": ""
    },
    {
        "text": "Next on MasterClass, we're gonna revisit your invention test.",
        "extra_info": ""
    },
    {
        "text": "I bet you're itching to know what the theme is for today's invention test.",
        "extra_info": ""
    },
    {
        "text": "And it's an absolute doozy.",
        "extra_info": ""
    },
    {
        "text": "And that, of course, was an Indian themed invention test.",
        "extra_info": ""
    },
    {
        "text": "You had access to countless herbs and spices, as many as you wanted.",
        "extra_info": ""
    },
    {
        "text": "Jonathan, your dish surprised us.",
        "extra_info": ""
    },
    {
        "text": "The clarity of flavor, the thought that you put in,",
        "extra_info": ""
    },
    {
        "text": "and then those lovely sorbets with the praline of papadum,",
        "extra_info": ""
    },
    {
        "text": "I thought was a really good idea.",
        "extra_info": ""
    },
    {
        "text": "And Jimmy, yours was a lovely, I think classic dish,",
        "extra_info": ""
    },
    {
        "text": "sort of dish that maybe you'd find in a home.",
        "extra_info": ""
    },
    {
        "text": "Yeah. I mean it's a bit hard to sometimes think outside the square",
        "extra_info": ""
    },
    {
        "text": "when what you've grown up with is in your head.",
        "extra_info": ""
    },
    {
        "text": "So with all of that in mind, we have a very special guest,",
        "extra_info": ""
    },
    {
        "text": "one of the top Indian chefs in the country, and that's Kumar Mahadevan.",
        "extra_info": ""
    },
    {
        "text": "I'm Kumar Mahadevan, chef and owner of Aki's Indian restaurant at Woolloomooloo.",
        "extra_info": ""
    },
    {
        "text": "The advice due to an amateur chef is to understand the flavor",
        "extra_info": ""
    },
    {
        "text": "of each ingredient on its own,",
        "extra_info": ""
    },
    {
        "text": "and then marrying the ingredients gives the best result.",
        "extra_info": ""
    },
    {
        "text": "Kumar, welcome to the MasterChef kitchen.",
        "extra_info": ""
    },
    {
        "text": "- Thank you, Gary. - Guys, Kumar.",
        "extra_info": ""
    },
    {
        "text": "Now tell us something about your restaurants.",
        "extra_info": ""
    },
    {
        "text": "What sort of food are you doing?",
        "extra_info": ""
    },
    {
        "text": "So we're doing traditional Indian food with a modern twist,",
        "extra_info": ""
    },
    {
        "text": "and the flavors are quite contemporary.",
        "extra_info": ""
    },
    {
        "text": "Now, Indian food is not Indian food, is it?",
        "extra_info": ""
    },
    {
        "text": "There's lots of regional differences in the cuisine?",
        "extra_info": ""
    },
    {
        "text": "What do you specialize in?",
        "extra_info": ""
    },
    {
        "text": "I'm from the native place of Chennai, which is actually a southern part of India.",
        "extra_info": ""
    },
    {
        "text": "Indian food varies from region to region.",
        "extra_info": ""
    },
    {
        "text": "As you travel north, the food gets a little bit milder",
        "extra_info": ""
    },
    {
        "text": "and it gets more richer and creamier and nutty.",
        "extra_info": ""
    },
    {
        "text": "Why is that? Why is it richer and nuttier and creamier as you go north?",
        "extra_info": ""
    },
    {
        "text": "What's that? The climate? - The climate.",
        "extra_info": ""
    },
    {
        "text": "- Okay. - The climate.",
        "extra_info": ""
    },
    {
        "text": "- Tell us what we're cooking today. - It's called Eral Vendakai Kuzhambu,",
        "extra_info": ""
    },
    {
        "text": "which means, eral means prawn, vendakai means okra, kuzhambu means a gravy,",
        "extra_info": ""
    },
    {
        "text": "so it's Prawn okra tamarind curry.",
        "extra_info": ""
    },
    {
        "text": "What's the first step? What are we gonna do?",
        "extra_info": ""
    },
    {
        "text": "The first step is, we're going to start doing the tempering of a dish.",
        "extra_info": ""
    },
    {
        "text": "We throw the spice on the hot oil to release the flavors.",
        "extra_info": ""
    },
    {
        "text": "This is the unscented sesame oil. Unlike the Chinese cooking, this got no smell.",
        "extra_info": ""
    },
    {
        "text": "Because in Chinese cooking you use sesame oil to...",
        "extra_info": ""
    },
    {
        "text": "- With the flavor. - ... season.",
        "extra_info": ""
    },
    {
        "text": "It's like salt and pepper. You put a little bit of sesame oil in. So, oil in the pan.",
        "extra_info": ""
    },
    {
        "text": "First, oil in the pan.",
        "extra_info": ""
    },
    {
        "text": "And then what are the three spices that you've got here?",
        "extra_info": ""
    },
    {
        "text": "Yeah, we've got black mustard seeds, whole cumin seeds,",
        "extra_info": ""
    },
    {
        "text": "and fenugreek seeds. - Okay.",
        "extra_info": ""
    },
    {
        "text": "Now, there is an order in which you put these always.",
        "extra_info": ""
    },
    {
        "text": "The mustard seeds need to be going in first, they need to crack open. Pop.",
        "extra_info": ""
    },
    {
        "text": "Only when they pop, you know, the mustard seeds are cooked,",
        "extra_info": ""
    },
    {
        "text": "otherwise they'll never cook. - Okay.",
        "extra_info": ""
    },
    {
        "text": "That is how you release the flavor of mustard.",
        "extra_info": ""
    },
    {
        "text": "Next is fenugreek seeds. These dry fenugreek seeds should be used very small.",
        "extra_info": ""
    },
    {
        "text": "In excess, putting in a curry, it'll make it bitter.",
        "extra_info": ""
    },
    {
        "text": "Then it's whole cumin.",
        "extra_info": ""
    },
    {
        "text": "Okay, Kumar, so we've put the sesame oil in, it's got hot.",
        "extra_info": ""
    },
    {
        "text": "- First thing in it? Mustard seeds - The mustard seeds.",
        "extra_info": ""
    },
    {
        "text": "First thing in is black mustard seeds.",
        "extra_info": ""
    },
    {
        "text": "- So about teaspoon of those. - Yeah.",
        "extra_info": ""
    },
    {
        "text": "Now we're getting crackle.",
        "extra_info": ""
    },
    {
        "text": "When each and every mustard seed is cracked, it will stop.",
        "extra_info": ""
    },
    {
        "text": "And you do that first before you add anything else. And that's critical.",
        "extra_info": ""
    },
    {
        "text": "That is critical.",
        "extra_info": ""
    },
    {
        "text": "Now you add the fenugreek seeds.",
        "extra_info": ""
    },
    {
        "text": "You see the quantity, it's less. Half. Half.",
        "extra_info": ""
    },
    {
        "text": "- I put the cumin seeds. - About a teaspoon.",
        "extra_info": ""
    },
    {
        "text": "- Teaspoon. - And then goes the shallots.",
        "extra_info": ""
    },
    {
        "text": "Then goes the shallots. We don't want the whole spices to burn.",
        "extra_info": ""
    },
    {
        "text": "- We only want them to sweat. - Okay.",
        "extra_info": ""
    },
    {
        "text": "I don't want to have a brown onion flavor in my sauce.",
        "extra_info": ""
    },
    {
        "text": "Okay. So more of a sweet onion flavor which you get from sweating slowly.",
        "extra_info": ""
    },
    {
        "text": "So next, are you gonna put the okra in?",
        "extra_info": ""
    },
    {
        "text": "What are they? And how do you cook these things?",
        "extra_info": ""
    },
    {
        "text": "These okras are... these are vegetables.",
        "extra_info": ""
    },
    {
        "text": "They are slimy.",
        "extra_info": ""
    },
    {
        "text": "So you don't boil okra. You either roast them dry or with a bit of oil.",
        "extra_info": ""
    },
    {
        "text": "That's what you need.",
        "extra_info": ""
    },
    {
        "text": "- So basically, you're peeling the top off. - Correct",
        "extra_info": ""
    },
    {
        "text": "And you're exposing a surface of the okra.",
        "extra_info": ""
    },
    {
        "text": "You make a small incision in the okra, so that everything penetrates inside.",
        "extra_info": ""
    },
    {
        "text": "Beautiful.",
        "extra_info": ""
    },
    {
        "text": "- So, into the shallot and spice mixture. - Yes.",
        "extra_info": ""
    },
    {
        "text": "Now, at this stage, I have not added any powdered spices.",
        "extra_info": ""
    },
    {
        "text": "I don't want the powdered spices to be coated on the okra at this stage.",
        "extra_info": ""
    },
    {
        "text": "Slightly season the okra.",
        "extra_info": ""
    },
    {
        "text": "What we are trying to achieve here is drive the moisture out of the okra,",
        "extra_info": ""
    },
    {
        "text": "so that the sliminess of the okra is... we drive it away.",
        "extra_info": ""
    },
    {
        "text": "- So how long are you gonna cook that for? - Two minutes.",
        "extra_info": ""
    },
    {
        "text": "- Okay. - The okra will become",
        "extra_info": ""
    },
    {
        "text": "a little bit softer. - Yeah.",
        "extra_info": ""
    },
    {
        "text": "because it is cooking in heat, the okra will continue to cook,",
        "extra_info": ""
    },
    {
        "text": "so we can take it a bit earlier.",
        "extra_info": ""
    },
    {
        "text": "So when the curry's finished, you still want to have some",
        "extra_info": ""
    },
    {
        "text": "bite to it, bit of texture. - A little bit of texture.",
        "extra_info": ""
    },
    {
        "text": "So now what are you doing?",
        "extra_info": ""
    },
    {
        "text": "Now we're removing the okra and keeping it",
        "extra_info": ""
    },
    {
        "text": "for finishing the dish.",
        "extra_info": ""
    },
    {
        "text": "So you take the okra out and then you continue to make the curry",
        "extra_info": ""
    },
    {
        "text": "around the shallots.",
        "extra_info": ""
    },
    {
        "text": "So next you've got dry spices. What's going in first?",
        "extra_info": ""
    },
    {
        "text": "- First is turmeric. - About a teaspoon. - Teaspoon.",
        "extra_info": ""
    },
    {
        "text": "Two tablespoons of coriander powder.",
        "extra_info": ""
    },
    {
        "text": "And one tablespoon of chilli powder.",
        "extra_info": ""
    },
    {
        "text": "Okay, and you just put that in and then you put the water straight on top.",
        "extra_info": ""
    },
    {
        "text": "- So you don't cook those out... - You don't cook these things,",
        "extra_info": ""
    },
    {
        "text": "that's the difference between this and northern Indian cuisine.",
        "extra_info": ""
    },
    {
        "text": "- How much water do you put in? - About half a liter? - Half a liter.",
        "extra_info": ""
    },
    {
        "text": "Okay.",
        "extra_info": ""
    },
    {
        "text": "Now we're gonna put some tamarind pulp.",
        "extra_info": ""
    },
    {
        "text": "- It's like a pod, isn't it? - It is a pod.",
        "extra_info": ""
    },
    {
        "text": "It's a pod, it breaks down, and then you can sieve it, take out the stones or seeds,",
        "extra_info": ""
    },
    {
        "text": "and then you're left with the pulp. - Yes.",
        "extra_info": ""
    },
    {
        "text": "And in this case, this has been liquefied, I suppose,",
        "extra_info": ""
    },
    {
        "text": "so it's nice and easy to use. - Nice and easy to use.",
        "extra_info": ""
    },
    {
        "text": "So how much did you put in there?",
        "extra_info": ""
    },
    {
        "text": "- 150 mil. - 150 mil.",
        "extra_info": ""
    },
    {
        "text": "- So in with the tomatoes. - Please.",
        "extra_info": ""
    },
    {
        "text": "And we've got two vine-ripened tomatoes there.",
        "extra_info": ""
    },
    {
        "text": "They go in, and then what happens next?",
        "extra_info": ""
    },
    {
        "text": "Now we cook the sauce for about ten minutes on medium heat.",
        "extra_info": ""
    },
    {
        "text": "We don't want the heat to be too high.",
        "extra_info": ""
    },
    {
        "text": "This sauce at the moment is raw. The flavors are raw because",
        "extra_info": ""
    },
    {
        "text": "we have added the powder spices in water. They need to cook.",
        "extra_info": ""
    },
    {
        "text": "But we will get some scum around the sauce.",
        "extra_info": ""
    },
    {
        "text": "It will say that it's not cooked.",
        "extra_info": ""
    },
    {
        "text": "- Is that coming up now? - It is coming up.",
        "extra_info": ""
    },
    {
        "text": "So when you say scum, that's the tomato and the spices,",
        "extra_info": ""
    },
    {
        "text": "that comes to the top. Now, you don't skim that off.",
        "extra_info": ""
    },
    {
        "text": "- No, don't skim it off. - Why not?",
        "extra_info": ""
    },
    {
        "text": "We want to cook this.",
        "extra_info": ""
    },
    {
        "text": "So you want all the flavors to cook into the sauce and become",
        "extra_info": ""
    },
    {
        "text": "a nice sort of harmonious sauce.",
        "extra_info": ""
    },
    {
        "text": "- So how long has this to cook now? - This has to cook for ten minutes.",
        "extra_info": ""
    },
    {
        "text": "Okay. So we've got ten minutes, and then next in we'll put the prawns.",
        "extra_info": ""
    },
    {
        "text": "Absolutely.",
        "extra_info": ""
    },
    {
        "text": "When we come back, our guest chef serves up his delicious Chennai prawn Vendakai.",
        "extra_info": ""
    },
    {
        "text": "I love this, it's fantastic.",
        "extra_info": ""
    },
    {
        "text": "We're making a jumbo prawn and okra curry.",
        "extra_info": ""
    },
    {
        "text": "Now this curry sauce has been cooking for about ten minutes,",
        "extra_info": ""
    },
    {
        "text": "what do we do next?",
        "extra_info": ""
    },
    {
        "text": "We need to balance the dish.",
        "extra_info": ""
    },
    {
        "text": "There is one component which is lacking, which is a sweetness.",
        "extra_info": ""
    },
    {
        "text": "Here the sweetness is coming from the prawn.",
        "extra_info": ""
    },
    {
        "text": "So prawns to go in. Oh, that's beautiful.",
        "extra_info": ""
    },
    {
        "text": "- As you can see, all this comes settled. - So everything's infused,",
        "extra_info": ""
    },
    {
        "text": "it's cooked together, tomato's broken down,",
        "extra_info": ""
    },
    {
        "text": "and these jumbo prawns looks absolutely amazing.",
        "extra_info": ""
    },
    {
        "text": "What have you done here, you've taken the legs and the shell off the back,",
        "extra_info": ""
    },
    {
        "text": "but you've left a little tail. - That's right.",
        "extra_info": ""
    },
    {
        "text": "I want to cook the dish with the head so that it gives a nice flavor to the sauce.",
        "extra_info": ""
    },
    {
        "text": "We're not using the stock, the heads of the prawns are gonna",
        "extra_info": ""
    },
    {
        "text": "enhance the flavor of the sauce. - Brilliant.",
        "extra_info": ""
    },
    {
        "text": "So the prawns into the curry sauce. - Prawns into the curry sauce.",
        "extra_info": ""
    },
    {
        "text": "Can you substitute other proteins or other seafood?",
        "extra_info": ""
    },
    {
        "text": "You can use fish, you can use calamari, you can use octopus.",
        "extra_info": ""
    },
    {
        "text": "It's not a problem. - Okay.",
        "extra_info": ""
    },
    {
        "text": "Any form of seafood will go very well with this dish.",
        "extra_info": ""
    },
    {
        "text": "We add a little bit of seasoning.",
        "extra_info": ""
    },
    {
        "text": "Lid on. - So our prawn curry's cooking.",
        "extra_info": ""
    },
    {
        "text": "- Prawns are in. That takes how long? - About 5-7 minutes.",
        "extra_info": ""
    },
    {
        "text": "5-7 minutes. So in the meantime, we've got something else to do.",
        "extra_info": ""
    },
    {
        "text": "What are we making here?",
        "extra_info": ""
    },
    {
        "text": "We're making a ground paste of freshly grated coconut",
        "extra_info": ""
    },
    {
        "text": "and this is roasted chana dal.",
        "extra_info": ""
    },
    {
        "text": "- Okay. What's chana dal? Explain. - Chana dal is yellow split peas.",
        "extra_info": ""
    },
    {
        "text": "But this is dry roasted and split. - It's got sort of a toasty,",
        "extra_info": ""
    },
    {
        "text": "sort of mealy flavor, which is lovely. This lends some richness and body",
        "extra_info": ""
    },
    {
        "text": "to the sauce, is that right? - Yes.",
        "extra_info": ""
    },
    {
        "text": "Okay, so we've got couple of tablespoons of chana dal,",
        "extra_info": ""
    },
    {
        "text": "and there's about cup and a half of fresh coconut, right?",
        "extra_info": ""
    },
    {
        "text": "And then you put how much water? - Probably half a liter of water there.",
        "extra_info": ""
    },
    {
        "text": "We don't want to put too much water to grind with, because",
        "extra_info": ""
    },
    {
        "text": "they will not become smooth. If it needs more water we can always add later.",
        "extra_info": ""
    },
    {
        "text": "Okay, so it's looking like a milkshake, it's like a coconut milkshake,",
        "extra_info": ""
    },
    {
        "text": "with a little bit of chana dal in. Okay, here we go?",
        "extra_info": ""
    },
    {
        "text": "- So is that fine enough? - That's fine. That's pretty good.",
        "extra_info": ""
    },
    {
        "text": "So it's broken down that chana dal, and you've got this sort of coconut milk and",
        "extra_info": ""
    },
    {
        "text": "it's like a toasty sort of smell to it. All right, so what's next?",
        "extra_info": ""
    },
    {
        "text": "- We're going to open the prawns. - Yes.",
        "extra_info": ""
    },
    {
        "text": "As you can see, the prawns changed the color,",
        "extra_info": ""
    },
    {
        "text": "they're becoming a little bit more cooked through.",
        "extra_info": ""
    },
    {
        "text": "And that's really changed the smell as well. It's sweeter,",
        "extra_info": ""
    },
    {
        "text": "and it's getting richer as it's cooking.",
        "extra_info": ""
    },
    {
        "text": "At this stage we add some fresh curry leaf,",
        "extra_info": ""
    },
    {
        "text": "and we add the ground paste.",
        "extra_info": ""
    },
    {
        "text": "So it's gonna add some creaminess, some depth of flavor,",
        "extra_info": ""
    },
    {
        "text": "and a bit of texture as well, cause it's still got that coconut inside.",
        "extra_info": ""
    },
    {
        "text": "Oh, that's lovely.",
        "extra_info": ""
    },
    {
        "text": "Alright, so a bit of a stir around.",
        "extra_info": ""
    },
    {
        "text": "- When does the okra go back in? - The okra should go in now.",
        "extra_info": ""
    },
    {
        "text": "- Okay, so okra, in it goes. - Okra, it goes.",
        "extra_info": ""
    },
    {
        "text": "Yes. Lovely.",
        "extra_info": ""
    },
    {
        "text": "- Put the lid back on. - And then you've got the sesame oil.",
        "extra_info": ""
    },
    {
        "text": "Sesame oil, yes. Unscented.",
        "extra_info": ""
    },
    {
        "text": "We're going to temper these red hot chillis.",
        "extra_info": ""
    },
    {
        "text": "You're poppin them into hot oil. What are you looking for now?",
        "extra_info": ""
    },
    {
        "text": "What's going to happen?",
        "extra_info": ""
    },
    {
        "text": "We are going to change the color of this to black,",
        "extra_info": ""
    },
    {
        "text": "because that takes the bitterness of the chilies.",
        "extra_info": ""
    },
    {
        "text": "You'd think they'd be burned when they're black.",
        "extra_info": ""
    },
    {
        "text": "- No. - It's the right flavor?",
        "extra_info": ""
    },
    {
        "text": "- It's the right flavor. - And so they blistered up,",
        "extra_info": ""
    },
    {
        "text": "they started to blister up, and they changed color.",
        "extra_info": ""
    },
    {
        "text": "You're gonna put the curry leaves in and then you're gonna throw it in there,",
        "extra_info": ""
    },
    {
        "text": "you're gonna put the lid on.",
        "extra_info": ""
    },
    {
        "text": "Gee. And that's like a last little punch of flavor.",
        "extra_info": ""
    },
    {
        "text": "- Yes. - Fantastic.",
        "extra_info": ""
    },
    {
        "text": "At this stage, do not open the lid for two minutes,",
        "extra_info": ""
    },
    {
        "text": "so the flavors will seep through in.",
        "extra_info": ""
    },
    {
        "text": "Beautiful. Nice little flurry, right at the end.",
        "extra_info": ""
    },
    {
        "text": "Okay, so we're nearly ready to serve up,",
        "extra_info": ""
    },
    {
        "text": "let's have a look at this gorgeous prawn curry. Look at that.",
        "extra_info": ""
    },
    {
        "text": "I love the colors. They're really vibrant.",
        "extra_info": ""
    },
    {
        "text": "I presume nobody wants to taste this, do they?",
        "extra_info": ""
    },
    {
        "text": "So what, hands up if you wanna taste.",
        "extra_info": ""
    },
    {
        "text": "Oh, funny, right, okay.",
        "extra_info": ""
    },
    {
        "text": "You know, what I love is those really dark chillies as well.",
        "extra_info": ""
    },
    {
        "text": "Now I've seen you do it, I understand the reasoning behind it.",
        "extra_info": ""
    },
    {
        "text": "It's not the chef overcooking the chillies. - No.",
        "extra_info": ""
    },
    {
        "text": "Kumar, that is an absolutely beauitful prawn and okra curry,",
        "extra_info": ""
    },
    {
        "text": "and it just goes to show, even for me, as a chef,",
        "extra_info": ""
    },
    {
        "text": "that you can produce some really tasty and gorgeous curries,",
        "extra_info": ""
    },
    {
        "text": "and they're not too complicated, that is very very simple recipe.",
        "extra_info": ""
    },
    {
        "text": "That is the whole objective. You don't need to complicate it,",
        "extra_info": ""
    },
    {
        "text": "keep it simple, and it'll taste great.",
        "extra_info": ""
    },
    {
        "text": "See I always thought you had to put like thirty spices in.",
        "extra_info": ""
    },
    {
        "text": "No.",
        "extra_info": ""
    },
    {
        "text": "Jimmy, you're corrupting me. Right.",
        "extra_info": ""
    },
    {
        "text": "Let's get a couple of people up to taste.",
        "extra_info": ""
    },
    {
        "text": "Jimmy, Skye and Jonathan, let's go.",
        "extra_info": ""
    },
    {
        "text": "I'm not a big fan of really hot curries, but the heat isn't too overpowering.",
        "extra_info": ""
    },
    {
        "text": "Also, the coconut is really quite soothing on the palate.",
        "extra_info": ""
    },
    {
        "text": "And the flavor is just amazing, it's just really typical south Indian.",
        "extra_info": ""
    },
    {
        "text": "What's your typical south Indian?",
        "extra_info": ""
    },
    {
        "text": "What you're tasting really is the mustard.",
        "extra_info": ""
    },
    {
        "text": "And also the different times you put the curry leaf in.",
        "extra_info": ""
    },
    {
        "text": "Right, they have been put specifically twice.",
        "extra_info": ""
    },
    {
        "text": "- So you love it? - Oh I love this, it's fantastic.",
        "extra_info": ""
    },
    {
        "text": "Thank you. Thank you.",
        "extra_info": ""
    },
    {
        "text": "Guys, sit down, thank you very much.",
        "extra_info": ""
    },
    {
        "text": "Thank you very much.",
        "extra_info": ""
    },
    {
        "text": "So Kumar, that was a lovely, simple curry you showed us.",
        "extra_info": ""
    },
    {
        "text": "- Thank you. - Can you give us your,",
        "extra_info": ""
    },
    {
        "text": "say, three top tips for a great curry?",
        "extra_info": ""
    },
    {
        "text": "Buy your spices in smaller quantities.",
        "extra_info": ""
    },
    {
        "text": "Keep them in sealed containers so that they stay fresh.",
        "extra_info": ""
    },
    {
        "text": "Next is understanding the spices. Do not overspice your dish.",
        "extra_info": ""
    },
    {
        "text": "And the last one is to temper the spices.",
        "extra_info": ""
    },
    {
        "text": "When you temper the spices and finish it, it releases flavors,",
        "extra_info": ""
    },
    {
        "text": "and they retain the flavors.",
        "extra_info": ""
    },
    {
        "text": "Kumar, thank you so much for coming and showing us a beautiful curry.",
        "extra_info": ""
    },
    {
        "text": "Guys, thank Kumar. Thank you so much indeed.",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "Ahead on MasterClass.",
        "extra_info": ""
    },
    {
        "text": "This is something I got given to me as an apprentice.",
        "extra_info": ""
    },
    {
        "text": "I'll never forget it.",
        "extra_info": ""
    },
    {
        "text": "George shows how to prepare a classic creme brulee.",
        "extra_info": ""
    },
    {
        "text": "So the more you whisk, the better the creme brulee.",
        "extra_info": ""
    },
    {
        "text": "Earlier this week, you had a team challenge of a lifetime.",
        "extra_info": ""
    },
    {
        "text": "It was the French team challenge, and you had some of the most amazing mentors",
        "extra_info": ""
    },
    {
        "text": "and judges tasting your food.",
        "extra_info": ""
    },
    {
        "text": "There was some fantastic dishes, but there was a couple of dishes,",
        "extra_info": ""
    },
    {
        "text": "that didn't really hit the mark.",
        "extra_info": ""
    },
    {
        "text": "Yeah, a bit upset to be honest.",
        "extra_info": ""
    },
    {
        "text": "The creme brulee,",
        "extra_info": ""
    },
    {
        "text": "that wasn't really a creme brulee, it was more like a soup.",
        "extra_info": ""
    },
    {
        "text": "It was bruleed on the top and watery and runny in the center.",
        "extra_info": ""
    },
    {
        "text": "Yes, it probably did taste great in terms of flavor,",
        "extra_info": ""
    },
    {
        "text": "but the whole essence of a great creme brulee is that crunch at the top",
        "extra_info": ""
    },
    {
        "text": "and that sort of smooth creaminess underneath of vanilla.",
        "extra_info": ""
    },
    {
        "text": "Carrie, Joanne and Phillip were responsible for the creme brulee on the blue team,",
        "extra_info": ""
    },
    {
        "text": "so Carrie, do you wanna come up and give me a hand in making one?",
        "extra_info": ""
    },
    {
        "text": "I thought you might ask me to do that.",
        "extra_info": ""
    },
    {
        "text": "Used to be one of my favorite desserts.",
        "extra_info": ""
    },
    {
        "text": "So guys, we're just gonna make a simple creme brulee.",
        "extra_info": ""
    },
    {
        "text": "Nothing fancy, something that you should have in your repertoire.",
        "extra_info": ""
    },
    {
        "text": "This is something I got given to me as an apprentice,",
        "extra_info": ""
    },
    {
        "text": "I'll never forget it, it's been in my little dodgy red book,",
        "extra_info": ""
    },
    {
        "text": "and I'm passing it onto you guys, to keep in your book.",
        "extra_info": ""
    },
    {
        "text": "Right, first step is, we need to scold the cream.",
        "extra_info": ""
    },
    {
        "text": "So we've got 600 mils of cream, if you could tip that in there, that'd be great.",
        "extra_info": ""
    },
    {
        "text": "Just make sure that you get all the little scurries of it out.",
        "extra_info": ""
    },
    {
        "text": "And another little tip is that you pop the lid back on,",
        "extra_info": ""
    },
    {
        "text": "pop that under a hot running water and then tip the rest out,",
        "extra_info": ""
    },
    {
        "text": "cause there's still cream in there.",
        "extra_info": ""
    },
    {
        "text": "So we turn our gas on, and basically scolding means",
        "extra_info": ""
    },
    {
        "text": "to bring something up to the boil.",
        "extra_info": ""
    },
    {
        "text": "As soon as it comes to the boil, we turn the gas off,",
        "extra_info": ""
    },
    {
        "text": "we've scolded it.",
        "extra_info": ""
    },
    {
        "text": "Next step is to pop some vanilla in there. So we've got a whole pod,",
        "extra_info": ""
    },
    {
        "text": "so I want you to split the pod in half, scrape the seeds out, pop that in there,",
        "extra_info": ""
    },
    {
        "text": "including the actual pod itself.",
        "extra_info": ""
    },
    {
        "text": "Stop for 1 sec, let me just show you something.",
        "extra_info": ""
    },
    {
        "text": "So, it's flat alright? So run your knife through it,",
        "extra_info": ""
    },
    {
        "text": "and then it means as you get to that point there, scrape.",
        "extra_info": ""
    },
    {
        "text": "And then it all goes into the...",
        "extra_info": ""
    },
    {
        "text": "Next step is to whisk our egg yolks and our sugar.",
        "extra_info": ""
    },
    {
        "text": "We've got six egg yolks, all into the bowl,",
        "extra_info": ""
    },
    {
        "text": "and a quarter of a cup of caster sugar,",
        "extra_info": ""
    },
    {
        "text": "Make sure you get every scurry out,",
        "extra_info": ""
    },
    {
        "text": "as it's perfectly weighed. And I want you to start creaming the sugar with the egg yolks.",
        "extra_info": ""
    },
    {
        "text": "And it might seem quite silly to do that, but you're actually cooking the egg yolks",
        "extra_info": ""
    },
    {
        "text": "indirectly with the sugar.",
        "extra_info": ""
    },
    {
        "text": "By whisking it, you're getting those egg yolks nice and creamy,",
        "extra_info": ""
    },
    {
        "text": "which is an important process when making this creme brulee.",
        "extra_info": ""
    },
    {
        "text": "The whiter the egg yolks become, the better you're gonna end up with.",
        "extra_info": ""
    },
    {
        "text": "You're gonna end up with really white, creamy, flavorsome creme brulee,",
        "extra_info": ""
    },
    {
        "text": "rather than an eggy one.",
        "extra_info": ""
    },
    {
        "text": "Alright, so the more you whisk, the better the creme brulee.",
        "extra_info": ""
    },
    {
        "text": "Right, the cream's just about scolded. And that's fantastic,",
        "extra_info": ""
    },
    {
        "text": "cause what's happening there is that vanilla is penetrating into the cream.",
        "extra_info": ""
    },
    {
        "text": "And at this point here, we flick the gas off.",
        "extra_info": ""
    },
    {
        "text": "We're gonna tip the cream into the eggs.",
        "extra_info": ""
    },
    {
        "text": "So we need to work quickly, it's always good to do with someone.",
        "extra_info": ""
    },
    {
        "text": "If you haven't got someone to help you, a little tip for you",
        "extra_info": ""
    },
    {
        "text": "is to grab a tee towel, wet it,",
        "extra_info": ""
    },
    {
        "text": "lift your bowl up, and create like a little socket.",
        "extra_info": ""
    },
    {
        "text": "Pop that there and I want you to do this on your own, okay?",
        "extra_info": ""
    },
    {
        "text": "Grab that, and slowly tip it in.",
        "extra_info": ""
    },
    {
        "text": "The tea towel just stabilizes the bowl, and supports you.",
        "extra_info": ""
    },
    {
        "text": "Alright, yep, get it all in.",
        "extra_info": ""
    },
    {
        "text": "Quick, quick, quick, quick. Alright.",
        "extra_info": ""
    },
    {
        "text": "Next step, I'm gonna get you to pass that through the sieve.",
        "extra_info": ""
    },
    {
        "text": "Alright. Hold it up.",
        "extra_info": ""
    },
    {
        "text": "So we've just strained out that whole vanilla pod.",
        "extra_info": ""
    },
    {
        "text": "And if there's any cooked egg yolk in there, that's gone as well. Alright?",
        "extra_info": ""
    },
    {
        "text": "Next step is to fill our molds up. Just some souffle molds,",
        "extra_info": ""
    },
    {
        "text": "we haven't done anything to them.",
        "extra_info": ""
    },
    {
        "text": "We've lined the bottom of the tray with a towel or a cloth.",
        "extra_info": ""
    },
    {
        "text": "You can put a piece of cardboard in there.",
        "extra_info": ""
    },
    {
        "text": "It's always good, when you're cooking something in a bain-marie,",
        "extra_info": ""
    },
    {
        "text": "in the oven, is to elevate it a little bit, give it some protection.",
        "extra_info": ""
    },
    {
        "text": "That on something hard as this steel product here,",
        "extra_info": ""
    },
    {
        "text": "It's just gonna get really hot on the bottom of the brulee.",
        "extra_info": ""
    },
    {
        "text": "There's air bubbles there. We don't want those air bubbles to go in there,",
        "extra_info": ""
    },
    {
        "text": "cause when that goes in the oven, you're gonna end up with",
        "extra_info": ""
    },
    {
        "text": "all these air bubbles on the top. So there's two ways to get rid of them.",
        "extra_info": ""
    },
    {
        "text": "Blowtorch, and you get rid of them like that.",
        "extra_info": ""
    },
    {
        "text": "If you haven't got a blowtorch, tip it into a plastic bag,",
        "extra_info": ""
    },
    {
        "text": "and seal it, remove the air. Then tip your mixture in,",
        "extra_info": ""
    },
    {
        "text": "and that will remove any air bubbles whatsoever.",
        "extra_info": ""
    },
    {
        "text": "Little tricks pastry chefs use, yeah?",
        "extra_info": ""
    },
    {
        "text": "We need to fill up the tray with some water.",
        "extra_info": ""
    },
    {
        "text": "What we wanna do here is maintain those temperatures,",
        "extra_info": ""
    },
    {
        "text": "so we've got a warm mixture there, we don't wanna put cold water in,",
        "extra_info": ""
    },
    {
        "text": "so we need to put warm water in. Sometimes what happens if it's cold,",
        "extra_info": ""
    },
    {
        "text": "it starts to separate.",
        "extra_info": ""
    },
    {
        "text": "All these little things are extremely, extremely important.",
        "extra_info": ""
    },
    {
        "text": "About a third up. Fantastic.",
        "extra_info": ""
    },
    {
        "text": "Alright, let's start filling up.",
        "extra_info": ""
    },
    {
        "text": "You want to grab the other one, and fill up the other two?",
        "extra_info": ""
    },
    {
        "text": "We pretty much go right up to the top of that lip.",
        "extra_info": ""
    },
    {
        "text": "About there.",
        "extra_info": ""
    },
    {
        "text": "Next step is to foil.",
        "extra_info": ""
    },
    {
        "text": "- Shiny side down? - Shiny side down.",
        "extra_info": ""
    },
    {
        "text": "- What does the foil do, George? - Look, the foil is there to protect",
        "extra_info": ""
    },
    {
        "text": "the top of the brulee so you don't get a crust on it.",
        "extra_info": ""
    },
    {
        "text": "That goes into an oven at 120 degrees for around 30 to 40 minutes.",
        "extra_info": ""
    },
    {
        "text": "Still to come.",
        "extra_info": ""
    },
    {
        "text": "As it's starting to caramelize, pull back.",
        "extra_info": ""
    },
    {
        "text": "Carrie helps George put the finishing touches to his amazing dessert.",
        "extra_info": ""
    },
    {
        "text": "It's unreal.",
        "extra_info": ""
    },
    {
        "text": "Right, so our brulees have cooked in the oven,",
        "extra_info": ""
    },
    {
        "text": "we've pulled them out, we've let them come to room temperature,",
        "extra_info": ""
    },
    {
        "text": "and we've popped them in the fridge for about two hours to cool down.",
        "extra_info": ""
    },
    {
        "text": "Voila. The next step I think is the fun bit. Putting that crust on the top.",
        "extra_info": ""
    },
    {
        "text": "The sugar that we're using is demerara sugar.",
        "extra_info": ""
    },
    {
        "text": "You guys used caster sugar.",
        "extra_info": ""
    },
    {
        "text": "Look, I think this has got a lovely flavor,",
        "extra_info": ""
    },
    {
        "text": "but on top of that it caramelizes quickly. So you're not leaving the blowtorch on there",
        "extra_info": ""
    },
    {
        "text": "for a long period of time.",
        "extra_info": ""
    },
    {
        "text": "We just need to dust our ramikins with the sugar generously,",
        "extra_info": ""
    },
    {
        "text": "and you can just give it a shake around just to make sure it's",
        "extra_info": ""
    },
    {
        "text": "it's even. And then,",
        "extra_info": ""
    },
    {
        "text": "we blow together. Ready?",
        "extra_info": ""
    },
    {
        "text": "And you gotta be really gentle. As it's starting to caramelize, pull back.",
        "extra_info": ""
    },
    {
        "text": "The sugar is caramelizing a lot quicker.",
        "extra_info": ""
    },
    {
        "text": "What I like to do is actually add a second coating of sugar.",
        "extra_info": ""
    },
    {
        "text": "So I've got that double crust.",
        "extra_info": ""
    },
    {
        "text": "Now if you want to start them being a little bit clever in terms of",
        "extra_info": ""
    },
    {
        "text": "creating your own flavored creme brulees you can introduce things like",
        "extra_info": ""
    },
    {
        "text": "tea, you know, Bolero tea is beautiful, Earl Grey tea,",
        "extra_info": ""
    },
    {
        "text": "infusing that into the cream just as I did with the vanilla,",
        "extra_info": ""
    },
    {
        "text": "the world's your oyster, whatever you want.",
        "extra_info": ""
    },
    {
        "text": "Right, our brulee is ready to plate up, so pop over here.",
        "extra_info": ""
    },
    {
        "text": "I'm gonna actually, guys, show you something that's",
        "extra_info": ""
    },
    {
        "text": "a little bit old school, something that I did as an apprentice,",
        "extra_info": ""
    },
    {
        "text": "but I think they're quite cute and I reckon we might bring them back in 2010.",
        "extra_info": ""
    },
    {
        "text": "But they're called gondolas.",
        "extra_info": ""
    },
    {
        "text": "We line the service cloth with foil.",
        "extra_info": ""
    },
    {
        "text": "And the foil acts as a stability for this gondola.",
        "extra_info": ""
    },
    {
        "text": "We create an aeroplane.",
        "extra_info": ""
    },
    {
        "text": "And what's cool about these is you can use them when you do your canape functions,",
        "extra_info": ""
    },
    {
        "text": "to dress your plate up.",
        "extra_info": ""
    },
    {
        "text": "Fold in half again.",
        "extra_info": ""
    },
    {
        "text": "And then",
        "extra_info": ""
    },
    {
        "text": "we start turning it into",
        "extra_info": ""
    },
    {
        "text": "an escargot.",
        "extra_info": ""
    },
    {
        "text": "Like a little pastry snail.",
        "extra_info": ""
    },
    {
        "text": "Gary's gonna love this.",
        "extra_info": ""
    },
    {
        "text": "Our plate.",
        "extra_info": ""
    },
    {
        "text": "And then...",
        "extra_info": ""
    },
    {
        "text": "That's fantastic.",
        "extra_info": ""
    },
    {
        "text": "And there you have it. Creme brulee.",
        "extra_info": ""
    },
    {
        "text": "- Phillip, do you wanna come up and taste? - I'd love to.",
        "extra_info": ""
    },
    {
        "text": "Carrie, you're gonna have a taste as well, here.",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "Awesome.",
        "extra_info": ""
    },
    {
        "text": "Cheers.",
        "extra_info": ""
    },
    {
        "text": "Oh that's what it...",
        "extra_info": ""
    },
    {
        "text": "That's unreal.",
        "extra_info": ""
    },
    {
        "text": "That's good.",
        "extra_info": ""
    },
    {
        "text": "The flavor's really nice. I think ours was overly sweet,",
        "extra_info": ""
    },
    {
        "text": "but with this one it's not as sweet, you're getting more taste of actual vanilla itself,",
        "extra_info": ""
    },
    {
        "text": "and the caramel on top, it's a bit thicker, and it's got a more raw sugar taste.",
        "extra_info": ""
    },
    {
        "text": "Yeah, it's just as you want a creme brulee to be.",
        "extra_info": ""
    },
    {
        "text": "You just break through that initial caramelized sugar layer",
        "extra_info": ""
    },
    {
        "text": "and then you just get a creamy custard underneath.",
        "extra_info": ""
    },
    {
        "text": "But there's not a hint of egg.",
        "extra_info": ""
    },
    {
        "text": "It's just creamy, vanilla...",
        "extra_info": ""
    },
    {
        "text": "beautiful.",
        "extra_info": ""
    },
    {
        "text": "It's not too sweet, that's important. Desserts don't need to be sweet.",
        "extra_info": ""
    },
    {
        "text": "There's gotta be this neutral, sort of, just hint of sweetness,",
        "extra_info": ""
    },
    {
        "text": "not overly powerful, like condensed milk.",
        "extra_info": ""
    },
    {
        "text": "- And it's set, which is... - Yeah, I mean...",
        "extra_info": ""
    },
    {
        "text": "Phillip, thank you, you can take that with you.",
        "extra_info": ""
    },
    {
        "text": "Oh, beautiful.",
        "extra_info": ""
    },
    {
        "text": "- Carrie, thank you so much, man. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "- You made a creme brulee. - I know.",
        "extra_info": ""
    },
    {
        "text": "Yeah, man.",
        "extra_info": ""
    },
    {
        "text": "- George, what's the gondola? - Just for you, Gary.",
        "extra_info": ""
    },
    {
        "text": "I haven't seen one of those for 20 years.",
        "extra_info": ""
    },
    {
        "text": "There's a pleasure in that, isn't it?",
        "extra_info": ""
    },
    {
        "text": "Love a nice brulee.",
        "extra_info": ""
    },
    {
        "text": "Not hard, is it?",
        "extra_info": ""
    },
    {
        "text": "Georgie, that is delicious.",
        "extra_info": ""
    },
    {
        "text": "And Carrie made it.",
        "extra_info": ""
    },
    {
        "text": "It's not hard, is it? It's not hard.",
        "extra_info": ""
    },
    {
        "text": "So now you know there is no excuse from now on to do a perfect brulee",
        "extra_info": ""
    },
    {
        "text": "or even a perfect brulee in something else.",
        "extra_info": ""
    },
    {
        "text": "They're the future, everyone now are gonna do these at home.",
        "extra_info": ""
    },
    {
        "text": "2010, the year of the gondola.",
        "extra_info": ""
    },
    {
        "text": "So that's it for another week MasterClass, the joy of watching George and I cook",
        "extra_info": ""
    },
    {
        "text": "for a change, and of course setting you up for another week of success.",
        "extra_info": ""
    },
    {
        "text": "We're all hungry, so come forward, grab a dish.",
        "extra_info": ""
    },
    {
        "text": "We'll have a glass of wine.",
        "extra_info": ""
    },
    {
        "text": "Good timing.",
        "extra_info": ""
    },
    {
        "text": "Welcome back, guys.",
        "extra_info": ""
    },
    {
        "text": "Guys, I know you've had a massive week, a busy week, an amazing week.",
        "extra_info": ""
    },
    {
        "text": "Think about who you've worked with.",
        "extra_info": ""
    },
    {
        "text": "Industry luminaries, you take years to work with.",
        "extra_info": ""
    },
    {
        "text": "People like Tony Bilson, Michel Roux, Guillaume Brahimi, Tetsuya,",
        "extra_info": ""
    },
    {
        "text": "and Justin North. Let alone George and I.",
        "extra_info": ""
    },
    {
        "text": "Savor it. Make the most of it. Because these experiences don't come along too often.",
        "extra_info": ""
    },
    {
        "text": "And here in the MasterChef kitchen you get to experience all of that and more.",
        "extra_info": ""
    },
    {
        "text": "The thing you've got to remember, at the end of next week,",
        "extra_info": ""
    },
    {
        "text": "there'll only be sixteen people remaining in this competition.",
        "extra_info": ""
    },
    {
        "text": "I think something you guys need to not forget is",
        "extra_info": ""
    },
    {
        "text": "you're here because you want to change your life.",
        "extra_info": ""
    },
    {
        "text": "Focus. Stay strong.",
        "extra_info": ""
    },
    {
        "text": "The important thing is, keep motoring on, hopefully clinch victory.",
        "extra_info": ""
    },
    {
        "text": "- Cheers, everybody. - Cheers, guys.",
        "extra_info": ""
    },
    {
        "text": "To next week.",
        "extra_info": ""
    },
    {
        "text": "Next time on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "A new week means new surprises.",
        "extra_info": ""
    },
    {
        "text": "The eighteen remaining hopefuls kick off a big week with a mystery box.",
        "extra_info": ""
    },
    {
        "text": "I've got to do something good with this one.",
        "extra_info": ""
    },
    {
        "text": "- Then. - It smells like I'm at the cooking Olympics.",
        "extra_info": ""
    },
    {
        "text": "It's triple the action as the amateurs team up",
        "extra_info": ""
    },
    {
        "text": "for an international themed invention test.",
        "extra_info": ""
    },
    {
        "text": "- Yippee, let's go, Georgie. - Ole.",
        "extra_info": ""
    },
    {
        "text": "Which country's cuisine will reign supreme?",
        "extra_info": ""
    },
    {
        "text": "In our minds, we cannot lose.",
        "extra_info": ""
    },
    {
        "text": "At stake for the team with the least impressive dish,",
        "extra_info": ""
    },
    {
        "text": "elimination.",
        "extra_info": ""
    },
    {
        "text": "Problem with this dish is you haven't really done all that much.",
        "extra_info": ""
    },
    {
        "text": "I just feel gutted.",
        "extra_info": ""
    }
]