[
    {
        "text": "Last week on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "Now is the time to unleash.",
        "extra_info": ""
    },
    {
        "text": "Callum faced off against celebrity chef Philippa Sibley.",
        "extra_info": ""
    },
    {
        "text": "One of the best things I've ever done.",
        "extra_info": ""
    },
    {
        "text": "And the MasterChef journey ended for Kate and Adele.",
        "extra_info": ""
    },
    {
        "text": "I am proud with what I've done.",
        "extra_info": ""
    },
    {
        "text": "Tonight, 20 amateurs begin the week thinking outside the square.",
        "extra_info": ""
    },
    {
        "text": "What dark horrors lie inside the mystery box today?",
        "extra_info": ""
    },
    {
        "text": "Then, they face the invention test.",
        "extra_info": ""
    },
    {
        "text": "Come on, guys, chop, chop, let's go.",
        "extra_info": ""
    },
    {
        "text": "But, will the pressure prove too much for some?",
        "extra_info": ""
    },
    {
        "text": "It was like all eyes were on me for some weird reason.",
        "extra_info": ""
    },
    {
        "text": "I don't like it.",
        "extra_info": ""
    },
    {
        "text": "At stake for the winner, the chance to work alongside the country's greatest chefs,",
        "extra_info": ""
    },
    {
        "text": "a book-publishing deal,",
        "extra_info": ""
    },
    {
        "text": "one hundred thousand dollars to make their culinary dreams reality,",
        "extra_info": ""
    },
    {
        "text": "and the title of Australia's next MasterChef.",
        "extra_info": ""
    },
    {
        "text": "This morning we wake up, brand new week,",
        "extra_info": ""
    },
    {
        "text": "forget about the challenge, first things first, Courtney's 30th birthday.",
        "extra_info": ""
    },
    {
        "text": "Happy birthday to you...",
        "extra_info": ""
    },
    {
        "text": "Never in my wildest dreams would I have thought I'd be spending my 30th birthday",
        "extra_info": ""
    },
    {
        "text": "at the MasterChef house.",
        "extra_info": ""
    },
    {
        "text": "And turning 30, I guess it's a good point to say,",
        "extra_info": ""
    },
    {
        "text": "now's the time to move on with something new.",
        "extra_info": ""
    },
    {
        "text": "Welcome back to the MasterChef kitchen.",
        "extra_info": ""
    },
    {
        "text": "You're standing in front of a little box.",
        "extra_info": ""
    },
    {
        "text": "It is the Mystery Box.",
        "extra_info": ""
    },
    {
        "text": "It's easy to follow a recipe,",
        "extra_info": ""
    },
    {
        "text": "to reproduce a dish, but to create a dish from what's inside there,",
        "extra_info": ""
    },
    {
        "text": "that's the true test of a good cook.",
        "extra_info": ""
    },
    {
        "text": "Your dish needs to stand out. It needs to seduce us. Why?",
        "extra_info": ""
    },
    {
        "text": "Because we will only taste five dishes.",
        "extra_info": ""
    },
    {
        "text": "From those five dishes, we'll pick just one winner.",
        "extra_info": ""
    },
    {
        "text": "If you win the Mystery Box challenge, your prize will be to choose",
        "extra_info": ""
    },
    {
        "text": "the core ingredient that everyone will have to use",
        "extra_info": ""
    },
    {
        "text": "in the invention test later on today.",
        "extra_info": ""
    },
    {
        "text": "So, now, time to reveal what dark horrors lie inside the mystery box today.",
        "extra_info": ""
    },
    {
        "text": "Providing there aren't frog legs, snails or foie gras",
        "extra_info": ""
    },
    {
        "text": "in the mystery box, I'm gonna be a happy little chicken.",
        "extra_info": ""
    },
    {
        "text": "Lift your lids.",
        "extra_info": ""
    },
    {
        "text": "Nice.",
        "extra_info": ""
    },
    {
        "text": "Your brains must be running a million miles an hour,",
        "extra_info": ""
    },
    {
        "text": "trying to think of combinations.",
        "extra_info": ""
    },
    {
        "text": "What are you gonna cook? How are you gonna wow us?",
        "extra_info": ""
    },
    {
        "text": "Beautiful duck breast, raspberries. Pinot, lavender, fennel, dark chocolate.",
        "extra_info": ""
    },
    {
        "text": "Bacon and red cabbage.",
        "extra_info": ""
    },
    {
        "text": "And of course, underneath a little pantry of ingredients.",
        "extra_info": ""
    },
    {
        "text": "You don't have to use them all, the choice is yours.",
        "extra_info": ""
    },
    {
        "text": "So like fragrance of that lavender on the wing of that duck,",
        "extra_info": ""
    },
    {
        "text": "let your imagination take flight, and bring us a dish that will delight us,",
        "extra_info": ""
    },
    {
        "text": "and ignite our desire to see this as one of the five dishes we'll taste today.",
        "extra_info": ""
    },
    {
        "text": "You know, there's all these things churning in my mind,",
        "extra_info": ""
    },
    {
        "text": "you know, sweet, savory, sweet, savory, so...",
        "extra_info": ""
    },
    {
        "text": "there's a good mix of things to do sweet and savory.",
        "extra_info": ""
    },
    {
        "text": "Right, guys, you have 45 minutes to produce the most beautiful dish ever.",
        "extra_info": ""
    },
    {
        "text": "Your time starts",
        "extra_info": ""
    },
    {
        "text": "now.",
        "extra_info": ""
    },
    {
        "text": "As always, my force of habit is to keep it simple.",
        "extra_info": ""
    },
    {
        "text": "45 minutes doesn't leave me much margin of error.",
        "extra_info": ""
    },
    {
        "text": "So the dish I'm going to cook today is glazed duck on a bed of seasoned cabbage",
        "extra_info": ""
    },
    {
        "text": "with a raspberry sauce.",
        "extra_info": ""
    },
    {
        "text": "There's nowhere else I'd wanna be for my thirtieth,",
        "extra_info": ""
    },
    {
        "text": "and I'm really happy to be spending it here.",
        "extra_info": ""
    },
    {
        "text": "I decide to cook pancakes with raspberry cream",
        "extra_info": ""
    },
    {
        "text": "and a lavender praline.",
        "extra_info": ""
    },
    {
        "text": "When you say pancakes, they're not crepes, they're not thin...",
        "extra_info": ""
    },
    {
        "text": "- No. - They're gonna be that sort of American style.",
        "extra_info": ""
    },
    {
        "text": "I've separated the eggs and I've whisked the egg whites",
        "extra_info": ""
    },
    {
        "text": "to try to get them a little bit light and fluffy.",
        "extra_info": ""
    },
    {
        "text": "I look at that as a batter and I go, that looks absolutely perfect,",
        "extra_info": ""
    },
    {
        "text": "that will bubble up beautifully. Good luck, Courtney, hope it works well.",
        "extra_info": ""
    },
    {
        "text": "I really wanna cook dessert today.",
        "extra_info": ""
    },
    {
        "text": "Matthew. So what are you doing? What's the dish?",
        "extra_info": ""
    },
    {
        "text": "I am doing a lavender infused burnt English cream",
        "extra_info": ""
    },
    {
        "text": "and also in a eggshell. - These little eggshells, I love it!",
        "extra_info": ""
    },
    {
        "text": "I'm just gonna serve one in a little, in a glass with some macerated raspberries.",
        "extra_info": ""
    },
    {
        "text": "Serve it on the bottom, egg, sitting in the raspberries.",
        "extra_info": ""
    },
    {
        "text": "I'm looking forward to see that. I mean, it's important that that membrane comes in.",
        "extra_info": ""
    },
    {
        "text": "Wow, Matthew, get on with your custard.",
        "extra_info": ""
    },
    {
        "text": "Cheers.",
        "extra_info": ""
    },
    {
        "text": "Fiona, what are you cooking today?",
        "extra_info": ""
    },
    {
        "text": "Look, I'm just gonna go with my gut, which is telling me chocolate and raspberry,",
        "extra_info": ""
    },
    {
        "text": "so I'm making kind of like a chocolate ganache tart, but I'm actually gonna",
        "extra_info": ""
    },
    {
        "text": "do a lavender cream as well, and I think it will be yummy...",
        "extra_info": ""
    },
    {
        "text": "You have half an hour to go, I'm concerned if you're gonna have that",
        "extra_info": ""
    },
    {
        "text": "blind-baked in time. - No, it should be okay,",
        "extra_info": ""
    },
    {
        "text": "I'm testing a little one.",
        "extra_info": ""
    },
    {
        "text": "Sounds delicious, so you've picked a straight road,",
        "extra_info": ""
    },
    {
        "text": "but it's all gotta be perfect.",
        "extra_info": ""
    },
    {
        "text": "- Hello. - Skye.",
        "extra_info": ""
    },
    {
        "text": "Are you creating something beautiful for us today?",
        "extra_info": ""
    },
    {
        "text": "I think so. Basically I'm gonna do crispy duck with raspberries,",
        "extra_info": ""
    },
    {
        "text": "that will be marinated in a lovely red wine sauce.",
        "extra_info": ""
    },
    {
        "text": "And what are you doing in the pan? You're putting fennel fronds into the oil?",
        "extra_info": ""
    },
    {
        "text": "Yeah, just a little fennel fronds, I quite like that, I quite like fennel,",
        "extra_info": ""
    },
    {
        "text": "there's a little bit of flavor and also a little bit of texture in there, so,",
        "extra_info": ""
    },
    {
        "text": "that'll be quite nice on a salad. - Where did you pick this idea from?",
        "extra_info": ""
    },
    {
        "text": "- I just thought of it just now, so... - You're so creative, Skye.",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "- See you. - Goodbye.",
        "extra_info": ""
    },
    {
        "text": "Wow, first challenge of the week, mystery box, we've got a nice mixture",
        "extra_info": ""
    },
    {
        "text": "of sweet, you know, dessert, and savory.",
        "extra_info": ""
    },
    {
        "text": "And it smells lovely in here. Good start.",
        "extra_info": ""
    },
    {
        "text": "It's a great start to the week, I think there are some really beautiful dishes.",
        "extra_info": ""
    },
    {
        "text": "Matthew, he's done like egg custard in a shell.",
        "extra_info": ""
    },
    {
        "text": "If it will come out for him, I don't know,",
        "extra_info": ""
    },
    {
        "text": "he's taken the inside of the egg out, he's made a lovely sort of english",
        "extra_info": ""
    },
    {
        "text": "lavender custard, I think it's gorgeous, see how it comes out.",
        "extra_info": ""
    },
    {
        "text": "Gary, Claire's doing a really simple dish,",
        "extra_info": ""
    },
    {
        "text": "but hopefully dish that's going to taste amazing.",
        "extra_info": ""
    },
    {
        "text": "I think this plays into Claire's hand, she loves this type of food,",
        "extra_info": ""
    },
    {
        "text": "she loves to take a simple protein like duck and cook it really beautifully",
        "extra_info": ""
    },
    {
        "text": "and just pair it up with a number of ingredients",
        "extra_info": ""
    },
    {
        "text": "that to her just create a nice simple fresh dish.",
        "extra_info": ""
    },
    {
        "text": "What about Skye?",
        "extra_info": ""
    },
    {
        "text": "Yeah, look I like her ideas, you know, Skye's actually a good technician,",
        "extra_info": ""
    },
    {
        "text": "when it comes to cooking duck perfectly, I reckon she'll take it out in a breeze.",
        "extra_info": ""
    },
    {
        "text": "And she's fried off these little fennel fronds to boost the flavor.",
        "extra_info": ""
    },
    {
        "text": "I love that sort of stuff.",
        "extra_info": ""
    },
    {
        "text": "As always, time flies when you're having fun,",
        "extra_info": ""
    },
    {
        "text": "you have 15 minutes to go. - Go guys, chop chop, let's go.",
        "extra_info": ""
    },
    {
        "text": "Carrie.",
        "extra_info": ""
    },
    {
        "text": "- Hi, George. How you doing? - How are you going?",
        "extra_info": ""
    },
    {
        "text": "So doing a chocolate and raspberry souffle,",
        "extra_info": ""
    },
    {
        "text": "and I'm going to do a lavender cream to pour in the middle.",
        "extra_info": ""
    },
    {
        "text": "I love a nice souffle.",
        "extra_info": ""
    },
    {
        "text": "Very fussy though.",
        "extra_info": ""
    },
    {
        "text": "Very fussy souffle.",
        "extra_info": ""
    },
    {
        "text": "It's gotta be really soft in the middle, it's gotta have a kickass flavor of chocolate",
        "extra_info": ""
    },
    {
        "text": "and it needs to be punchy, sweet, hit all the right notes.",
        "extra_info": ""
    },
    {
        "text": "- So, fingers crossed. Thank you - Good luck, Carrie.",
        "extra_info": ""
    },
    {
        "text": "Don't underestimate the advantage of taking out the mystery box challenge.",
        "extra_info": ""
    },
    {
        "text": "It'll set you up for the win, and put the rest of them behind you.",
        "extra_info": ""
    },
    {
        "text": "You have five minutes to go.",
        "extra_info": ""
    },
    {
        "text": "That's right guys, five minutes to go, ding ding, first round, come on.",
        "extra_info": ""
    },
    {
        "text": "You're used to it by now, again we're down to the wire,",
        "extra_info": ""
    },
    {
        "text": "one minute to go.",
        "extra_info": ""
    },
    {
        "text": "- No fingerprints on the plates! - Come on.",
        "extra_info": ""
    },
    {
        "text": "You have 10 seconds to go.",
        "extra_info": ""
    },
    {
        "text": "5",
        "extra_info": ""
    },
    {
        "text": "4",
        "extra_info": ""
    },
    {
        "text": "3",
        "extra_info": ""
    },
    {
        "text": "2",
        "extra_info": ""
    },
    {
        "text": "1",
        "extra_info": ""
    },
    {
        "text": "That's it. Tools down. Step away from your benches.",
        "extra_info": ""
    },
    {
        "text": "You've just had 45 minutes to complete today's mystery box.",
        "extra_info": ""
    },
    {
        "text": "We're gonna taste the five dishes that we believe are the best.",
        "extra_info": ""
    },
    {
        "text": "When we call your name out, please come forward.",
        "extra_info": ""
    },
    {
        "text": "The first dish up to the tasting table belongs to",
        "extra_info": ""
    },
    {
        "text": "Matthew.",
        "extra_info": ""
    },
    {
        "text": "I'm really really happy with my dish, I feel that it looks amazing",
        "extra_info": ""
    },
    {
        "text": "and I just hope the judges think the same.",
        "extra_info": ""
    },
    {
        "text": "Burnt Lavender Creme Brulee with Macerated Raspberries.",
        "extra_info": ""
    },
    {
        "text": "Okay. Dirty glass.",
        "extra_info": ""
    },
    {
        "text": "Very dirty glass actually. Can I ask a question,",
        "extra_info": ""
    },
    {
        "text": "did you sterilize the egg? - I cleaned out the inside of it,",
        "extra_info": ""
    },
    {
        "text": "and washed out... - You didn't...",
        "extra_info": ""
    },
    {
        "text": "sterilize the outside? Cause an egg comes out of the chicken, doesn't it?",
        "extra_info": ""
    },
    {
        "text": "It does.",
        "extra_info": ""
    },
    {
        "text": "Let's try.",
        "extra_info": ""
    },
    {
        "text": "I get what you try to do. You try to make a brulee",
        "extra_info": ""
    },
    {
        "text": "without it actually going into the oven. What you've done there,",
        "extra_info": ""
    },
    {
        "text": "is not cooked for long enough or there's not enough eggs in there,",
        "extra_info": ""
    },
    {
        "text": "so it's not thick, it's soupy.",
        "extra_info": ""
    },
    {
        "text": "I wanna congratulate you on the flavor. It is runny, but it tastes really good.",
        "extra_info": ""
    },
    {
        "text": "I get lavender and it's beautiful. It's got a good balance of sweetness,",
        "extra_info": ""
    },
    {
        "text": "it's tasty. So well done mate, good stuff. - Thanks, George.",
        "extra_info": ""
    },
    {
        "text": "The reason why you're standing here is because that looks",
        "extra_info": ""
    },
    {
        "text": "magnificently outlandish. It's a mark of you, again, thinking about how you",
        "extra_info": ""
    },
    {
        "text": "plate the food and try to do something different, which has to be commended.",
        "extra_info": ""
    },
    {
        "text": "Thanks, Matt.",
        "extra_info": ""
    },
    {
        "text": "I put up what I felt was a great dish, I went out on a limb,",
        "extra_info": ""
    },
    {
        "text": "and I wanna do show them something different and excite them.",
        "extra_info": ""
    },
    {
        "text": "The next person's dish we'd like to taste",
        "extra_info": ""
    },
    {
        "text": "is Claire's.",
        "extra_info": ""
    },
    {
        "text": "- You sure? - Come on, Claire.",
        "extra_info": ""
    },
    {
        "text": "Not expecting, mind, be one of the dishes that's tasted today.",
        "extra_info": ""
    },
    {
        "text": "Definitely not expecting that at all.",
        "extra_info": ""
    },
    {
        "text": "Duck with Pickled Cabbage and Raspberry Syrup",
        "extra_info": ""
    },
    {
        "text": "It's one of the ducks in the room that's cooked almost perfectly.",
        "extra_info": ""
    },
    {
        "text": "You've rendered the fat beautifully, it's nice and pink on the inside,",
        "extra_info": ""
    },
    {
        "text": "put on a very simple pickled cabbage,",
        "extra_info": ""
    },
    {
        "text": "so you get this nice sort of sourness that breaks the fat in the duck,",
        "extra_info": ""
    },
    {
        "text": "and then you get that lovely sort of raspberry sweetness",
        "extra_info": ""
    },
    {
        "text": "in that syrup or vinaigrette on the outside,",
        "extra_info": ""
    },
    {
        "text": "so I think that's clever cooking. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "I can't believe it. I'm pinching myself, but I'm rapt.",
        "extra_info": ""
    },
    {
        "text": "The next dish that we'd like to taste",
        "extra_info": ""
    },
    {
        "text": "belongs to Skye.",
        "extra_info": ""
    },
    {
        "text": "I looked down at my dish and even if it was a mad scramble,",
        "extra_info": ""
    },
    {
        "text": "I'm definitely proud of the way it looks.",
        "extra_info": ""
    },
    {
        "text": "Crispy Duck with Red Wine and Raspberries",
        "extra_info": ""
    },
    {
        "text": "Rock and roll, Skye. Rock and roll.",
        "extra_info": ""
    },
    {
        "text": "It's delicious. I mean, perfectly cooked duck, a sauce that is gorgeous,",
        "extra_info": ""
    },
    {
        "text": "I think the sauce is just what brings it all together,",
        "extra_info": ""
    },
    {
        "text": "but what I love most is these fennel tops, they're crispy, they're flavorsome,",
        "extra_info": ""
    },
    {
        "text": "and they add some great flavor there.",
        "extra_info": ""
    },
    {
        "text": "A really clever dish, well done, Skye.",
        "extra_info": ""
    },
    {
        "text": "Thanks very much.",
        "extra_info": ""
    },
    {
        "text": "I get some fantastic comments, I mean, that feels really, really good.",
        "extra_info": ""
    },
    {
        "text": "Next person to face the judges is",
        "extra_info": ""
    },
    {
        "text": "Fiona.",
        "extra_info": ""
    },
    {
        "text": "I was nervous, I was really nervous, I felt, oh my god,",
        "extra_info": ""
    },
    {
        "text": "what if they find something wrong with it?",
        "extra_info": ""
    },
    {
        "text": "Chocolate Ganache Tart with Lavender Cream and Fresh Raspberries",
        "extra_info": ""
    },
    {
        "text": "This for me is the standout looking dessert.",
        "extra_info": ""
    },
    {
        "text": "Cause it looks immediately like you wanna dive straight in.",
        "extra_info": ""
    },
    {
        "text": "The shortness of the pastry, which has kind of shortbread crumbliness to it,",
        "extra_info": ""
    },
    {
        "text": "the intensity of that dark rich chocolate ganache",
        "extra_info": ""
    },
    {
        "text": "means it has to have some cream to loosen it up.",
        "extra_info": ""
    },
    {
        "text": "Tastes like butterflies just wandered across a lavender pinch and then",
        "extra_info": ""
    },
    {
        "text": "come across and wandered across the cream,",
        "extra_info": ""
    },
    {
        "text": "it's got a real wafts of lavender, which is beautiful.",
        "extra_info": ""
    },
    {
        "text": "Well done. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "Part of me was really hoping that I might win this.",
        "extra_info": ""
    },
    {
        "text": "Yeah that was a little bit of, you know, pat on the back, going on inside.",
        "extra_info": ""
    },
    {
        "text": "The last dish we'd like to taste belongs to Carrie.",
        "extra_info": ""
    },
    {
        "text": "Oh boy.",
        "extra_info": ""
    },
    {
        "text": "To be picked out of 20 dishes to be tasted today,",
        "extra_info": ""
    },
    {
        "text": "I feel really, really good. Really positive, really happy.",
        "extra_info": ""
    },
    {
        "text": "Chocolate and Raspberry Souffle with Lavender Cream",
        "extra_info": ""
    },
    {
        "text": "Right.",
        "extra_info": ""
    },
    {
        "text": "It's a really nice chocolate souffle. It's really light.",
        "extra_info": ""
    },
    {
        "text": "But what's really clever about this souffle is just the subtlety of that lavender cream.",
        "extra_info": ""
    },
    {
        "text": "And it does something extraordinary to that chocolate.",
        "extra_info": ""
    },
    {
        "text": "Just sort of lightens it and sweetens it up slightly.",
        "extra_info": ""
    },
    {
        "text": "So yeah, really good, and it's nice to see a big smile on your face. Well done.",
        "extra_info": ""
    },
    {
        "text": "Thanks, Gary.",
        "extra_info": ""
    },
    {
        "text": "To receive positive comments just made me feel so, so, so good.",
        "extra_info": ""
    },
    {
        "text": "Well we've tasted the five best dishes in the mystery box challenge.",
        "extra_info": ""
    },
    {
        "text": "In the end, we had to deliberate, and we deliberated over two dishes.",
        "extra_info": ""
    },
    {
        "text": "A sweet and a savory.",
        "extra_info": ""
    },
    {
        "text": "Those two dishes belonged to",
        "extra_info": ""
    },
    {
        "text": "Skye",
        "extra_info": ""
    },
    {
        "text": "and Fiona.",
        "extra_info": ""
    },
    {
        "text": "Fiona, that was lovely. Really, really nice.",
        "extra_info": ""
    },
    {
        "text": "And the chocolate ganache was absolutely smooth as silk.",
        "extra_info": ""
    },
    {
        "text": "Loads of cream, nothing wrong with that, is good for your waistline.",
        "extra_info": ""
    },
    {
        "text": "Skye, lovely tie-in of all those ingredients.",
        "extra_info": ""
    },
    {
        "text": "You cooked that duck absolutely perfectly.",
        "extra_info": ""
    },
    {
        "text": "Standout though, that tied all those things together, was that sauce.",
        "extra_info": ""
    },
    {
        "text": "Really nicely done. Fantastic job.",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "However, in the end, we can only pick one dish.",
        "extra_info": ""
    },
    {
        "text": "And the winner is...",
        "extra_info": ""
    },
    {
        "text": "The winner of today's Mystery Box challenge is",
        "extra_info": ""
    },
    {
        "text": "Skye.",
        "extra_info": ""
    },
    {
        "text": "I am absolutely blown away.",
        "extra_info": ""
    },
    {
        "text": "I mean, I just literally want to jump out of my seat to one of these.",
        "extra_info": ""
    },
    {
        "text": "Skye. Very rare in this kitchen with three pernickety people",
        "extra_info": ""
    },
    {
        "text": "Gary, George and myself are always looking what could be just a little bit better.",
        "extra_info": ""
    },
    {
        "text": "Negatives on your dish? None.",
        "extra_info": ""
    },
    {
        "text": "Yay!",
        "extra_info": ""
    },
    {
        "text": "Yes. Fantastic. Fantastic.",
        "extra_info": ""
    },
    {
        "text": "If you felt like you failed to impress in the mystery box challenge,",
        "extra_info": ""
    },
    {
        "text": "you'll get another chance in today's main challenge, which is the invention test.",
        "extra_info": ""
    },
    {
        "text": "If you win today's invention test, you get to cook off",
        "extra_info": ""
    },
    {
        "text": "against one of the country's top chefs",
        "extra_info": ""
    },
    {
        "text": "in the celebrity chef challenge later on this week.",
        "extra_info": ""
    },
    {
        "text": "If you win that, you win immunity.",
        "extra_info": ""
    },
    {
        "text": "Huge advantage, if you win, you get the coveted immunity,",
        "extra_info": ""
    },
    {
        "text": "which can save your backside in this competition.",
        "extra_info": ""
    },
    {
        "text": "We're looking for one winner.",
        "extra_info": ""
    },
    {
        "text": "But we're also looking for the three least impressive dishes of the day.",
        "extra_info": ""
    },
    {
        "text": "You know, you've got to perform in these things. End up in the bottom three,",
        "extra_info": ""
    },
    {
        "text": "and you'll face elimination and could be going home.",
        "extra_info": ""
    },
    {
        "text": "I bet you're itching to know what the theme is for today's invention test,",
        "extra_info": ""
    },
    {
        "text": "and it's an absolute doozy.",
        "extra_info": ""
    },
    {
        "text": "It's probably the fastest growing cuisine in Australia,",
        "extra_info": ""
    },
    {
        "text": "spices are central to this cuisine. The theme for today's invention test is",
        "extra_info": ""
    },
    {
        "text": "Indian.",
        "extra_info": ""
    },
    {
        "text": "No.",
        "extra_info": ""
    },
    {
        "text": "I was born in India. We grew up in a spice shop.",
        "extra_info": ""
    },
    {
        "text": "I'm excited that I've got the opportunity to show off my Indian talents.",
        "extra_info": ""
    },
    {
        "text": "Jimmy, we're expecting big things from you today.",
        "extra_info": ""
    },
    {
        "text": "This is an interesting challenge. We ask you to create a dish that evokes",
        "extra_info": ""
    },
    {
        "text": "the essence of India.",
        "extra_info": ""
    },
    {
        "text": "Of course what you need to know now is what the core ingredient is.",
        "extra_info": ""
    },
    {
        "text": "Skye, you've earned the right to pick the core ingredient from the pantry,",
        "extra_info": ""
    },
    {
        "text": "and reveal to the rest of the contestants what they have to cook with.",
        "extra_info": ""
    },
    {
        "text": "- You ready? - Absolutely.",
        "extra_info": ""
    },
    {
        "text": "Let's go into the pantry.",
        "extra_info": ""
    },
    {
        "text": "I'd love to see a core ingredient which was health-based,",
        "extra_info": ""
    },
    {
        "text": "or something that's really quirky, that noone else knows how to use.",
        "extra_info": ""
    },
    {
        "text": "Skye, you have three core ingredients to choose from.",
        "extra_info": ""
    },
    {
        "text": "And the first core ingredient is",
        "extra_info": ""
    },
    {
        "text": "chicken.",
        "extra_info": ""
    },
    {
        "text": "Okay.",
        "extra_info": ""
    },
    {
        "text": "Let's have a look at your second choice.",
        "extra_info": ""
    },
    {
        "text": "And it is",
        "extra_info": ""
    },
    {
        "text": "goat.",
        "extra_info": ""
    },
    {
        "text": "Oh, really? Wow.",
        "extra_info": ""
    },
    {
        "text": "The third choice is...",
        "extra_info": ""
    },
    {
        "text": "Be something good!",
        "extra_info": ""
    },
    {
        "text": "Pulses.",
        "extra_info": ""
    },
    {
        "text": "Chickpeas, yellow split peas, and two types of dal.",
        "extra_info": ""
    },
    {
        "text": "A black dal, and a white dal.",
        "extra_info": ""
    },
    {
        "text": "Skye, brain's ticking away, but you have to make a decision,",
        "extra_info": ""
    },
    {
        "text": "you've got three core ingredients to choose from,",
        "extra_info": ""
    },
    {
        "text": "chicken, the goat, and the pulses. Very, very crucial decision.",
        "extra_info": ""
    },
    {
        "text": "Skye, what's it going to be?",
        "extra_info": ""
    },
    {
        "text": "It's a really difficult decision for me, I'm looking at the goat,",
        "extra_info": ""
    },
    {
        "text": "I'm looking at the pulses, I'm looking at chicken.",
        "extra_info": ""
    },
    {
        "text": "I've gotta make a decision really quickly.",
        "extra_info": ""
    },
    {
        "text": "I was sure that it was something weird or vegetarian that she'd picked there, so",
        "extra_info": ""
    },
    {
        "text": "everyone was a bit nervous about what Skye might come out of that pantry with.",
        "extra_info": ""
    },
    {
        "text": "Skye, which three ingredients did you have to choose from?",
        "extra_info": ""
    },
    {
        "text": "I had to choose from chicken, and also pulses,",
        "extra_info": ""
    },
    {
        "text": "and also goat.",
        "extra_info": ""
    },
    {
        "text": "I'm fairly confident she's picked pulses, she's healthy person,",
        "extra_info": ""
    },
    {
        "text": "she's gonna go for something like that, I'd be very surprised if a meat is picked.",
        "extra_info": ""
    },
    {
        "text": "I've chosen",
        "extra_info": ""
    },
    {
        "text": "goat.",
        "extra_info": ""
    },
    {
        "text": "I would never pick that in a million years.",
        "extra_info": ""
    },
    {
        "text": "But maybe Skye's cooked goat in the past, I know Greek boys are gonna be at advantage,",
        "extra_info": ""
    },
    {
        "text": "cause Greeks love to eat goat.",
        "extra_info": ""
    },
    {
        "text": "Skye had leisurely five minutes in the pantry.",
        "extra_info": ""
    },
    {
        "text": "You, on the other hand, to choose your ten ingredients",
        "extra_info": ""
    },
    {
        "text": "have somewhat more frantic two minutes.",
        "extra_info": ""
    },
    {
        "text": "However, you'll be allowed an unlimited number of spices to choose.",
        "extra_info": ""
    },
    {
        "text": "Your two minutes start now.",
        "extra_info": ""
    },
    {
        "text": "I've never made a curry with just ten ingredients.",
        "extra_info": ""
    },
    {
        "text": "My signature dish had 45 in them.",
        "extra_info": ""
    },
    {
        "text": "I've got the curry in mind that I'm gonna make,",
        "extra_info": ""
    },
    {
        "text": "I need to get all the tomatoes, onions, ginger and the garlic.",
        "extra_info": ""
    },
    {
        "text": "That's it. Time's up guys. Out of the pantry, let's go.",
        "extra_info": ""
    },
    {
        "text": "Skye has picked goat as the core ingredient for all of you to cook with.",
        "extra_info": ""
    },
    {
        "text": "You've each been into the pantry and picked ten ingredients",
        "extra_info": ""
    },
    {
        "text": "and as many spices as you wanted to create a gorgeous Indian-inspired dish.",
        "extra_info": ""
    },
    {
        "text": "Your time starts now.",
        "extra_info": ""
    },
    {
        "text": "- This is the invention test. - Your time starts now.",
        "extra_info": ""
    },
    {
        "text": "We've got ninety minutes, to cook something with our core ingredient, goat.",
        "extra_info": ""
    },
    {
        "text": "The bottom three in the challenge will go into an elimination,",
        "extra_info": ""
    },
    {
        "text": "and the winner gets the opportunity to go against the celebrity chef",
        "extra_info": ""
    },
    {
        "text": "and hopefully win an immunity.",
        "extra_info": ""
    },
    {
        "text": "Everyone was probably expecting that I would choose pulses",
        "extra_info": ""
    },
    {
        "text": "for the key ingredient today, but I'm really excited about the goat,",
        "extra_info": ""
    },
    {
        "text": "I just hope I can pull it off. We'll see.",
        "extra_info": ""
    },
    {
        "text": "I've decided that I'm gonna make a dish called Goat looks at sweet cardamom curry.",
        "extra_info": ""
    },
    {
        "text": "It's using a goat loin, and then I'm combining that with a sweet cardamom curry.",
        "extra_info": ""
    },
    {
        "text": "- Jimmy. - George.",
        "extra_info": ""
    },
    {
        "text": "- What are you cooking for us? - It's a spicy goat curry,",
        "extra_info": ""
    },
    {
        "text": "what it is, it's got tomatoes, onions, it's got all sorts of spices,",
        "extra_info": ""
    },
    {
        "text": "I've got more spices under there, I've gotta take them out.",
        "extra_info": ""
    },
    {
        "text": "My dish is a Parsi goat curry. It's a goat curry cooked in a tomatoey based sauce,",
        "extra_info": ""
    },
    {
        "text": "but at the end you finish it off with fried paneer.",
        "extra_info": ""
    },
    {
        "text": "Paneer's an indian-styled cheese, it's like a cottage cheese, if you've gotta explain.",
        "extra_info": ""
    },
    {
        "text": "It's got a sort of consistency of haloumi, it's a bit squeaky.",
        "extra_info": ""
    },
    {
        "text": "Can I tell you, you're the one to beat, expectations are high.",
        "extra_info": ""
    },
    {
        "text": "I love a good curry. So far, every curry you've made, I've loved.",
        "extra_info": ""
    },
    {
        "text": "It was like all eyes were on me for some weird reason,",
        "extra_info": ""
    },
    {
        "text": "maybe because I was the only Indian in the room.",
        "extra_info": ""
    },
    {
        "text": "The dish that I've decided to make today is what I'd call a light goat curry",
        "extra_info": ""
    },
    {
        "text": "with three-flavored frozen yoghurt and some papadam praline.",
        "extra_info": ""
    },
    {
        "text": "You know, I think there's two parts to this challenge,",
        "extra_info": ""
    },
    {
        "text": "one is the Indian part and the other part is the invention, and I think",
        "extra_info": ""
    },
    {
        "text": "invention's pretty important. If I'm just making a curry, it's not very inventive.",
        "extra_info": ""
    },
    {
        "text": "Indians been making them for years, so, gotta invent something,",
        "extra_info": ""
    },
    {
        "text": "and this will be three different flavors of yoghurt with a praline",
        "extra_info": ""
    },
    {
        "text": "for some crunch.",
        "extra_info": ""
    },
    {
        "text": "Today I've decided to make a palak goat.",
        "extra_info": ""
    },
    {
        "text": "I need to blanch the spinach and then blend it.",
        "extra_info": ""
    },
    {
        "text": "Indian is not my thing, of course.",
        "extra_info": ""
    },
    {
        "text": "- Courtney. - George, Gary.",
        "extra_info": ""
    },
    {
        "text": "- Bread? - Naan. Naan bread. Yes.",
        "extra_info": ""
    },
    {
        "text": "Naan bread. Wow.",
        "extra_info": ""
    },
    {
        "text": "What are you cooking for us?",
        "extra_info": ""
    },
    {
        "text": "I'm making a goat salad. Mix up some spices with",
        "extra_info": ""
    },
    {
        "text": "some fried eggplant and some yoghurt and dress the goat in that, fry it off",
        "extra_info": ""
    },
    {
        "text": "I may do little hors d'oeuvres on the naan bread with some sliced goat",
        "extra_info": ""
    },
    {
        "text": "and the yoghurt dressing on top.",
        "extra_info": ""
    },
    {
        "text": "- Good luck. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "I'm going to try and cook a lamb curry, and I'm gonna treat it like lamb.",
        "extra_info": ""
    },
    {
        "text": "I've cooked a few lamb curries before, so I'm hoping that goat and lamb",
        "extra_info": ""
    },
    {
        "text": "are interchangeable.",
        "extra_info": ""
    },
    {
        "text": "So who do you like in the room?",
        "extra_info": ""
    },
    {
        "text": "I abso... I mean, look, Jimmy is the master, I'm excited to taste his.",
        "extra_info": ""
    },
    {
        "text": "The guy I like, George, is Jonathan, he's putting some thought into it,",
        "extra_info": ""
    },
    {
        "text": "he's actually making a sorbet, or an ice cream, out of the yoghurt.",
        "extra_info": ""
    },
    {
        "text": "What do you think of that? - Love it. Absolutely love it.",
        "extra_info": ""
    },
    {
        "text": "And he's thinking about textures. He's thinking about hot, cold,",
        "extra_info": ""
    },
    {
        "text": "and that is really thoughtful. - So he's got hot curry,",
        "extra_info": ""
    },
    {
        "text": "and cooling yoghurt sorbet, sounds absolutely delicious.",
        "extra_info": ""
    },
    {
        "text": "Half an hour down, and one hour to go.",
        "extra_info": ""
    },
    {
        "text": "Come on, guys.",
        "extra_info": ""
    },
    {
        "text": "Callum, tell us what you're cooking.",
        "extra_info": ""
    },
    {
        "text": "I'm just doing a goat curry with saffron rice and raita,",
        "extra_info": ""
    },
    {
        "text": "but I'm gonna try and make it really,",
        "extra_info": ""
    },
    {
        "text": "sort of fusion with modern Australian in the way I present it,",
        "extra_info": ""
    },
    {
        "text": "I'm not gonna present it as usual.",
        "extra_info": ""
    },
    {
        "text": "What does that mean? Tell me what.",
        "extra_info": ""
    },
    {
        "text": "So I'm envisioning it with rice having like little mounds of rice",
        "extra_info": ""
    },
    {
        "text": "and little mounds of the raita, and sort of just",
        "extra_info": ""
    },
    {
        "text": "leaving a lot of sauce behind and just having little piles of the goat",
        "extra_info": ""
    },
    {
        "text": "and plate with some herbs. - Sounds very styled, doesn't it?",
        "extra_info": ""
    },
    {
        "text": "Yeah. You know what, just be careful. It's all very well being styled,",
        "extra_info": ""
    },
    {
        "text": "but you don't go back to restaurants for stylish food,",
        "extra_info": ""
    },
    {
        "text": "you go back for tasty food.",
        "extra_info": ""
    },
    {
        "text": "If there's ever time to spice things up in the MasterChef kitchen,",
        "extra_info": ""
    },
    {
        "text": "it's now. You have 45 minutes to go.",
        "extra_info": ""
    },
    {
        "text": "Come on, guys, you need to be cooking like a Bollywood dancer. Let's go.",
        "extra_info": ""
    },
    {
        "text": "Dominic. How are you going?",
        "extra_info": ""
    },
    {
        "text": "- Not too bad. - What are you cooking?",
        "extra_info": ""
    },
    {
        "text": "It's a madras-y style sort of curry, a lot of dry ingredients to begin with.",
        "extra_info": ""
    },
    {
        "text": "- Have you made it before? - Yeah I have. Not with goat though.",
        "extra_info": ""
    },
    {
        "text": "There's thirty minutes to go. And I'm gonna put a dish up,",
        "extra_info": ""
    },
    {
        "text": "I taste the goat, and... it's chewy.",
        "extra_info": ""
    },
    {
        "text": "So I'm worried it's not gonna break down in the next half an hour,",
        "extra_info": ""
    },
    {
        "text": "so I'm not sure if the dish is gonna be any good or not.",
        "extra_info": ""
    },
    {
        "text": "I think I should finish in time but after Gary and George have spoken to me",
        "extra_info": ""
    },
    {
        "text": "I'm now a bit nervous, because the way I want to present the dish they weren't",
        "extra_info": ""
    },
    {
        "text": "overly happy about.",
        "extra_info": ""
    },
    {
        "text": "But I think I still have to because otherwise it's just going to be",
        "extra_info": ""
    },
    {
        "text": "a really basic curry.",
        "extra_info": ""
    },
    {
        "text": "A little bit frantic, I've got a few things ready, I'm about to start plating them up,",
        "extra_info": ""
    },
    {
        "text": "just gonna put in extra naan bread in, just as the judges wanna try something",
        "extra_info": ""
    },
    {
        "text": "as they're coming around.",
        "extra_info": ""
    },
    {
        "text": "Spice girls and spice boys, it's now curry in a hurry,",
        "extra_info": ""
    },
    {
        "text": "you've got 15 minutes to go.",
        "extra_info": ""
    },
    {
        "text": "I'm thinking, well, at this point I've got a dish,",
        "extra_info": ""
    },
    {
        "text": "there's not much to the dish,",
        "extra_info": ""
    },
    {
        "text": "but I'll have something plated up for the judges at least.",
        "extra_info": ""
    },
    {
        "text": "I definitely had an advantage coming into today's invention test,",
        "extra_info": ""
    },
    {
        "text": "but also a lot of added pressure, ten minutes to go,",
        "extra_info": ""
    },
    {
        "text": "and I am out of control. The bench is an absolute mess and",
        "extra_info": ""
    },
    {
        "text": "I'm feeling really, really embarrassed at this point that there's a possiblity",
        "extra_info": ""
    },
    {
        "text": "that I might not even get the dish completed.",
        "extra_info": ""
    },
    {
        "text": "Now's the time to twist the throttle on the world's fastest Indian,",
        "extra_info": ""
    },
    {
        "text": "you have five minutes to go.",
        "extra_info": ""
    },
    {
        "text": "Come on, guys, let's go.",
        "extra_info": ""
    },
    {
        "text": "At this point I'm actually feeling great, I've tasted my curry,",
        "extra_info": ""
    },
    {
        "text": "it tastes fantastic.",
        "extra_info": ""
    },
    {
        "text": "My only concern at this stage is whether the goat's soft enough.",
        "extra_info": ""
    },
    {
        "text": "You're down to the wire, you have thirty seconds.",
        "extra_info": ""
    },
    {
        "text": "Final touches, come on, guys.",
        "extra_info": ""
    },
    {
        "text": "You have five seconds.",
        "extra_info": ""
    },
    {
        "text": "4",
        "extra_info": ""
    },
    {
        "text": "3",
        "extra_info": ""
    },
    {
        "text": "2",
        "extra_info": ""
    },
    {
        "text": "1",
        "extra_info": ""
    },
    {
        "text": "That's it, tools down, step away from the benches.",
        "extra_info": ""
    },
    {
        "text": "You've all just completed an Indian-themed invention test.",
        "extra_info": ""
    },
    {
        "text": "Using the core ingredient of goat.",
        "extra_info": ""
    },
    {
        "text": "Right, now it's time to taste.",
        "extra_info": ""
    },
    {
        "text": "And for the main event of the evening, Jimmy.",
        "extra_info": ""
    },
    {
        "text": "From Bombay. Come on, big boy. Get down here.",
        "extra_info": ""
    },
    {
        "text": "We're excited, come on.",
        "extra_info": ""
    },
    {
        "text": "It all comes down to this. Just these three guys,",
        "extra_info": ""
    },
    {
        "text": "and they've got that look in the eye. They wanna hammer me on this.",
        "extra_info": ""
    },
    {
        "text": "So I'm hoping, this is one of the best goat curries I've ever made.",
        "extra_info": ""
    },
    {
        "text": "Balti Parsi Curry with Crispy Paneer and Parata.",
        "extra_info": ""
    },
    {
        "text": "I've cooked a Balti curry. I've made it slightly Parsi style",
        "extra_info": ""
    },
    {
        "text": "so richened it up by bringing some fried paneer in there, which is an Indian cheese.",
        "extra_info": ""
    },
    {
        "text": "- What's this one? - That's pan-fried goat.",
        "extra_info": ""
    },
    {
        "text": "Look, Jimmy, for me this is like an overcooked",
        "extra_info": ""
    },
    {
        "text": "piece of meat with a bit of spice on the outside, you know, a bit of a mistake.",
        "extra_info": ""
    },
    {
        "text": "I don't like it, it's dry and...",
        "extra_info": ""
    },
    {
        "text": "But this, on the other hand, this is absolutely gorgeous, love it.",
        "extra_info": ""
    },
    {
        "text": "Really, really exceptional.",
        "extra_info": ""
    },
    {
        "text": "It's great. Really, really good.",
        "extra_info": ""
    },
    {
        "text": "A real harmonious balance of spices, I love the paneer, reminds me of haloumi,",
        "extra_info": ""
    },
    {
        "text": "it's got that sort of squeakiness, and I think it's great addition.",
        "extra_info": ""
    },
    {
        "text": "- Exceptional. Well done, Jimmy. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "My concern is you may well have put the best curry in front of us.",
        "extra_info": ""
    },
    {
        "text": "Your chance of winning this challenge was stymied by that goat on this plate.",
        "extra_info": ""
    },
    {
        "text": "Thank you, Jimmy.",
        "extra_info": ""
    },
    {
        "text": "Walking back, the sense of relief is there, they've tasted my food,",
        "extra_info": ""
    },
    {
        "text": "they've given it some great comments,",
        "extra_info": ""
    },
    {
        "text": "I'm just not confident it's gonna be the one that wins it.",
        "extra_info": ""
    },
    {
        "text": "The person whose dish we'd like to taste next",
        "extra_info": ""
    },
    {
        "text": "is Joanne.",
        "extra_info": ""
    },
    {
        "text": "Palak Goat.",
        "extra_info": ""
    },
    {
        "text": "Palak is spinach that is blended with a few spices and ginger, garlic and chilli.",
        "extra_info": ""
    },
    {
        "text": "I'm sorry.",
        "extra_info": ""
    },
    {
        "text": "The meat is chewy. It's mounted with loads of spinach puree.",
        "extra_info": ""
    },
    {
        "text": "It's not a great dish. It's not one of your best, Joanne.",
        "extra_info": ""
    },
    {
        "text": "I know I'm going into the bottom three.",
        "extra_info": ""
    },
    {
        "text": "It's obvious.",
        "extra_info": ""
    },
    {
        "text": "Callum.",
        "extra_info": ""
    },
    {
        "text": "Goat Curry with Saffron Rice and Raita",
        "extra_info": ""
    },
    {
        "text": "I'm not that excited about eating that, I must be honest.",
        "extra_info": ""
    },
    {
        "text": "So without...",
        "extra_info": ""
    },
    {
        "text": "decimating your dish and telling you that I really don't like it",
        "extra_info": ""
    },
    {
        "text": "in all these little bits and pieces.",
        "extra_info": ""
    },
    {
        "text": "I don't like it.",
        "extra_info": ""
    },
    {
        "text": "Okay.",
        "extra_info": ""
    },
    {
        "text": "I'm relatively certain that I'm gonna be in the bottom three today.",
        "extra_info": ""
    },
    {
        "text": "Next up is Jonathan.",
        "extra_info": ""
    },
    {
        "text": "I've decided I'm gonna think positive,",
        "extra_info": ""
    },
    {
        "text": "talk positive, and hopefully get positive remarks.",
        "extra_info": ""
    },
    {
        "text": "That's all I'm thinking when I go up to the judges.",
        "extra_info": ""
    },
    {
        "text": "Spicy Red Goat Curry with Indian Spicy Frozen Yoghurt",
        "extra_info": ""
    },
    {
        "text": "That is a dead-set ripper dish. The heart of it is this beautiful",
        "extra_info": ""
    },
    {
        "text": "west coast Mangalorean curry that's got loads of acidity,",
        "extra_info": ""
    },
    {
        "text": "loads of curry leaf, the goat.",
        "extra_info": ""
    },
    {
        "text": "And then, those little",
        "extra_info": ""
    },
    {
        "text": "bitter",
        "extra_info": ""
    },
    {
        "text": "praline moments.",
        "extra_info": ""
    },
    {
        "text": "And that smooth, slightly icy yoghurt ice. Fantastic.",
        "extra_info": ""
    },
    {
        "text": "Great dish, great idea, that, Jonathan, is a potential winner.",
        "extra_info": ""
    },
    {
        "text": "- Well done. - Thanks.",
        "extra_info": ""
    },
    {
        "text": "I'm stoked with the comments. Almost buzzing, you know.",
        "extra_info": ""
    },
    {
        "text": "Win or lose, I'm happy in this challenge.",
        "extra_info": ""
    },
    {
        "text": "Well done, Jonathan.",
        "extra_info": ""
    },
    {
        "text": "It's fantastic.",
        "extra_info": ""
    },
    {
        "text": "The next person we'd like to call up is the only father in the room,",
        "extra_info": ""
    },
    {
        "text": "PapaDom.",
        "extra_info": ""
    },
    {
        "text": "I'm certain at this stage my curry is gonna be really nice.",
        "extra_info": ""
    },
    {
        "text": "I'm actually feeling pretty confident.",
        "extra_info": ""
    },
    {
        "text": "Goat Curry Madras Style with Rice",
        "extra_info": ""
    },
    {
        "text": "That is a very heavily spiced curry",
        "extra_info": ""
    },
    {
        "text": "and it's raw.",
        "extra_info": ""
    },
    {
        "text": "It's got no subtlety, and even though with a vindaloo you're expecting a good",
        "extra_info": ""
    },
    {
        "text": "wallop of chilli, I actually don't get that wallop of chilli.",
        "extra_info": ""
    },
    {
        "text": "So you haven't hit the mark there, you really haven't,",
        "extra_info": ""
    },
    {
        "text": "it's not a good recipe.",
        "extra_info": ""
    },
    {
        "text": "The tasting and their reaction was just out of blue like a smack in the face.",
        "extra_info": ""
    },
    {
        "text": "Next up is Matthew.",
        "extra_info": ""
    },
    {
        "text": "I just wanted to run away, I didn't want my dish tasted.",
        "extra_info": ""
    },
    {
        "text": "Goat Curry with Saffron Rice",
        "extra_info": ""
    },
    {
        "text": "Looks terrible.",
        "extra_info": ""
    },
    {
        "text": "A huge amount of chilli, huge amount of saffron,",
        "extra_info": ""
    },
    {
        "text": "it's just, there's no love. Absolutely no love, and I'm disappointed in you,",
        "extra_info": ""
    },
    {
        "text": "cause I know you're better than that, and I know you're a great cook.",
        "extra_info": ""
    },
    {
        "text": "You just need to start thinking about how you're gonna translate your passion",
        "extra_info": ""
    },
    {
        "text": "into whatever genre it is. Yeah?",
        "extra_info": ""
    },
    {
        "text": "This curry has just pulled the wind out of my sails",
        "extra_info": ""
    },
    {
        "text": "and I'm worried that I could be going home.",
        "extra_info": ""
    },
    {
        "text": "Next up to the tasting table is Courtney.",
        "extra_info": ""
    },
    {
        "text": "Naan Bread and Spicy Goat Salad with Yoghurt Dressing and Mango Kulfi",
        "extra_info": ""
    },
    {
        "text": "A slightly creamy eggplant and beautifully, beautifully, beautifully cooked goat.",
        "extra_info": ""
    },
    {
        "text": "Big tick for the kulfi, big tick for your indian souvlaki,",
        "extra_info": ""
    },
    {
        "text": "big tick all around, happy birthday.",
        "extra_info": ""
    },
    {
        "text": "Thank you.",
        "extra_info": ""
    },
    {
        "text": "I mean it's always nice to hear positive comments",
        "extra_info": ""
    },
    {
        "text": "and it's nice timing on my birthday.",
        "extra_info": ""
    },
    {
        "text": "Please bring your dish up, Skye.",
        "extra_info": ""
    },
    {
        "text": "Although I had an advantage of choosing the core ingredient today,",
        "extra_info": ""
    },
    {
        "text": "I'll just be happy to get a pass.",
        "extra_info": ""
    },
    {
        "text": "Goat Looks at Cardamom Curry",
        "extra_info": ""
    },
    {
        "text": "What I really love is the fragrance",
        "extra_info": ""
    },
    {
        "text": "that comes out of these curry leaves when you fry them.",
        "extra_info": ""
    },
    {
        "text": "I love the tomatoes, they've got this real sort of sweetness to it,",
        "extra_info": ""
    },
    {
        "text": "and that little paste on top is sweet. Good job.",
        "extra_info": ""
    },
    {
        "text": "I'm partially relieved because I haven't been absolutely slaughtered,",
        "extra_info": ""
    },
    {
        "text": "I'm also a little bit disappointed in myself because I feel that I could have",
        "extra_info": ""
    },
    {
        "text": "performed better today.",
        "extra_info": ""
    },
    {
        "text": "Thanks, Petey.",
        "extra_info": ""
    },
    {
        "text": "Well, we've tasted all of your Indian-inspired dishes.",
        "extra_info": ""
    },
    {
        "text": "We've made a decision.",
        "extra_info": ""
    },
    {
        "text": "We've picked a winner, and of course the three least impressive dishes of the day.",
        "extra_info": ""
    },
    {
        "text": "If you're one of those unlucky three there is a very real chance",
        "extra_info": ""
    },
    {
        "text": "that you're gonna go home.",
        "extra_info": ""
    },
    {
        "text": "Of course the winner",
        "extra_info": ""
    },
    {
        "text": "as you all know, will get the opportunity to cook off",
        "extra_info": ""
    },
    {
        "text": "against one of  Australia's finest chefs.",
        "extra_info": ""
    },
    {
        "text": "If you win that, you get immunity.",
        "extra_info": ""
    },
    {
        "text": "An immunity that could save you in this competition.",
        "extra_info": ""
    },
    {
        "text": "Extremely hard decision to make.",
        "extra_info": ""
    },
    {
        "text": "If I call your name, please step forward.",
        "extra_info": ""
    },
    {
        "text": "Well, we've tasted all of your Indian-inspired dishes.",
        "extra_info": ""
    },
    {
        "text": "If I call your name, please step forward.",
        "extra_info": ""
    },
    {
        "text": "If I'm not called up, I will be very disappointed with myself.",
        "extra_info": ""
    },
    {
        "text": "Jonathan.",
        "extra_info": ""
    },
    {
        "text": "Courtney.",
        "extra_info": ""
    },
    {
        "text": "Jonathan, Courtney, you cooked the two best dishes of today.",
        "extra_info": ""
    },
    {
        "text": "Really happy, and there's so much pressure relieved",
        "extra_info": ""
    },
    {
        "text": "that they've actually liked what I've come up with.",
        "extra_info": ""
    },
    {
        "text": "Look at those two offerings you've put up.",
        "extra_info": ""
    },
    {
        "text": "At different ends of the scale. Jonathan, that wonderful technical",
        "extra_info": ""
    },
    {
        "text": "intelligent technique-driven dish that tasted delicious.",
        "extra_info": ""
    },
    {
        "text": "Courtney, two dead-set delicious, lick the bowl, come back for more,",
        "extra_info": ""
    },
    {
        "text": "demand a second serve, thank you very much indeed.",
        "extra_info": ""
    },
    {
        "text": "All round great dish.",
        "extra_info": ""
    },
    {
        "text": "Sadly, there can only be one winner.",
        "extra_info": ""
    },
    {
        "text": "The winner",
        "extra_info": ""
    },
    {
        "text": "is Jonathan.",
        "extra_info": ""
    },
    {
        "text": "First thing that came to mind, wow, I'm gonna go against the celebrity chef.",
        "extra_info": ""
    },
    {
        "text": "This is gonna be awesome.",
        "extra_info": ""
    },
    {
        "text": "Jonathan.",
        "extra_info": ""
    },
    {
        "text": "A magnificent win, and you prove that you do have the ability, the knowedge,",
        "extra_info": ""
    },
    {
        "text": "and the skill not only to win an invention test,",
        "extra_info": ""
    },
    {
        "text": "but also potentially to win this competition.",
        "extra_info": ""
    },
    {
        "text": "Courtney, I'm sorry we couldn't give you the birthday present",
        "extra_info": ""
    },
    {
        "text": "we would have loved to give you.",
        "extra_info": ""
    },
    {
        "text": "A big applause for you, not for the thirtieth year,",
        "extra_info": ""
    },
    {
        "text": "but for those two dishes. Well done. - Thank you.",
        "extra_info": ""
    },
    {
        "text": "Thanks mate. Cheers.",
        "extra_info": ""
    },
    {
        "text": "With the roses also come the thorns. We also have to name",
        "extra_info": ""
    },
    {
        "text": "the three contestants who've cooked the least impressive dishes today.",
        "extra_info": ""
    },
    {
        "text": "Dom.",
        "extra_info": ""
    },
    {
        "text": "I accepted that I was in the bottom three.",
        "extra_info": ""
    },
    {
        "text": "It's a pure ripper. I certainly deserved to be there.",
        "extra_info": ""
    },
    {
        "text": "I was just sitting there starting already to try and steel myself",
        "extra_info": ""
    },
    {
        "text": "for whatever was gonna come.",
        "extra_info": ""
    },
    {
        "text": "Joanne.",
        "extra_info": ""
    },
    {
        "text": "I'm not surprised.",
        "extra_info": ""
    },
    {
        "text": "I deserved to be there.",
        "extra_info": ""
    },
    {
        "text": "Matthew.",
        "extra_info": ""
    },
    {
        "text": "Noone wants to be in an elimination challenge,",
        "extra_info": ""
    },
    {
        "text": "because it means that there's a chance that I'll be going home tomorrow.",
        "extra_info": ""
    },
    {
        "text": "Callum.",
        "extra_info": ""
    },
    {
        "text": "Hair's breadth today.",
        "extra_info": ""
    },
    {
        "text": "You're a good cook, but you're not that good a cook.",
        "extra_info": ""
    },
    {
        "text": "Callum, and the rest of you, you're safe, you can go home.",
        "extra_info": ""
    },
    {
        "text": "I'm really happy to be walking out of the MasterChef kitchen as a winner.",
        "extra_info": ""
    },
    {
        "text": "But at the same time, I'm upset to be leaving Dom, Joanne and Matthew.",
        "extra_info": ""
    },
    {
        "text": "Matt's my roommate so I'm really upset that he's here.",
        "extra_info": ""
    },
    {
        "text": "Dominic, Joanne, Matthew.",
        "extra_info": ""
    },
    {
        "text": "There are very clear reasons why we've picked you as our bottom performers.",
        "extra_info": ""
    },
    {
        "text": "Dominic, raw spices, heavy-handed, not really the vindaloo that we're expecting.",
        "extra_info": ""
    },
    {
        "text": "- Joanne. I think you know. - Of course I do.",
        "extra_info": ""
    },
    {
        "text": "No real blend of flavors, which went to spinach, the spices just didn't make sense.",
        "extra_info": ""
    },
    {
        "text": "And Matthew. Gee. It looked awful.",
        "extra_info": ""
    },
    {
        "text": "Grey. - Terrible.",
        "extra_info": ""
    },
    {
        "text": "Terrible.",
        "extra_info": ""
    },
    {
        "text": "So tomorrow, see you here for the pressure test.",
        "extra_info": ""
    },
    {
        "text": "Dominic, Joanne, Matthew, go home, rest up, and get ready. Thank you.",
        "extra_info": ""
    },
    {
        "text": "Thank you. Thank you. Good night.",
        "extra_info": ""
    },
    {
        "text": "I'm not used to being in such a powerless position.",
        "extra_info": ""
    },
    {
        "text": "One of us is going home and it's going to be really, really tough.",
        "extra_info": ""
    },
    {
        "text": "I'm feeling quite drained. I just wanna get home, sleep,",
        "extra_info": ""
    },
    {
        "text": "so that tomorrow I can come back and fire on all cylinders.",
        "extra_info": ""
    },
    {
        "text": "Tomorrow night on MasterChef Australia.",
        "extra_info": ""
    },
    {
        "text": "This is it. This is your last chance.",
        "extra_info": ""
    },
    {
        "text": "Matthew, Dominic and Joanne face off in the pressure test.",
        "extra_info": ""
    },
    {
        "text": "I'm in a bit of trouble.",
        "extra_info": ""
    },
    {
        "text": "It's a race against the clock to keep their dream alive.",
        "extra_info": ""
    },
    {
        "text": "I've got so much to do.",
        "extra_info": ""
    },
    {
        "text": "And to recreate the best black forest cake.",
        "extra_info": ""
    },
    {
        "text": "This cake not only has to taste beautiful but has to look gorgeous.",
        "extra_info": ""
    },
    {
        "text": "The reality is that one of us will be going home today.",
        "extra_info": ""
    }
]