[
    {
        "Place_Reviews": "Adina Apartment Hotel Adelaide Treasury: First time staying at the Adina apartments and I say I definitely recommend. The rooms were excellent, comfortable, balcony overlooking a courtyard.  Explored and found an indoor pool and gym with  equipment in good condition. Even had a Cafe for  breakfast which I recommend. All for. Good price, Adina will be high on the list to go back My partner and I spent our wedding night at this hotel on a Saturday, and it was an incredibly disappointing experience. After a long day, we finally made it to our room only to find it freezing cold. We tried to turn on the heater, but it didn't work at all throughout the night. This was quite unexpected for a new hotel. I went to the bar and the area out the back. Very nice atmosphere and great service. Pricing on par with other places in town. Was extremely convenient as we went to a concert next door in the Town Hall afterwards. Very convenient location. ~5min walk to the Central Market and ~10min walk to Rundle Mall. One of the free city buses stop is just around the corner and near the tram line. So quiet inside our room.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Terrace Hotel Adelaide: Convenient location. Friendly helpful staff. I needed a safe parking space for my hiace Commuter and they were brilliant with my needs. Fantastic balcony room with everything I needed. Even a bath. Affordable and just what I needed. I'll be back. Nice friendly staff and service, no wait when I was checking in or out. I stayed for a whole weekend it was beautiful only problem I had was a burnt mark on the carpet in the room, a decent size rip in the curtain and the cupboard had the side coming off if you were too look properly. Ive stayed here many times over the past decade. Reception was very welcoming and helpful. Room was lovely and the beds were wonderful.  Great place to stay and great location. Stayed in executive suite, slightly outdated.  Spa was lovely, room and bed was spacious and comfortable,  view of the sunrise from the balcony was gorgeous.  Loved the option to gain a $10 restaurant credit for every day that the room was not made up.   Kitchen was lacking, very spacious but no toaster,  no bowls, limited tea, coffee and milk (only enough for one day and we stayed 3).  Staff were friendly. Buffet breakfast was a lovely treat and attentive and helpful staff.   Not happy about having to pay extra $15 per day for parking.  Location was great for exploring Adelaide for the first time!  Not the best value for money that I've ever spent but I still had a lovely restful and fun holiday. Fantastic location right across from park and near tram stop. The bus to Handorf around the corner. Front desk team were very helpful with directions extra items for room anything we needed. We had a king room balcony which was clean and tidy. The buffet breakfast such a great start to the day. Great Japanese buffet nearby. Thanks for making our Adelaide holiday an awesome time!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Stamford Plaza Adelaide: Our stay here was awesome. Lovely clean room, very spacious, bed was so comfortable.  Modern bathroom with everything you need.  We had the buffet breakfast and was well worth the money.  Staff are so helpful and friendly. Would definitely stay here again and would recommend it to everyone Nice experience. Views from the west side towards the Port over parliament house. Complementary bottle of Mudgee wine upon arrival (locally sourced would really tick the box) thank you very nice touch. Laboca Argentinean steak house very nice. Shared the meat platter for 2 with sweet potato chips which were fantastic. Great meal left feeling very satisfied. Happy hour drinks weren't cheap with no atmosphere in the bar area during the week. Overall the stay was great with a planned return already being considered. If you like old style hotel that need to be upgraded to respond to the fact, that they mention they are 5 stars ?!?, this hotel is for you. ;-) I would give a 4 star if the manager/staff treated me better. Recently stayed here for our 30th anniversary.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Arkaba Hotel: One of the better places I’ve stayed. I was upgraded to a spa room which is fantastic, super comfy bed, great ammenities, even some complimentary snacks and hot chocolate sachets. The $20 steak special for dinner was delicious, and there’s a great deal for breakfast when booking. Multiple beautiful restaurant spaces and I noticed there’s even a quiet dining area. Many thoughtful touches and friendly staff. Good car parking and nicely renovated restaurant.  As someone who us hearing impared, I appreciated the carpeted floor. In fact, I do not go to restaurants with hard surfaces as conversation is impossible.  The menu was diverse and well priced. Service was very good. Went for a quick lunch, great table service and the staff were all amazing. Our meals came out very quick. Schnitzels were cooked to perfection! Lovely staff, great facilities & location. Rooms are fantastic, & the breakfast delicious. I couldn't fault my stay there at all. Highly recommended 🫶 Hosted friends over the weekend who thought the hotel was really comfortable. We ate in the restaurant 3 times during their stay & the food was excellent. There is someone in the kitchen who knows how to cook steak & make a pepper sauce.  The little semi Caesar side salad was delicious and the chips were pretty good too.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mawson Lakes Hotel: We recently celebrated our daughters 21st in one of the function rooms. We had a lovely lunch here today and the staff were great. Shelly was our server and she was friendly and helpful. The food came out quickly, and it was fresh and hot and tastes great. My hubby had the seniors meal deal which was great value.  We will definitely be back. Beware the undisclosed surcharges. No signs. No warning. Just slam bang thank you we got your money. Overall experience was below what I have ever experienced, appalling! Unfortunately we were booked here for a 7night stay only to find out they had stuffed up our room booking, they had sweet talked us into drink and breakfast vouchers! Be very very careful and read the fine print.!! Absolutely taken advantage of, rethink before you book your accommodation here for an extended period!!  Very noisy when there’re functions being held. A+ young Chloe welcomed us in, walked us to our table and was very welcoming! $3 tip as it says on the table and should be more. As I said Chloe, didn't mean to freak you out but great service girl!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Marion Hotel & Cellars: Marion Hotel’s aesthetic is charming and the staff friendly, but the experience faltered with our meal. We waited over an hour for our food with no updates, we understood being a busy Saturday night it could be a wait, but the lack of communication was poor. When it arrived, the food was okay at best, a number of us had the $27 \"full size\" schnitzels, which were disappointingly small and average in taste. Marion Hotel has potential, but needs better service and value for money. Went to Open Mic last night for 1st time there was 9 of us. It was so entertaining , initial table mix up was sorted for us all by Lily. Outstanding customer service she was amazing. Bright bubbly and so helpful. Kept a watchful eye on our meals did every thing to help us as it was really busy. Will def come back wish we could have stayed longer but had to work next day. Thank you gorgeous Lily. From Suzy Very nice and modern venue. Service and staff was great, however quite disappointed with the food quality. The Beef burger at $26 was very dry or overcooked or felt like it was re heated. Portions could be better and would be great at this price to have had a beef patty made in house, which would have been of a much better quality. The food was honestly, terrible Good pub, plenty of tables and good decor. Food is good but not outstanding. Would thoroughly recommend for a casual lunch or dinner option",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hotel Richmond: We hosted my Sister's Hens Night at Hotel Richmond for Dinner and then used their private room to host a Burlesque class with our nearest and dearest. If this is a four star hotel I’d hate to see a 2 star. The room was filthy. Nothing in the bar fridge but soy milk and water. The whole place needs a vacuum and coat of paint. It’s shady and outdated. The best thing about it is the location. If you can tolerate the dirty unvaccumed floor near your bed and the filthy shower then the price is ok too. Btw we accidentally used our key in the wrong room. The door opened and we walked into someone else occupied room so security is an issue as well. Located in the heart of Rundle Mall. And what I mean by that is ,step out of the hotel door and into the Mall. The photo is from the room looking over the mall. Service is very great and helpful. Recommend this hotel if you have a couple of days in Adelaide. Had a splendid time betting on the ponies and having a pint. Get some enjoyment out of the local's too Good - location, location, location.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Hotel Metropolitan: We occasionally drop into the Metropolitan for a drink after work.. good cocktails... lovely atmosphere... this pub seems to have reinvented itself.. plenty of people congregating for a drink despite all the chaos of the roadworks on Pitt St. Bar staff were great but the meal was very disappointing. When a chef can't make a simple meal with hot freshly made (even made same day) mashed potato it really says something about his culinary skills. If I hadn't been so hungry I wouldn't have left the reheated food on my plate. Not somewhere I would revisit. Good little place for live music. Was packed the night i went, with young people watching (i can only assume) some of their mates playing. The bar itself looks a bit like a RSL, but good for what was needed there. Staff were great Brilliant to be able to preorder dinner prior to seeing Elvis at Her Majesty's. Lunch:",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jasmin Indian Restaurant: This is my 3rd trip to this marvelous restaurant and would be dis service not write a review to the nice food and atmosphere. Just had the most delicious Indian dinner.  Jasmin is authentic, each dish had awonderful mix of herbs and spices. Last visit to the Jasmine was 3 years ago just as Covid started we went back this week whilst on holiday and the food was delicious. We had the feed me menu and got to taste a number of dishes all very different. The owner and his staff were lovely and we spent time chatting to him about the restaurant and its very loyal staff. We will definitely be back on our next visit to Adelaide. The food was good ! For starters we like the blue cheese Naan and the pakodas ! The vegetarian main course paneer palak was nice , not very spicy , felt like home cooked ! The best part was that they had chapatis which also felt like home cooked ! The only suggestion I would have is it would be good if they had more options in paneer, as they just had one paneer dish ! Down a short flight of stairs off Hindmarsh Square, follow your nose and your taste buds to the flavours of Northern India. Come prepared to be enticed, enchanted and captivated by dishes brimming with colour and exotic spices. But be warned, the chicken vindaloo is not for the faint of heart or the novitiate level curry aficionado 😋. Generous portions and sensible prices make this a must try if you are fond of a good curry.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lenzerheide Restaurant: Service and atmosphere were excellent. Comfortable and quiet so you can have a good chat with your companions. The food was good but not excellent. It’s a fine dining restaurant but I had better elsewhere. The barramundi was delicious but the white sauce was a bit too heavy so I couldn’t finish it. I had the prawns as a starter. The pastry wasn’t fluffy and crunchy as I imagined it. My husband had the venison and the sauce was a bit too sweet. The vegetables tasted well but a bit greasy. So the food I’d say was average for a fine dining in Adelaide. But overall it was a pleasant experience. Thank you The atmosphere dates the establishment. I think this restaurant is now surviving on its long term reputation. There were many disappointments. The greatest was receiving a crème brûlée for dessert when we ordered a panna cotta. We didn’t like to complain at the time as the staff seemed overly occupied and stressed. My partner’s chair wobbled the entire time and his chicken was dry. He flicked a chicken piece across the restaurant because it was so tough to cut and he was terribly embarrassed. I’m sorry to say I found the octopus special tasteless and the barramundi equally so. The lemon and dill covered salmon entree was amazing though, as was the salad side. The decor is, as it always was,  lovely. Overall though, we expected more for the price and long term reputation. A wonderful night. Top class food and service. I would recommend this restaurant to anyone who wants a special dinner experience. I had a High Tea to celebrate my 60th birthday at the Lenzerheide and it was fantastic.  The room was beautifully set up, the food was amazing and the service was the high standard you would expect of a fine restaurant.  I would highly recommend the Lenzerheide for any function where you want to have a relaxing time and know that your guests will enjoy themselves.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Watermark Glenelg: If you’re in Glenelg and want an all you can eat, this is the spot for that. Food from many different cultures and even had a kids mini arcade. I used to love going here when I was a kid but now the food is bland, no flavour at all in almost all the meals. The pizza and chicken nuggets were the best with flavour and great texture. There was absolutely no seasoning in the chips, pesto pasta, etc. The staff looked bored and tired. Nice but resting faces. I love my pesto pasta but there was barely any sauce or basically any ingredients at all in it. Super disapointed. The soap dispenser was broken. Would barely or not push at all and there was soap inside, just wouldn't come out. When I was in the toilet, I heard some men came into the bathroom, \"claiming\" that there was no soap in their toilets. Not an excuse for them. And the bread roll was dry as. It looked nice but it was dry as. Good variety, but very bland food. Like they don’t even try to add flavour just to compensate for all the food they have to make. Which is valid for the circumstances, but that doesn’t make it 5 stars. Fantastic buffet options! Upon arrival for 5.30pm booking, the booking took ages to find.  Paid $35/head for 3 ppl aa part of a party of 9. The soft serve machine was broken. The hot meats were tough, dry or overcooked.  The whole fish was almost fully eaten within the first 10 mins, and sat there,  unchanged for an hour. The pizza was overcooked. We watched the chefs/staff help themselves to a plate of food each in the middle of the seated booking time (which is an absolute no no in a public buffet). The whole experience left me feeling underwhelmed and disappointed,  especially for that price point.  Do better. Never again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adelaide Inn: Older style hotel, but lovely. Made a last minute booking for my son who had driven from Sydney to Adelaide. They were so helpful, even though he was arriving after the office had closed. He very much appreciated the ease of check-in, the good location and the comfortable, quiet room. Great place to stay with plenty of eateries in the area. Rooms are a little retro but clean and very spacious. Very happy with the overall choice. Only issue you need to decide is whether you need parking because parking is limited and is an assigned pays only. When booking make sure that you book a parking space if you are going to be taking your car. First impression,  Old deco style when you enter the lobby, a step back in time to a world of grandeur.  It reminded me of the 1940s and 50s,  bus boys and doormen. Derek, the young man who checked us in, was fabulous,  welcoming, very efficient, and friendly. Had a great sense of humour, too. Our room was very clean and very comfortable,  some of the decor was a little dated but didn't impact the stay. There were some good points, notably the friendly and excellent staff at breakfast who were awesome despite it being very busy. The hotel facilities are okay for the price, if a bit dated, and staying at this hotel when it is less busy could be okay. However, we stayed over Easter weekend and the hotel was rammed with large and noisy groups who treated the hotel like it was their own home (or worse). It was very loud pretty much all the time from 7am in the morning until 11pm - by far the loudest hotel I've ever stayed in. The hotel staff seemed unable, unwilling and uninterested in doing anything about it. The hotel might respond by saying that this was the fault of the groups and not their own, but ultimately the hotel holds the responsibility for making sure that ALL guests can enjoy quiet occupancy of their rooms, and we did not get that at all. Also, we paid $10 per day for a reserved parking spot, but this was a total farce since guests just parked wherever they want. To the hotel's credit, they did reimburse me for parking when I told them I could only park in my assigned spot for one night out of four. All in all, an awful experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Esplanade Hotel: Myself & 6 friends had lunch here today with the lovely view of the sea. This is a food review for the cafeteria…I had a disappointing lunch on a Friday. Firstly I ordered a large tea. it arrived with a mug, teapot of hot water and a teabag. Unfortunately I had to ask them to swap the mug as it was dirty and lined with cappuccino foam on the inside from a previous customer …Yuk. I ordered a Margherita Pizza which arrived to my table hot. Had to ask for cutlery and a serviette. The pizza came on a plate and not in a box so I don’t understand why I would not get cutlery and at least a serviette. Very very bland tasting pizza. No herbs on the pizza and only 3 spinach leaves and tomato paste base was so bland. Great local venue. Was there with visitors from W.A. who were very impressed. The casual area served great coffees. My granddaughter was thrilled with the way her baby chino was presented to her. It looked quite the thing. The Bistro dining area had a small play area for young children. There could be  more exploration   play equipment there to keep children active and entertained for a longer time. Lovely staff - friendly and informative. The rooms are passable, you get what you pay for. Could say that the shared bathrooms leave more cleaning to be desired. Location is amazing for the beach. The food is the big let down here: took forever to arrive despite an almost empty restaurant and when it did it was the biggest let down flavour wise. Christmas lunch in July.. nicely decorated with Xmas tree but Christmas music would have added extra touch, perhaps a bit more variety for Christmas menu, for those who can only celebrate a get together in July I think idea is good but more effort would make occasion fun and extra special. Thanks Suzy.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sammys on the Marina: Had a fantastic night at Sammy's. We we're accompanied to our table on the 2nd floor overlooking the beautiful sunset at the marina. We ordered the seafood platter, surf and turf salad and chips they were all delectable and spot on. We were family of 4 with 2 Teenagers and this place didn't disappoint. The view, the food and the service by the staff...all i can say is wow👏👏👏👏...thank you for making my Mum's day very special. This will be a tick to one of the best restaurants we've been so far. And yes we will be back soon. What an amazing meal. The food was delicious with great presentation. The fish, prawns and oysters were fresh and matched with flavours that enhanced the produce. Along with outstanding service in a lovely atmosphere made it a thoroughly enjoyable experience for a birthday lunch. Great restaurant with a great atmosphere and stunning location. We chose the Seafood Platter and it was really good but the Burramundi was the star-simply fantastic. Sammys is a real gem in Glenelg, where dining is still a classy experience for families and couples alike. Well done. Still a great place to wine & dine, food & service was perfect. Perfect views overlooking the sea & marina. Whether it's idnoors, upstairs or on the terrace, the setting is perfect. Went to Sammy's on the Marina to celebrate my 50 th birthday.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rex Hotel: Had lunch today. Big group 20 + 10 x under 10 years. For a 9 year old Birthday. Went after a Bounce session. Kids meals came out promptly and then adult meals were delivered with no fuss and no mistakes. All delicious. Bar staff super helpful and positive. Checked in to ensure all was OK. Wait staff efficient and friendly. Great experience considering taking kids out. No kids area or anything like some pubs but big enough to accommodate. We'll done. Am staying here for a couple of nights for work nearby. Room clean and comfortable. Special chicken curry nailed it, Very surprised to be honest. Stayed here for 2 nights the weekend and the room was great value for money. Super clean and the shower was perfect. Gaming and bistro has been renovated and look great! Ate twice, and both times the food was on point. Anthony on check in went above and beyond. Only let down was Slow service in the bistro/gaming room downstairs but maybe an off night? Food was great, service by Mel in dining and bar areas was exceptional.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Caffe Acqua: Fast and sufficient team... From ordering to drinks hitting the table and then meals, timing was great! Despite it being a busy lunchtime with a lot of people dining in, still not long to wait for food. Was great! Good portion for price. Get seated by the floor staff and order and pay at the counter with your table number. The best steak that I've had when eating out. Perfectly cooked to medium rare, beautifully seasoned, tender and juicy. I couldn't fault it. Apparently, in my recent experience that's a difficult feat. Nailed it 👌🏼 Ordered to take away. Coffee was brewed way too hot. Taste was harshly affected. Chips ordered only warm and not crispy. Could've thought they'd been sitting in a warming tray for an hour. That's the worst chip of all. Chips need to be made fresh. Won't likely visit again. Sorry guys! The customer service was good. Wife and I got a beef schnitzel here and it was amazing.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mr India Restaurant: Had a fantastic meal with another family and 4 kids. The food is flavourful and authentic and the service was lovely. Highly recommend this and will certainly be back again soon. Food was very reasonably priced too which helps a family enjoy a night out. Thank you to the staff at Mr India Great food and friendly service. Music was very authentic. It looked closed from the outside, but was open. There is an entrance in the carpark behind. The food was exactly what we were craving, the service was attentive, fast and friendly. Of particular note was their patience which was second to none when we even had a late guest join us and we all love to talk so stayed after all the other customers had left. We are close friends and mums of young children so time together and uninterrupted conversation is precious to us and the compassion and courtesy shown was appreciated so much. We’ve all been here before, both together and with others and will continue to keep coming back. Thank you! The best Indian food we have ever eaten! The service was wonderful and the restaurant is delightful.  You will not be sorry eating here and we can't wait to go back! It was absolutely delicious 😋 😍 Honestly I absolutely love this place we have been getting through from here for the past three years the food is always really delicious and the customer service is always fantastic. It's honestly a staple for us 😍 when you don't feel like cooking anything and you want something tasty and delicious this is the best place to come to. They always serve you with a beautiful smile. Thank you so much for the great food and great atmosphere❤️❤️❤️❤️ xxx",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Diwali Restaurant: All the sauces are like water, cheese garlic naan burnt and no cheese. Expensive and not satisfying. Rice is good? The food delicious, the poor lady on reception was dealing with many phone orders, pick-ups, all restaurant service - with  one arm bandaged due to injury. Full marks to her but more assistance was needed for her. Cleanliness not as good as could be either. We enjoyed the food a lot Ordered online, food was lukewarm when arrived.  Taste was good but needed to be reheated. Don't know if it's restaurant problem or delivery problem? But very tasty. Might be better to go to restaurant instead of delivery. One of my favourite places to get indain. Staff are nice and friendly, food takes a normal amount of time to come out and it's also delicious. Have tried this place twice and it was okay. But had a bad experience last night having to throw away our dinner.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adelaide Royal Coach: It's not all bad. The room is spacious. Beds are probably ready to be replaced, but still comfortable. The spa was good & the desk staff were very helpful. However I am concerned about the cleanliness of the room. As described in the exhaust fan photo & the photo of the dirt stains on the towel that I simple used to soak up some water on the bathroom floor. Also there was a cockroach in the bathroom during the night. Beyond that it's a busy loud area outside out room in the early evening. We are supposed to stay a second night but it's almost midnight & there are still children running around in the room above us. The soundproofing is worse than terrible. The noise upstairs is echoing around our room & the vibration creates bass that makes me feel like I'm staying in a bongo drum. Definitely wouldn't stay here again. Rooms are ok, the cleanliness of the room/spa/bathroom is not geeat. The attention to detail is lacking by cleaners. I recommend doing a clean yourself b4 using. Check in was easy & fast, rooms are clean, spacious & well-appointed. Bathrooms are a tiny bit small & toiletries are pump bottles attached to the wall which impacts accessibility. Easy going place to stay within easy walking distance to the downtown. Motel style car park a bonus for car trippers. Very friendly professional staff. Restaurant serves wonderful food. Really  great location. Clean and tidy rooms. Would highly recommend  👍",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jai Hoo India Restaurant: Just spent 70 on the worst butter chicken and garlic naan I have ever had . The naan is absolutely soaked in oil and the curry is very watery and tastes like sugar. I have had food from jai ho many times and never had food that bad that we had to put it in the bin. The restaurant wasn’t overly tidy when we visited, and the food didn’t meet expectations (ie: Vindaloo on the menu reads “This dish is definitely not for the faint hearted”… Not only was the dish bland, but it tasted like a watery pasta sauce). Flavours across all the dishes weren’t satisfying. Excellent service, good food and good location. We walked here one Sunday evening and ate in. Cosy, small restaurant with casual atmosphere. Wasn’t the best Saag Paneer I’ve had but still very good. We enjoyed the entree plate. We ordered off menulog tonight as it was free delivery. Our order was the \"deal for three\" and we paid around $45. Im super happy with the price and especially the free delivery. We waited around 50 minutes for delivery to aberfoyle park on a saturday night (not bad).  Butter chicken, lamb korma and beef rogan josh were delicous and full of flavour. Honestly cannot fault anything!! Why would you use any other indian shop when you can have the best indian for the right price from Jai hoo indian!! Will be comming back for more in the future. Disgusting food Disgusting service I've noticed that Indian people 🇮🇳 just do not care about there jobs or customers in general when working, eat somewhere else anywhere else",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lakes Resort Hotel: The Lakes Resort is one of a kind in Adelaide. It lies on the edge of the West lakes and gives the feeling of a tropical resort. The bed is very comfortable and the room spotless.  Wide windows give a fantastic view and when warm the balcony is a great place to unwind on Worth the visit. The staff are very well organised, the service was top notch. Every time I went up to the bar for a drink I didn’t have to wait longer than 10 seconds to be served. The meal was brought out in less than 20 minutes after ordering on a busy Friday night. They really do seem to care about who they choose to employ. The only reason why I’m not giving it 5 stars is because the burger wasn’t as hot as it should have been, but it still tasted nice. This place definitely suits a family dinner for a special occasion, or with friends Enjoyed our stay at this hotel. The room was clean with a nice view of the lake and a good size balcony. Nice little hotel, but unfortunately not situated fully on road frontage, so doesn’t stand out as much as you would want. Staff were incredibly helpful and willing to go the extra mile to assist (front desk & bar staff). Room was clean and comfortable, with a good view of the water. I think there should be more of a barricade between rooms on the balcony to increase privacy. Would definitely stay again though. I say this honestly as  this is my local place and I come daily. When i tell you that every single time I come the staff are amazing, considerate, friendly, respectful and extremely customer focused every single time. I adore them all. They are consistent always in their approach and will always serve you with a smile no matter how busy they get. Come and visit this beautiful welcoming resort and feel like you are  family every time",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Franklin Hotel: Funky little space, with exceptionally friendly staff. Very comfortable room, with a free mini bar and tea and coffee facilities in the room. A lovely balcony to enjoy and the bar menu was delicious. I would  definitely recommend the steak sandwich from the menu. Great all round experience This is what all hotels should look and feel like. Charming as, great location, large comfortable rooms, great attention to detail (from pillows to shampoo),... Just an unbelievable hidden gem. I love this place and I keep coming back. Exceptional, independently-owned, real ale pub. We found this on UnTapped, and found it easily. Very nice place to enjoy a craft beer. We went for the Tap Takeover “ yesterday. Bartender took time to answer all our questions and provided great service! Highly recommend. Good old fashioned Aussie pub with great service, food and atmosphere. Free mini bar and in room snacks. Funky room and so central to everything in Adelaide. Will definitely make this my go to Adelaide accommodation base.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Fox Restaurant: The food is amazing, duck and squid are highly recommended, they close at 9 and the chef will refuse you desert beyond 8:40pm😊 Good food, friendly staff, nice place but dirty table cloths and dirty knife, which has food spots on it. Nevermind, I ll go back to eat there coz of their good things. Good meal, friendly staff and a good night. Food was ok, really nice staff. Would recommend for a good night out Brilliant setting, good food and service. Really surprised to find such a nice place tucked away in North Adelaide, nice change from the modern, cramped, and loud eateries that surround it.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Marcellina Glenunga: I've been coming to Marcellinas on a semi regular basis for a number of years now and it supplies consistently good pizza. Sure I've had better, as in crammed with more topping, but this is still most satisfactory. On my most recent visit, it seems they no longer longer have a liquor licence however, so dissapointingly could not enjoy a nice red with my pizza, but that's probably more a me problem than a you problem 🙂 I decided this place has to be better than Domino’s which I think are a downgraded pizza franchise and especially for the price. Dominos cardboard pizza would have won over this junk. The standards that this store accept has dramatically dropped over the last few years. Gave them another go after previous bad experiences and pizza was delivered cold, the party pizza was not even really cut. The base was very undercooked, basically like soft bread. I ordered cappuccino… got puddle water. My fault for ordering coffee at a pizza shop. Fellow that made it is the nicest tho. Might come back for actual pizza and re review this Solid pizza - very fresh and plenty of ingredients. Was delivered piping hot even though we live 10+ mins away from the store. Would order again 😊",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sfera's Park Suites & Convention Centre: The room was clean and nice. The bathroom needed updating. The vanity was old and falling apart. The spa bath was great. Clean linin and comfortable bed. Central heating is controlled through the whole building, so you can't  change the temp in individual rooms. Great location. Clean rooms, however you can't change the room temperature at all and when we rang to ask if we could they said no. Upon check in we stood there for 5-10 minutes because no one was behind the counter. A girl came in with a drink, walked passed us behind the counter, saw us, put her drink down and then went through a door and didn't come back out, someone else came out another 5 minutes later. We were given free drink cards but the bar was closed. Had a lovely gentleman who was setting up for an 18th pour us some drinks. Other than him though the staff were rather rude and unapproachable. We had our daughters 18th birthday party here. Cassie was very helpful and did everything possible to ensure our event went perfectly. We got married here on 03/03/2024, and although there was a couple stalls with food/drink service for canapes, it was quickly rectified and the attending staff were wonderful, thorough and welcoming. The facility itself is beautiful, perfectly fit for our little wedding and following reception, we were proud to make those memories here. Neat and tidy place to stay for a wedding venue we attended to nearby. Easy to walk to the nearby shopping centre to get any items and close to some nearby cafes.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Regent Thai: We had a great dinner at Regent Thai. We ordered veg Pad Thai, and attempted to order a veg stir fry. We were informed by the waiter that the stir fry we wanted was unable to be made vegetarian. The manager came over and discussed this with us and was kind enough to offer a specially made vegetarian stir fry for us. Great service all around. 5 stars. Would recommend to all. Enjoyed a lovely dinner at Regent. Great food and big portions. Excellent value for money and friendly service too! Got takeaway from Regent Thai and made the right choice for sure.  Tasty Thai curries, and basil beef and pad thai were excellent too.  Friendly staff on the phone and at pick-up.   Thanks! I have been to several Thai restaurants with different tastes. At this restaurant, I had the opportunity to experience a different style of Thai cuisine as well. The dishes are delicious and eye-catching, although one dish is quite salty compared to other places and today's rice is unfortunately not cooked thoroughly. However, in return, the staff is friendly, enthusiastic, and welcoming. The restaurant is spacious and cozy. Always great tasting food! Very noisy as always super busy and popular. This place has been around for years because it's a good one. Quick service too. Booking required.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Eagle Foundry Bed & Breakfast: Very happy with our recent stay. Room was immaculate and the fire was much appreciated during the colder nights! As was the pool table when the rain kept us inside. Close to the main street and not too far from the Barossa for amazing wineries and restaurants. Good location.  Super quiet. Owner professional.  Rooms are quirky but comfortable.  TV is up too high we got sore neck from watching. Otherwise is was great Absolutely Beautiful and Peaceful Location to Enjoy Some Quality Accomodation with Excellent Hosts, I stay here Annually for at least 14 days and look forward to it all year. Came here for a 70th birthday.What a hidden gem.  Ample room for multitude of guests/functions with good accommodation and great surroundings. Amazing rooms and fantastic staff",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Links Hotel: Delicious meals, friendly staff and Thursday nights free quiz night is super fun. The kids happily play on the self contained indoor playground while we play pool. And there is a generous salad and veggie bar too. Reasonably priced. It cost me less for dinner for 4 than it did to get pizza delivered. I had a great experience at the links hotel on Friday night. The parmi was amazing, the chicken and the crumbing was excellent!!! I really enjoyed the salad and veg bar and there was a nice and friendly atmosphere. The customer service was also very welcoming!! We visited the Links Hotel bistro with a large group for a birthday lunch. Both staff and Management were friendly, responsive, and happy to accommodate our needs. Everything was clean and everyone enjoyed their meals. A nice atmosphere in the bistro also. Thank you Links for an enjoyable dining experience. Wouldn't hesitate to book with you again. Emma Rooms are great value for money. While they're simple, they're comfy & clean, just what you need for a night. Staff very friendly & helpful. Food surprisingly good! You can't go wrong here. If I give this place zero stars I would! DO NOT STAY HERE! The Manager was extremely rude and condescending, and \"Yes, in hindsight I wish I had allowed you to cancel the booking\"!!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Enfield Hotel: we went for a family get together mealwhich was very nice, the meals in general were well done tasty and generouse, the roast pork for me was a litle chewy but with the included carvery (buffet with roast veggies etc) made up for it, my wife had the popcorn cauli as a main and thoroughly enjoyed it. The room service wasn't great, they didn't make up the room at 1st day, unless I told them...they didn't bothered to deliver or let me know about Menulog food delivery down stairs and I found out after 35 minutes... room was noisy from street Based on previous reviews, we booked one SEF Studio King room for our 2 day stay in Adelaide and I have to say that we had the WORST experience ever. Great meals, good portions. I would like to see a lactose free meal that's not salad. A nice quiet place, but some menu items were missing. Staff were pleasant.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "River Cafe: Exceptional dinner using their autumn offer of shared starters, main each and small dessert each for $40 - bargain! The restaurant definitely has the most beautiful views of the water. The service is great! The food is very delicious. I enjoyed the duck and my partner the beef steak. Definitely one of my favourite restaurants in Adelaide. Just so pretty and always an enjoyable experience!! Must try!! It's a special location with a great view over the river.  We took friends there on Friday to celebrate a belated decade birthday.  The place feels special and we were given the best table by the window.  But the food is not as good as we have experienced previously.  We all ordered from the large section, but I wouldn't call them large by any means.  My husband and I had the barramundi... it was well presented but very small took up about a third or less of the plate and was not particularly outstanding in flavours either.  Our two guests  - one had the steak which just looked like steak with rocket and capers on top no other veg or colour and the other had the Lamb from the chef's special which looked better but she said it was a bit chewy.  We are glad we ordered two sides to share.  Then for desserts, there are only 3 choices of dessert plus affogato & coffee and none of them were really special, I could make any of them at home.  I would expect at least 6 choices of desserts and them to be something very different.  They too were very small, nice but not amazing.  We both felt embarrassed as this was supposed to be a special birthday gift for our friends which still cost us a lot but wasn't amazing food.  The service was great and all the waitresses were great.  But the food needs a pick up in size and taste. I we can see an improvement in the menu and food so we might come again sometime.... but for now I don't recommend the food. River Cafe offered a Special Summer deal. It was the great way to experience this restaurant and its food options. River Cafe is in a perfect location.  It was easy to access and parking was not a difficulty. Staff were friendly and helpful. The food was delicious.  I will definitely visit again. Haven't been here for many years.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Findon Hotel: We have a two night stay, The kids love having their own room away from us as did we 😉.. Had a delicious meal here tonight. Very impressed with the friendly staff and the quick and efficient service. I think the pork sausage and mash would have been the best I've ever had in a pub. Thanks very much! Bron and Bill from Perth When I saw lamb roast I changed from my normal snitzel parmy as I love lamb if it's on the menu what a mistake that was. The lamb what their was of it was full of fat which even when the lady picked up my plate said oh there was a lot of fat. After I had told her she did offer to get me something else but i just said no thanks.The little piece of carrot even my daughter in law commented it actually looked dehydrated.  The few little pieces of potatoes were not crispy but pale and looked like they had been cooked this morning and held heating for lunch. The couple of small pieces of pumpkin was beautiful.  Some greenery would have looked nice on the plate. All in all it was the smallest and worst roast I have ever had anywhere. A shame because the atmosphere was lovely but I don't think I'd go back to eat again Went there for mother's day lunch. Unfortunately I stayed on a Saturday night when the hotel had a live band until 2 if 3 am. After that there were youngish adults wandering the corridor talking loudly to their friends, so I didn't get much sleep. The bed was very comfortable and very small bathroom was functional with a good shower.  I only had dealings with one staff member who was courteous. The kitchen closes at 8pm so having arrived at 7pm dye to Jetstar being late, I missed dinner. There are 24 steps to the rooms abs no lift.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Europa at the Bay: Super yummy food. Hot chocolate was great, not boiling hot so it doesn’t burn your mouth. Scrambled eggs were very yummy, and ciabatta bread was great size. New owners - not the beautiful Italian experience and food it used to be. Cibata dish came out toasted which was  unexpected and the balsamic was very acidic. Pizzas weren't light and flavourful like they were,  greasy and not enough flavour. We were very disappointed with the poor table service - while very quiet, staff did not meal check or ask for drink refills. Staff did not know menu items or how to pronounce them, without us pointing to the menu. We arrived here at 9pm after a long flight.  Although they were close to closing for the night, the offered to prepare us anything from the pasta menu. Tried this place 2 times once for breakfast and once for dinner during my stay in Glenelg. 🇮🇹oriented frozen yogurt is so different! It’s definitely the first launch in ADELAIDE! I v chose the watermelon 🍉 flavor frozen yogurt, taste more refreshing and a bit sour, though I think the toppings are blocking my eyes 👀 because there is SO MUCH CHOICE! the heart ❤️ shape chocolate is so cute, my favorite one is the different flavors mochis! It is so yummmmmm omg you have to try🥹",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Patiently waiting for my turn in line. And another person comes out from the back and doesn’t even bother to say anything to me. And goes to the person behind and ask what they want? Im like excuse me I was first and they even ask “you haven’t been served?”. Does it look like I have been? If I have been, I wouldn’t be standing in line. I just left after she also gave me attitude when she said that. My recent visit to Subway was highly disappointing. Despite the absence of customers inside, the tables were noticeably dirty. I have been this place multiple times. Today's expirence was bad. Had their chicken teriyaki, it’s pretty nice and tasty!!! Wishes Been here a couple of times, today was even better than usual. I was welcome and served by this girl named Hannah. She was super friendly and fast. Couldn’t give her a higher rating :)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Melt Hyde Park: My family & I had a lovely meal on Monday night here. Food was great, service was great and lovely atmosphere. Plus they catered for gluten free, through all the courses we had. We had an hour to eat before a film at Mitcham and were pleased Melt was open on Monday. We were quickly seated, enjoying our drinks while checking the share plates menu [I won't say Tapas since in our many years racing and travelling in Spain  we enjoy Tapas in it's historic context as a gift when buying a drink] It is a beautiful restaurant with delicious food and lovely staff who make you feel like family. Melt at Hyde Park offers an excellent range of tapas and pizzas in a relaxingly busy setting. The venue was busy throughout but the staff were friendly, attentive, and good-humoured. The prices were also quite reasonable. Three dishes shared between two was plenty, and that plus a glass of wine each came in at under $50. Definitely looking forward to going back again. Fantastic! The tapas steal the show, each dish is as amazing as the next, although the baked gnocchi for me was the winner. Fantastic service, great wine list, and if you make it as far as pizzas they are amazing too. Overall a top notch experience and cant recommend highly enough, can’t wait to come back",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Kent Town Hotel: The Restaurant & Bar, and function rooms were well serviced. Tom was amazing, very professional and kind. Atmosphere was lovely and big TV awesome to watch the Olympics Such an amazing old school traditional style pub. It has modern lighting with traditional stylings. I love the chesterfield features throughout the venue. It’s an Adelaide must if you want a quiet beverage just out of the city. Great dinner, good wine, beautiful dining area! We had beef wellington, pork fillet & a side of fries. Lovely old pub with a nice reno. The staff were friendly enough but the service wasn't the best. The food was very good but the desserts were average. The hot crusty Cobb loaf of bread is a must. I found it odd that what I ordered from the menu was changed by chef and I received different items to what I thought I ordered. I did tell our waiter and  then quickly received what was originally on menu. Our tables were never cleared after we finished eating which was annoying as we were there for a few hours. Staff seemed very young and inexperienced. Has potential but needs help. Hope they get it right soon.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: The usual staff at lunch on weekdays take absolutely no care in putting sandwiches together. Bread gets completely squashed when cut, ingredients are just thrown on without spreading anything out evenly. No effort or pride put in your service whatsoever. This is the only subway that I have seen that has overcooked cookies. Everytime. Everywhere else I have never seen it. I purchase my lunch at this Subway at least twice a week. There's usually a 20%-ish chance that the drinks machine will not be working, and frankly the post-mix is half the reason I get lunch here. I've been burnt too many times to get to the till only to find it's not working, and honestly an \"out of order\" sign would go a long way to curbing my disappointment except one is never erected. I had to order a footlong and I waited at the counter for like 15 mins and I just get an answer from the person in charge saying that it may not take time. The customer service was very poor. Other than that I have had one more experience saying that we are out of material such as bread and veggies so we can't take you order in. I mean Subway being such a great brand, I don't understand how is this quality gonna make them save their brand values. No customer service, no materials. It has been a very bad experience and if there would have been an option of a zero star, I would have opted for it. The woman didn't listen when I asked for just a little blue cheese sauce and proceeded to drown my sub in 4 full squeezes of blue cheese back and forth so it was ruined and soggy when I went to eat it. I did ask for a little not alot so wasn't happy at all especially with the sorry smirk she gave me. She should of made a fresh one not a fresh smirk.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Marcellina Aberfoyle: Gluten-free base was very tasty. We were able to modify the manner of preparation to suit.  The amount of topping shows why their is truth in the saying, \"You get what you pay for.\" Don't let the negative reviews put you off. Marcellina Aberfoyle Park is under new management and well worth going to. The service is friendly and the food delicious. I had the lunchtime marinara pizza & my dining companions had the lunchtime pasta carbonara and were equally impressed with their meals. Will definitely return. we have been ordering from Marcellina aberfoyle park pretty regularly for the last two years. I notice that it has recently changed hands and I’m sorry to say that the food is disgusting. Burnt pizza and Alla Panna that is dry (no sauce) and full of black pepper. Sorry but we won’t be ordering again and it’s a shame as it is only 1 of two places that will deliver to our area. Really disappointed. These guys have recently taken over so give them a go. I had large siciliana with chili and it was fabulous.. Nice and crispy, lots of cheese - absolutely the best.  Hand made pizza sauce. Really, really loved it. I went to the shop and ordered - pretty early about 5ish on my way home from work.  Give these guys a chance - you won't be disappointed. Will definitely go back..(p.s. I am new to living here too) Just looking at my own photo makes my mouth water 😁🍕💕 By far one of the best pizza points i have been to, I am thankful for the person who recommended this place to may. Made my day and the years to come.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Gov: This is a classic pub. Really like the cozy like atmosphere. Service is good. But if it’s crowded, the service isn’t going to be quick enough. The food wasn’t tasty for me the day I visited. We went to the Gov for the Bjorn Again live show on Australia day night. They were fully booked in both areas ( Gig & restaurant), I'm glad we booked. The girls were very attentive and the food came out quick. The toilets were reasonable. There is a disabled one, but when it is busy it would be hard to get around,  but not saying you can't do it wit a bit of help.There are lots of little areas to eat where you could have a group of people . One of the last bastions of live music and a testament to the unique enjoyment of live music and bands. Caught up with a friend there on a Sunday night during the festival season, had a few beers. I was intrigued by the fit-out and the Jetsons style bar, we were in the venue bit that was like a giant carport that was enclosed. They had Moo Brew Pale Ale in the mini champagne bottles….mmm delicious. Staff were friendly and warm, it really was a special treat to go out to such a pub. I remember when that type of establishment used to exist in Sydney and has been absolutely years since I’ve enjoyed that vibe. Really miss it. Went for a vegan burger and chips before heading to Thunderbirds game. Twas quick, food was great, and atmosphere was brilliant. Best place to see bands too,  intimate and great vibes.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Summit Cafe and Function Centre: Clean and presentable. Safe are friendly. Waiting for service in the cafe took too long. 15 minutes (it was busy). Staff taking orders and also serving added to the slowness. Family and work mates rallied together for a retirement event for my hubby. We as a family had a great dine in experience here. Food and service are perfect! Staff are super friendly. A must try cafe with perfect ambience and location, plus you get a chance to walk the trails before or after! Delicious food, generous portion sizes and lots of options. The service was excellent as well. Recommend stopping in for brunch while having a look at the view. Probably the best steak sandwich I've ever had. Great portion size, perfect after a long walk. Really friendly service and great team. Don't usually write reviews but had such a welcoming and good experience I felt it was important to. Got a short time in Adelaide Hills but will try and visit again before I leave as I enjoyed it that much.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Brand new with ample space and multiple pumps. Includes hand wash and sanitiser inside. Only complaint is sometimes ends up too busy with staff expected to do multiple jobs so wait at cashier can take ages The guy behind the OTR side said he didn't want to serve me a hotdog when they had hot dogs. The girl at GG with the lip piercing was so rude when I asked her to open my drink when the guy behind the counter refused This Is a proper old service station where you can fill up with Petrol and air, Diesel has it's own area for large vehicles, you can also easily wash and vaccum your car around the back. The staff are excellent and very helpful and friendly. Conveniently open 24 hours. Good for a quick stop to refuel. Don't have a lot in the way of food if you're hungry.  Car wash available.  Friendly staff. Car wash",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Charminar Brighton: Service was 10/10 Warm plates were delivered to our table about 20 mins before our food arrived, so they were completely cold by the time we needed to use them. Great Indian food. Lamb biryani and lamb vandalo curry were amazing, will highly recommend this place. Will order again 😊👍🏻. Love going to this restaurant as it is always good! Upon arriving home from a very long international flight we had dinner here the other night and the food was sensational. We have been here to eat three times in the past year and are always extremely pleased with whatever we order. Service is friendly and prompt,nice atmosphere. Great place to eat if you like Indian food. Food was awesome. We ordered Goat curry , papdi chat and butter chicken and everything was great.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Shiki Japanese Restaurant: After going to a game of footy in Adelaide and watching my team win, there’s nothing like celebrating at a nice restaurant like the Shiki, Adelaide's Award Winning Japanese Teppanyaki Restaurant located at the InterContinental Adelaide. This is where you can immerse yourself in authentic Japanese teppanyaki in the heart of Adelaide. Headed by Shiki Chef de Cuisine, Kenny Trinh, where the team have created a delicious menu of truly succulent sushi, sashimi… and the list goes on and on. They are without a doubt, the ‘best of the best’, and proud to showcase South Australian produce. The menu is extensive like the wine list, however I strongly suggest you try the sushi and sashimi selection, prawn tempura, wagyu beef, bok choy and snow peas, vegetable fried rice and miso soup, and for dessert the mango mousse with coconut jelly. All complimented with the traditional Japanese wine, sake. What more can I say - everything was tasty, juicy and cooked to perfection. Staff were friendly and professional, and everything else was cosy and romantic. Very Highly Recommended 👏👍😊 Value for 💵 : ✔️ YES $$$ Went birthday dinner and it was a good solid performance to high ⭐️⭐️⭐️. You could taste the higher quality produce used and the staff was so very attentive. Shiki delivers an unparalleled dining experience with its amazing food cooked in front of you, excellent ingredients, and fantastic sake selection. It’s the perfect destination for those seeking a culinary adventure and a true taste of Japanese cuisine. An amazing evening with the most divine food and great wine pairings. Thank you so much to Bun Tan for the fantastic culinary experience and to Naomi for looking after our table and making sure we always had something to drink. Will definitely return",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "OTR Darlington: After waiting for at least 5minutes to be served  with one girl serving one other customer  ,a male came out from behind centre prep area with a disgusting attitude , rude and with look of contempt , didn’t listen to my requests , deliberately slopped food items on roll etc , he turned it up a notch when i requested a little more cucumber on my grandsons roll as all he had was lettuce and cucumber … when I requested onion on mine he said they had none … didn’t want to inflame situation anymore and ask if that was true or was he too lazy to walk to fridge to get more … Awesome staff!!! especially when there is only one lady serving on Christmas Day . The amazing lady was trying to serve, make coffees, hotdogs, milkshakes, wash dishes and find a welsh plug for HR Holden all by her self while the subway guy isn’t , didn’t or wouldn’t help out . Lady, we commend you 💜 much love from some Victorians passing through. An old lady who served me at 22:33 on 01/01/2024 was so rude and even swearing r@&@*%%*.  The store is good, but just this staff member, with no name badge is ridiculous. I got some fuel here at 6:50 pm on a Friday, asked for a moe’s hot dog, and the woman that served me grumpily mumbled something, checked if she had the ingredients to make, put the hot dog through I paid, she said looking at me  “so many things to do and I have to make a bloody hot dog” . like c’mon dont want to make it don’t sell it them or at least lie saying that u don’t have the ingredients to make, don’t give ppl free attitude like that, that is not nice at all. Such a bad experience today we had while we had an online order for coffee we waited there for almost 10 to 15 minutes and crazy part is the store wasn't is even busy...it's an old lady with short hair and she just looks you and giving the judgement of life....",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tailor Made Pizza & Pasta: With the cost of living going through the roof, you treat your family to take out spend over $100 and get absolute garbage, the ribs were inedible, the pasta was jar sauce not hand made as suggested on their menu, just incredibly disappointed with there effort, would recommend giving them a miss and get something else, anything would be an improvement on their efforts tonight. Do ya self a favour and give it a miss Staff is so friendly and welcoming! The food was fresh and delicious. I am new to angle vale and would definitely recommend coming here! Always reliable! Pizza's hot and tasty,  delivery drivers are quick and friendly,  my absolute go to for take away!! Support local! Top job Tailor Made! 😁 Recently moving to this area we have tried a few of the other pizza shops to be disappointed. Thank goodness for TAILOR MADE PIZZA. Bellissimo Your pizza base is way to thin. Yes I ordered the thin base but it was so thin the pizza fell apart. Also the toppings where not anything like what you advertise.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Michelangelo Dial A Pizza: I’ll start with the good, chicken schnitzel was good and the cheesecake was amazing, real homemade feel to it. The delivery driver’s service was 10/10. Well priced and reasonably timed delivery. The pizzas here taste ok for but they seriously have a lack of cheese and sauce. Never ever enough of either. pizzas are supposed to be covered in these. Whereas the margarita pizza is all cheese and hardly any sauce,  go figure. Apparently the only thing that is great there are the chicken wings.  The pizzas are very pricey too. It's a convenient place for me as it's just across the road and so I try and try again but I'm always disappointed. beautiful food service was excellent friendly atmosphere as a kind gesture they gave free drink beautiful dinner Ordered a ham and pepperoni pizza ! Way to much ham and it doesn’t cook all the way through! And as for the pepperoni I was ready to call triple zero for a search party to find the elusive pepperoni!! No flavour the pizza pastry no nice at all ! I get the chicken parmy every couple of weeks and it's always fantastic, really cheap (about $20 and you can get two meals out of it) and the chips are phenomenal.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: I usually come here for the car wash but will be my main petrol station from now on. Have always had good experience and last week I had fantastic service from “Kiera”. I was served quickly and had the benefits of the app and QR code explained to me in a non pushy way. Keep up the good work! Staff pleasant and inner city feel stop useful but restrooms are dire - dirty and poorly maintained. Toilet roll dispenser falling off wall,  no feminine hygiene disposal in women's room, dirty broken toilet brush lying on floor. They advertise gas for 99.9 you go to fill up and nothing. I asked them to turn it on and they said they don’t have gas. Apparently the OTR management says they are not allowed to remove the advertised price from the board on the road or increase the price to 999.99 so customers know it not for sale. Come on business affairs, look into this poor behaviour. Have loved the range of options available in this place. I can still remember when it first re-opened back when HQ was called Heaven. Worst Experience ever.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Highway: We had a meal here lunchtime on a Wednesday , we managed to get a table, but I recommend booking as a lot of tables were reserved.  Service is at the bar or you can use the code on you phone and they text you when it is ready. There are multiple places where you can sit with all different sort of seating from plastic chairs to cushion lounges.  Service was quick and they cleaned away dirty dishes when you were finished. Toilets were clean and had 1 disabled toilet with bars, not sure if you would fit a large wheelchair in there though. There are ramps to all the different sections and space between the tables to get around.  They have done a great job refurbishing the place. There was a very large screen in the beer garden to watch sport, with music playing in the background.  The only fault was the music was very loud in the booth that we were sitting , as we want to talk... Booked for a large birthday gathering and staff were really helpful! Food was absolutely delicious (scotch fillet especially) and drinks were really well made! I've visited the Highway three times this week. We booked for my mums 90th last Sunday, then before I knew it, friends had booked on the Tuesday night & then another lot of friends last Saturday night. All our meals were fabulous. I had the roast, a Vietnamese dish and then salt & pepper squid.  The food is reasonably priced for a large meal, that you get. I've always enjoyed going there for many years, and their service is excellent. Had the Lamb rack for lunch, what a beautiful dish!. Also we used the meeting room for a work meeting, staff were excellent. Love this place. If I want a biggie, or drinks with friends, or food, I can do all three here! The service is fantastic, staff are very friendly and the drink prices are very decent with a good range! I’d much prefer The Highway over any club in the city too. Doesn’t matter what your age, you’ll enjoy it and have a great time!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Staff was busy fixing the EFTPOS machine and did not even make eye contact with customers during checkout. Customer service could be improved. Petrol prices are also more expensive than their competitor across the road, Costco Just now, my car ran out of gas and I was about to refuel it. I picked up the fuel gun and prepared to refuel it. For some reason, the staff refused to let me refuel and asked me to put the gun back. I walked in and asked him some questions. She said it was a new rule. Can't I refuel here just because I have a license plate in Victoria? Why can't the one next to me just refuel while I can't Food good, large serves!!!! Air pump was damaged and only lets out air. Fueled up my car and walked in",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Went in store to order lunch. Friendly staff nice and clean store. Perfectly made my sandwich. Very tasty as expected. Getting pretty sick and tired of staff skimping on the fillings. If I wanted a mouthful of plain bread on either end of my sandwich I would ask for it. Definitely false advertising when comparing to the advertising images. Don’t know why I keep coming back, as I’ve had a few average subs here. I just bought this sub veggie patty and there's hair in my food 😑I always visit this subway and was never disappointed but today. Onions are bitter in taste and hair in my food there should be option of reviewing in minus I would have given that today. Went in for a footlong sub, when the girl was cutting the bread she cut herself. Whilst wearing gloves, it was evident she had hurt herself and went to wash her hands and dabbed paper towel on her hand repeatedly. She replaced the glove. I asked if she got blood on the sub and she replied no and gave a horrible look. Her work colleague, a skinnier girl with yellow teeth came out from the back and started serving the lady behind. The skinny girl was rude and slammed shut the oven door, and banged the tubs around when they were empty and also was rude in her customer service. The other girl, Amber also got my order wrong when i said Pizza sub and began making it a BLT. Fillings were skimpy and not placed with any care or interest. No customer services skills either, it seemed myself and other customers were more of a burden then welcome to enter the store and place an order. Hope management sees this review and provides appropriate training to the two staff. Awful service lady named amber served me she clearly didn’t want to do her job had an attitude burnt the quesadilla and cut it in half so all the sauce leaked when paying she sneezed on her hand and then wrapped the sandwich in wrapper I asked for a bag she said they didn’t have any but I could see them so awful behaviour and AMBER please use some hand sanitizer and at least pretend to look happy never coming back again 😔😔😔",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: The worst customer service I have ever seen in a fuel station. EFTPOS machine not working and the staff is forcing me to take money from the Redi ATM by paying $2.90 extra incurring additional cost to the customer. I was ready to let them take copy of my ID and vehicle details,  so that I can come back and pay using card as I live very near. And it was not at all acceptable for the staff. Was talking in such a way that I'm at fault like a criminal. I wouldn’t have given any stars but for the sake of being able to write a review I have given one star for the most poorest customer service I’ve encountered! Went here on Tuesday 20/7 during the day before lockdown commenced at 6pm and was refused service as we didn’t have a mask on. A member of our family was with us whom is under the age of 12 therefore no mask required and he was going to go in and pay but was also refused! He was also referred to as a “she” twice! Staff said we needed to purchase a $20 mask 😷 in order to being served. Other customers were at the service station at same time as us and were also told “no mask no service” and were told they had them there to purchase at $20 each. Busy place, inside have a variety of snacks, magazines . Pretty typical OTR station with convenience store and carwash. Can get coffee and basic food here but doesn't have all the options their larger sites do. Gentleman behind counter very rude and grabbed me. Product range is ok. Hours of operation very good.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: It was a very pleasant experience. Below average subs here compared to other branches as staff can be stingey on the vegetables. You have to ask for more and even then they don't put that much more like other stores. Messiest sub ever. Bread falling apart,couldn’t hold in my hands. Quality has gone waaaaay down at this location. Will be avoiding from now on. The lady is so so rude my goodness , dnt waste your money as she has got some kind of attitude. She put a single scoop of avo cado looks like a dogs breakfast on bread , no presentation and she was very rude .. never ever eating subway again now Good service but serving portion of salad could be more generous because we've repeat ourself a few times to have extra carrots",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Don't bother thinking of this place to purchase any auto related products ie motor oil, replacement globes, jumper cables,etc unless you are a banker! The prices are atrociously expensive. One staff member,,Not all,  is so lazy that they couldn't put an Out Of Order sign on the tyre inflator. Selling stale filthy rock hard donuts. they shouldnt be able to gve these away let alone having to pay for them. threw it in the bin. and the customer service was terrible. Staff are always friendly and usually chat a bit. Also this place sells Dr Pepper cherry which is a tick from me. Clean , in and out, well stocked and maintained, good work BP at Alberton.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Port Adelaide: This subway store always goes above and beyond when it comes to customer satisfaction. When substitutions need to be made for online orders they always write a note and if it's close to closing usually an extra cookie or 2. The customer service is amazing especially the closing team on Sunday 24/3. Thank you so much for all your hard work, it doesn't go unnoticed. Staff were good, but the whole place was like an ice box, not good on a cold evening where outside was warmer than inside. Suggest regulating temperature to mild 20oC Great customer service from Ridhi and Jazz, best subway experience ever, real sandwich artists, will visit that store again. Staff allways so nice Very quick and polite staff. I got 2 foot longs and they put them both through as the cheaper one",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp Truckstop: Bp truck stop.. staff have been friendly and helpful every time I've been here Great service from lady working lunchtime Monday 20th Feb, self serve gerni car wash was on the blink, I lost $5, she gave me plenty of credit minutes to wash my wagon Staff always friendly even when they are so busy with all the pumps full. Place has toilets, an ATM, which costs $2.80 per transaction, bakery and hot food lines, along with usual servo chip and chocolate, ice  specials. They often have flowers, gifts and a REALLY good coffee machine! :-) :-) Very nice truck stops The car wash bays are badly neglected.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Lion Hotel: This was my first time eating here and I was truly impressed. We had the Curry of the Day which was a Thai Beef Curry, the Curry base was fantastic and the beef was lovely and tender. Warm Chicken Salad was amazing and the chicken was so tender and flavoursome. The cheese dish was lovely and the Bread and Chicken Platter was so delicious as well. Gabby was immediately welcoming, so polite and friendly to all of us, good humour too. She is good at what she does! What a lovely find. We came for lunch and shared a fish and chips as the servings are quite large. The batter on the fish was crispy and light and the chips were crunchy and full of flavour. A nice salad on the side really rounded out this meal. You can choose from inside or outside dining and outside was very shady and cool. Recommended. Excellent good food. Great staff. Old school pub vibes mixed with modern day standards,  very good pint of Guinness that’s coming from an Irish bloke too… Great experience In the dining room with the staff, excellent food. beautiful ambience in the restaurant.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: My only complaint is the state of the ground around the diesal pump, there is fuel all over the ground, I was standing in diesal whilst filling up, its dangerous and not acceptable, I told the attendant but he didn't seem to be very concerned, goes against all ohs saftey rules, please clean it up and fix whatever's leaking.. Good place polite staff and good place to fill up ur tank Pleasant staff and make a good hot chocolate Does everything you want in a BP - fast service, range of snacks and food (bread, milk, etc.) and magazines. They have a bit of everything there",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: I ordered one regular white veggie wrap and cheese and garlic toasties. But, white wrap was not good and it was all torn apart while I opened the wrap. And all the veggies came out. Very bad food experience I ever had in subway outlets. Among wi the times I've been to that store along with ordering through deliver services the food has always been incorrect or unsatisfactory. First off that store never accepts the order from deliver service, and when on the rare occasion they do accept the order is wrong. I ordered a foot long Tuna. The service girl(her name is Harman) only dropped the tuna sauce twice, but it should be four balls according to the operation standard. I asked her why don't you use the special spoon but a knife, she said: it's easy to use.  I highly doubt the store is real Subway or not. OTR Subway, Pulteney St. I can deal with the fact that the salads have gone up in price but to be served half the amount I would usually get is not acceptable",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Mitchell Park: We love the little notes on our orders, always quick to fix any miss orders which are not many. We really appreciate the customer service put in from Mitchell Park! Gave us some little baby cookie as extra and our kids went mental over them. This is by far the best Subway! The staff are always well trained, welcoming and friendly. We attend each week, has tried other subways however this is far superior and we now will go out of our way to get there. Thanks to the wonderful staff for always having a smile, good chat and making our subways. We appreciate you & your care. Came here today with a client to get some lunch and it was incredible. This is the subway that I remember growing up, not the OTR abomination that's around now. Keep up the great work and I'll definitely be seeing you guys again. 10/10 10/10 food, staff are so friendly and i love the little note they left on my bag! this subway might be the best in adelaide🤩 The best Subway in South Australia. The loveliest staff, always fresh ingredients and plenty of filling. And always a special note to brighten your day. An absolute gem 👉💜👈",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sam's Plaza Pizza Bar: The great pizza is here, large portion, remarkable taste, and inexpensive. A lot of choices for pizza toppings, and other meals. Very nice service. I love it  😊😊 As a first time customer this was the best pizza we have had in a long time! Great pastry and very generous with the toppings. Will be back again! Service was fast & friendly, the pizzas had decent topping and tasted ok, but definitely not the best in Adelaide, the thing that let them down were the pizza bases were I have tried about 9 different pizzas from here, and every time I've been blown away. The freshness and quality of ingredients really make sure Sam's Plaza Pizza stands out from the rest. Their \"Fire Burner\" pizza is a favourite of mine! Food was amazing service was great to would highly recommend eating in or taking away",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Nice older car wash. Lots of soap, the car was very clean afterwards. Don't bother with the $20 Ultimate wash though, the \"ultimate polish\" came out of only 3 nozzles and looked like water. Some night shifts extremely bad customer service. Last night for example, learn to communicate Customers are your bread and butter we don't like being treated like an inconvenience. This store staff is very friendly and helpful. Manager and assistant manager is also very nice and kind hearted . I really appreciated the staff members who easily handle the customers and making coffees in busy time . Most important thing is this store is too much clean and tidy all time when you visit here . Lots of love and respect for this store staff and manager ❤️❤️ Was double charged ($46) for fuel a few months ago at this place. Showed proof of the double charge moments after it happened. The cashier was unable to refund me and blamed my card (which had never been an issue prior and still hasn't). I left after spending half an hour there trying to get the refund but failing due to issues with the refund process. I escalated the incident online to get a direct bank transfer refund. Was a week before someone got back to me, I had multiple phone calls and emails with customer support after this. Was always told that it would get escalated and sorted and was regularly passed on to someone else. Last I heard my claim was being sent to the IT department who would contact and refund me (told this at the end of March). Still haven't been contacted nor have I received my money back months later. Just seems they want me to forget about it. Poor service and essentially robbery from this business. Always liked and used OTR regularly before this. Site ran by a manager with arrogance. Was aking for a fuel discount by scanning app, but reaponded mannerlessly. 👎👎👎👎",
        "Additional_Info": ""
    }
]