[
    {
        "Place_Reviews": "Adina Apartment Hotel Brisbane Anzac Square: I stayed there for 3 nights while on a trip to Brisbane to see family. It is great location, because it's opposite central station, and has bus stops near by, and easy access to all the cbd touristy stuff that you might want to do. The rooms are great. The staff are great. Only downside is that it doesn't have a restaurant which means no breakfast included and no room service. It would be nice if they were able to make arrangements with a restaurant or 2 and/or a cafe or 2 near by to make up for this. That's the only major downside for me. But I would definitely stay there again and recommend it to others. We stayed here one night because it’s close to central station and we needed to get a proper rest before our two day journey back to Europe. Sadly it wasn’t a pleasant stay. Al six o’clock in the morning they cleaned the floors outside our room with an incredibly loud carpet cleaner banging it against our walls and door… We had a quick visit to Brisbane and wanted to stay central to the city. We had a 1 bedroom plus Lounge sofa room.  It was very clean and comfortable, and the location suited us perfectly. The reception staff were excellent. A lovely experience, thank you to the Adina Ann St. team. One of the nicest hotels we've stayed at.  Very conveniently located and quiet rooms that feel fresh, modern and clean. Right in the heart of Brisbane and easy walk to everything. Exec Summ’y: Definitely recommended when you’re able to $pend (it’s a divine experience)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hotel Diana: Great location for us as we went to a concert at the Princess Theatre! The room was large and well appointed, as was the bathroom, comfortable bed, excellent pillows and towels. Very clean and seemed updated. Large TV, tea making facilities. Very quiet. There are several restaurants next door and there is free parking. Great price. What more can you ask for! I stayed to see a show at the Princess Theatre right next door. The staff were friendly and helpful. There's a great variety of dining options close by, and the hotel offers a great buffet breakfast for $25. We had to stay nearby the Mater Hospital while our little boy was in intensive care, and I honestly could not have asked for a more accommodating, caring and hospitable reception from every one of the team members at the Hotel. We had to make multiple changes due to unpredictable nature of the hospital stay and every single time the staff obliged, exceeded expectations and did it with a smile making us feel like anything we asked was absolutely no problem. Great experience. Lovely staff and yummy breakfast with so many options for vegetarians and vegans too. Danny and his lovely team have always taken care of us all these years we have stayed at the hotel. I can't express my gratitude enough for the wonderful team at this hotel. My husband was air lifted from central Queensland to the Mater Hospital with multiple organ failure. He was not expected to survive. The staff at this hotel bent over backwards to accommodate me and the children and grand babies at this very stressful time. Dan found rooms that didn't seem to be there and spent so much time shuffling rooms to fit us in at different times. His support and encouragement made such a difference to me, especially his kind words every morning as I left for the hospital not knowing what would happen each day. My husband has survived and I can't thank Dan enough for his kindness and compassion, a truly wonderful human being. Service over and above when I really needed it.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Treasury Casino and Hotel Brisbane: I I went to this casino a few times, and it was fine at first until one time I got carried away and lost several thousand dollars. I felt it was time to stop and wanted to sign a self-exclusion. When I took out the self-exclusion I signed last year at The Star Sydney, I found that Treasury Casino was also included. I only remembered the person responsible for the agreement asking if I wanted to include The Crown Casino, but I didn't expect Treasury Casino to be in it as well. Monthly meal specials are generally great. Although last month's steak was chewy and they ran out of the red wine only a few days into the deal last month, rather disappointed when we asked to swap with another Red available they refused and only after we bought our own from the bar outside, they compensated us with a discount. The manager really could have done better. We recently stayed at the hotel, it seriously needs a make over. Dull and bland. We wanted to spend our drinks voucher, the bar was closed at 9 pm when we returned. So that was a waste. We walked into the treasury casino for a drink and somewhere to sit. It didn't seem to have many places to sit down unless yr gambling. Was rather disappointed, but found out it was closing its doors and will be reopening in a beautiful building with gorgeous views of the Brisbane river and Southbank, so hopefully will have plenty of lounge seating to enjoy a cocktail 🍹🍸 Today, I went to the casino with my friends, excited for the visit. Upon arrival, the security staff checked our IDs: I presented my Colombian driver’s license, which I have always used without issues at clubs, and my friends showed their German IDs. However, we were denied entry because our IDs were deemed invalid. It’s worth mentioning that the day before, we had been allowed entry with the same IDs. When we spoke to the manager, he explained that entry depended on their discretion and was up to their judgment. Unfortunately, we were unable to enter and felt frustrated by the inconsistency in policy enforcement",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Spicers Balfour Hotel: Had a really great stay in Balfour.  We stayed at the Simla side, Unit 12 and it was ultra quiet, which was amazing because I absolutely hated noise. Four of us went for lunch to celebrate my husbands 80th birthday. The service was slow. Cauliflower was like rubber. Broccoli I had difficulty cutting with a knife. Seafood served in a bowl so couldn’t cut ends with a knife. Friendliness non existent. Wow, what a great spot. Amazing food and exceptional service! We stranded there without proper booking (travel agent's fault)  with 2 small children and the manager on duty was tremendously helpful! Thanks! We would have loved to stay at this amazing place ... but did  enjoy a great dinner! I cannot speak higher of this place. Every staff member we encountered were the friendliest, most delightful people.  Truly lovely staff were very accommodating from  arrival (we we early and enjoyed coffees and breakfast while we waited on our rooms?. The food is incredible.  Our one regret was not dining there for dinner as it would've been sensational based on what we sampled for breakfast & lunch. A very eclectic menu and as someone who travels a lot, so pleased to see creative dishes served for breakfast other than eggs any style.  The gentleman at breakfast was so warm & sweet with my elderly parents as too was Murray. We felt like we were staying with a family host. I truly hope Management reads this and knows the staff at Spicers Balfour are commendable and truly make this hotel a perfect 10 in my opinion.  Also shout out to the lovely bar waitress who was so friendly and sweet. Great location, quick, easy walk to Howard Wharves and river ferry terminal (free city hopper stop).",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Stamford Plaza Brisbane: As per previous reviews the location is excellent but that’s it these days. Rooms are quite dated although clean. Beds are sagging and could do with replacing as well as the first night we both roasted with a sub-par air conditioning control. Was fine going to bed then we woke around 2am boiling hot - must have a control elsewhere that backs it off to save energy?…. Had to make it 19°c the second night to rest properly. While the location and convenience to the office were good, I would personally not stay here again. The staff were friendly, but the attention to detail for price paid and service was lacking. Staff were lovely. The rooms and hotel are very well kept and spacious. Would not stay again, definitely not a 5-star experience. Great place ! Was in superior Room, great view on the river . Very clean ! Massive bath ! Mini bar and comfy bed .",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Chermside Apartments: We recently stayed at The Chermside Apartments for 2 nights, but our experience was marred by a disputed $250 charge for allegedly leaving the room in a \"messy and dirty state\". I dealt with Bryn, who was very unhelpful in his replies. I called to discuss his responses and he claimed the room was \"greasy and grimy\", which was ridiculous given we only stayed for 2 nights, were out most of the day, and didn't cook in the kitchen. On arriving to check in I was told that the secure parking was full and was told to park on the street. No street parking available and we had to park at McDonald’s down the road and walk back to the apartments with our luggage and a 3 & 5 yr old. Our room was very run down, the lounge was broken, paint was coming off the coffee table, the door onto our balcony could not be locked as half the locking system was completely broken off. The kitchen cupboard doors don’t close properly, used cutlery left unwashed in dishwasher. Hole in bathroom door with a sign over it “maintenance aware”. A terrible experience I recently stayed at Chermside Apartments, and unfortunately, I cannot recommend it to anyone. My experience was far from pleasant, as I encountered numerous issues that left me thoroughly disappointed. DO NOT STAY HERE. DO NOT STAY HERE…",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Waterloo Bay Hotel: Rooms are okay, show signs of age. Liked the split level, meant our teen and pre teen were downstairs and us upstairs. Food was excellent, steak was cooked perfect, staff were friendly and accommodating. Only complaint about room was broken tap in bathroom.  Beds were great and loved little patio. One employee in bottle shop was quite rude to us when there was absolutely no need for this. We have stopped here a couple of times with my Wynnum mate for a bite to eat before going across the road to the Bayside Cinemas. Our choice was the covered beer garden area with bar service, and order food at the table QR code. Good service, good food, and nice atmosphere. If I could give this pub a negative rating for service I would. We walked to this pub after a lovely night at a comedian. When arriving we got some drinks and went and sat in the back of the smoking area. This was only around 10pm. We then hear a yell from a man at the door saying we have 5 minutes to finish smokes and get back inside. This was a disgusting way to speak to a bunch of ladies I assumed he may of been speaking to a louder bunch closer to the door. Then a few minutes pass by and we are getting yelled at to get back inside the smoking area is closed. Everyone was confused so the staff member continues swearing and says that it’s routine cleaning they do this every night and we need to get out. Half of us had not had any alcohol and were treated so poorly by staff with no respect - For no reason we had only just arrived. I sympathise with staff of a pub as I’m sure they deal with a lot of grumpy drunk people but the way they spoke was shocking to say the least. Disgusting service, awful way to end a night. I will not be returning here and I wouldn’t recommend any one else visit either.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Kirkland House: Well what a pleasant surprise for experiencing Olde Worlde  accomodation in the heart of suburbia. My room was very well presented & a suitably presented light breakfast for next morning. Good to be able to park in backyard for more security. Well recommended for a night stay or longer. Well positioned to access places easily. I've stayed here a few times. It's good value and the location is very convenient. There is public transport on your doorstep and and you are within a short walk of two different entertainment / food precincts. There's also supermarkets very close by as well as a 24 hr petrol station & a 24hr Micky Dee's. The house is solidly built so you wont hear the people in the next room. This is a really lovely setting and located in a quiet street close to Brisbane city. The room was clean, comfortable and the host was very friendly. Highly recommended. This \"hotel\" can be totally different to what you could expect to be... There was nobody welcoming in the entrance or any friendly sign, it seemed like a creepy abandoned house, and when we went to main entrance to knock the door the housekeeper just told us why we did not get in from the backyard door as that door was open.  The room has all the basic you could need and was pretty clean but the breakfast was not what we were expecting.... Basically just packed cereals and bread, no fruits or any other facility, besides of the fact that you need to make everything by your own, this is not well explained in the Booking sites.  We just checked out from this hotel leaving the keys in the room door because the housekeeper was too much strange to going to look for her. I stayed there 4 nights and it was really comfortable! Everything is well  organized.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mercure Brisbane Spring Hill: Felt well valued and some beautiful touches in the room. Very clean, great toiletries, very comfortable bed, big TV, and a great choice of tea and coffee, pod machine was really appreciated. Thank you for the fruit!  Had a delicious meal in the restaurant. Check in and check out was effortless. I stay here often and it just gets better. Highly recommended and really good value. The staff are consistently welcoming and knowledgeable. Staying on the edge of the inner city was great. The free shuttle bus to Queen Street is at the front door.  We had dinner at the hotel one night and it was exceptionally good.  Drinks downstairs in the alfresco area most afternoons was also very pleasant under the heaters.  Would recommend and will stay again. Location isn't perfect unless you like walking slopes every day for at least 5 minutes from Roma Street Station. What a great addition to the ACCOR group.  Well located with fabulous views.  The room was quiet with a large balcony.  Staff were impressive and always keen to serve.  The restaurant offered a nice breakfast and good Italian food options.  I didn't use the pool (winter stay) I was in Brisbane for 5 nights on business, never stayed at this particular premises and was pleasantly surprised with the stay. All the amenities I am seeking, nothing too hard for staff,  quality service and products. Menu at the little restaurant was limited but very nice, wine list a little on the lower end of the quality spectrum (i am a winemaker so slightly higher expectations) but what I had was good and very easy. Overall, I will be back.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "C'est Bon Restaurant & Le Bon Bar: Our first dining experience here was Chef Charlene’s Hiraya special with elevated Filipino cuisine. It’s amazing how C’est Bon supports budding chefs. We had the degustation 7 course diner, an amazing culinary journey, wonderful food, our taste buds we singing.. Great themed selection. Only gripe is I wish the courses could have been spaced apart,  having them served in quick succession felt very rushed. In all it was an excellent evening. I recently celebrated my birthday at C'est Bon, and I must say, I was not disappointed. True to its name in French, the food is indeed delicious. The chef's selection menu offers a wide variety of dishes that guide you through the menu seamlessly. It's a great value for money, with a fantastic atmosphere and attentive service that pays close attention to detail. I highly recommend this restaurant! What a fantastic French restaurant.  1st time for lunch and the food, service (thanks Grant) ambience and wine selection were wonderful.  The oysters were exceptional, and 2 favourites were the wagyu tartare with truffle (added) and the quail main dish... both exceptional.  Everything was great and highly recommend. Went to C’est Bon for dinner. It was a cold night but it was colder inside than outside. As soon as you were taken into the restaurant, it hit you. We raised this with the person who showed us to our table and she responded that the waiters get hot running back and forth. But she adjusted the air conditioning and it made an immediate effect. However, she was right as the waiters soon adjusted the control back to cold. It is extremely rare to see people eating with their puffer jackets on! That’s how cold it was.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Brisbane Holiday Village: I had the pleasure of staying at Brisbane Holiday Park for 2 nights during the State of Origin last week in the 2 Storey Penthouse Cabin. The facilities were fantastic—clean and well-maintained. We enjoyed a great breakfast the following morning, and the staff were incredibly friendly and helpful. Highly recommend Brisbane Holiday Park! We recently stayed here for the long weekend as we had a few events to attend to in the area. We stay here on our regular visits to Brisbane. It's so convenient to the shopping centre and bus terminal to get into town. We usually stay on the spacious caravan sites but this time we stayed in a cabin. It was extremely clean and comfortable and equiped with all your basic needs; you simply need food and clothes. Staff are very helpful and Geoff, the owner, went out of his way to assist us in our hour of need. Absolutely love Brisbane Holiday Village, so much so that a few family vacation stays turned into long term stay! The owner Geoff is super hands on and often see him round the park making guest feel welcomed and organising amazing events at the village. Reception team are very friendly and great to ask for local hot spots or what’s on. Special mention to Christine, who has always provided top customer service and guest support.  We have stayed in the penthouse suites, Cosmo Cabins and Alfreso. Nice comfy, clean & spacious rooms with a holiday feel. Lots of things to do from mini golf, big pool with heated kids pool that’s got a fun design. Westfield just down the road with delicious restaurants and shopping. Bus stop right outside express to the city. Beautiful wild life can be spotted hanging out at the village too so it’s a great spot for everyone! So much more to say, but highly recommend staying here! Beautiful park, well maintained with spotless bathrooms and laundry facilities. Amazing pool area next to a licensed cafe.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Manly Marina Cove Motel: Beautiful location. Stayed during a family event nearby. Lovely rooms and bed was perfect for a good nights sleep. Love being so close to the water! Met all the needs we had during the stay, staff are all super friendly and no issues with anything we needed. Would stay again if needed and definitely recommend! Great location. The rooms are clean with soft, comfortable beds and really good pillows. The receptionist who checked us in was efficient and friendly. Other staff we encountered were also friendly. There are plenty of car spaces.  We were here for a kids' sporting event, which was a 30-minute drive away at the redlands showgrounds. Great location, very clean spacious room with comfortable king size bed. Excellent accommodation, really clean and extremely quiet. Wifes comment: \"This is better than many of the big plush hotels we have stayed at!\" We spent a few days getting a feeling for the Manly-Wynnum area so this was a great central spot to have as a base. Added bonus was we received some great advice from the friendly staff regarding local amenities. Totally recommend this place!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai On Rode Takeaway and Delivery: Terrible meal. Spring rolls had long black strip's through the vegetable..was it burnt onion or something else?? The Pad Thai ..smelt and tasted like anything but Pad Thai. How you call yourself a Thai Restaurant and stay in business is beyond me! Improve your act or close down. Really, really disappointing for a local restaurant. I've been here a few times and it is consistently good. Best Thai around! Also the staff are always friendly. Ordered online directly with them as they advertised \"WE NOW DELIVER\" as I don't like to use food delivery services as the prices are increased to cover costs and see plenty of bad reviews about these services. Massaman was bland and beef was chewy. Chicken in the fried rice tasted horsey. Chicken satay did have lots of sauce and curry puffs were pretty good. Overall, probably would visit again. The Masaman is completely tasteless and dry - very disappointing. The satay chicken was nice.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Puffers Inn Logan Motel: My experience at Puffers Inn has been awesome.  Staff are 100% and the rooms are comfortable and value for money. A must if you choose Puffers is the pool and heated spa. A lovely BBQ area with all cooking needs supplied. Any problems the management is straight on it. The rooms are serviced regularly by professional staff. Family friendly and no b/s tolerated. My children felt safe and enjoyed every minute. Thank you guys for an awesome stay and we will definitely stay with you again. 10☆. Management are excellent, very friendly and very helpful. Friendly staff. HUGELY impressed. Upon checking in it was obvious that someone had smoked a lot of cigarettes in the room and the stench had permeated everything. I asked Tristeen at reception whether anything could be done. Try as she might she was unable to replicate the booking with a new room. Oh well and left it at that. Came back from dinner around 9:30pm to find Tristeen and a colleague cleaning a new room for us. This definitely wasn't her job and the overtime and extra effort was next level. Of the (literally) thousands of hotels that I have stayed in over the past few decades I can't think of an instance where someone has gone so far to make a difference. I'm humbled and grateful. Thank you Tristeen and your accomplice for doing that. Unexpected and exemplary. I don't recommend this place at all!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Morgans Seafood Market & Takeaway, Scarborough: Month of visit May 2024 I love Morgans Fresh Seafood  in Scarborough Absolutely fantastic selection of fresh seafood, you won't find better in SE QLD. The takeaway fish and chips is well prices and great quality. Nice outdoor eating area or if it's busy head across the street to the park. We came here on a weekday, plenty of parking and seats outside the seafood market to eat our fish and chips. The flathead and cuttlefish we got was nice, the chips are average, if it was a bit more crispy would’ve been better. Generous amount of chicken with the chips and they even provide plenty of salt packets on the side, that’s a bonus! I came here with a LOT of expectations, but was so disappointed with the food.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hotel Grand Chancellor Brisbane: Really nice hotel and helpful staff. Food and drink is also good. Bar prices bit extra and it closes at 10pm. It's located on top of a hill so taxi back is needed if you don't want a steep walk. The rooms are spotless clean and well maintained, but our Aircon was not cool enough for us and because of the road noise we needed to keep the balcony door closed. Nice pool and sun deck on the roof Location ok. Very hilly to get anywhere. Had a small pool at the top and gym . A few steps to get to them though . Staff are lovely and the hotel is clean . We had a balcony but a bit small for chairs or a table to go on . There was a fridge and complimentary milk and water . Bathrobe and slippers. The shower gel , body cream was lovely. The breakfast was ok but I like omelettes . Same food each day. There is a car park. Taxis are reasonable $12- 20 to get around. There is a park opposite. We did have the problem with the air conditioning just couldn’t get the room cool enough. Even though it was nice I would want to stop closer to the centre. We spent quite a bit of money in taxis. You definitely need to be a good walker. The hotel met our needs and the staff was very friendly and helpful. Room was clean, but could have a few more upgrades. A few things to know before you book. My husband and I, along with our seven year old, recently stayed here for a weekend getaway. The staff were very helpful, the room had two comfortable beds and a new large tv. We loved sipping on Prosecco while listening to local talent (live music advertised each Friday and Saturday night). The buffet breakfast had a large display of tasty food. Our daughter loved the pancake making machine!! We will definitely be staying again. Stayed with my son for the football game at Suncorp. Friendly welcome, clean room, my favourite was the happy hour, $1 chicken wings and a nice atmosphere inside with the live music. Wish there was a bit more atmosphere sitting outside. All in all, we had a pleasant stay, thank you 😊",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Metropolitan Spring Hill: Spent 1 night here in room 315 thanks to my son not being able to accept a gracious offer from hotel manager, Haydn Puata. Room is huge and has everything u need for an overnight stay. Reception staff were very friendly when we arrived. Parking is located underneath and is a bit tight and is limited, so it's first in, best dressed, but still very grateful that the motel supplies it. Room very clean and quiet at night. CBD is just a 15 minute walk so the location of the motel is pretty good. We will definitely book in this motel again next visit to Brisbane and so glad we got the chance to stay here. Wise tactic of the manager, as he now has 4 new clients that will come back again and again. If you're looking for something a little less exuberant at an acceptable price with a compy bed and all your needs, you can't go past it. Clean enough, friendly staff. PARKING SPOT IS NOT A GUARANTEE & NOT SECURE! “ANZAC Day nightmare” The accommodation is in a great location, with restaurants and shopping close by. Parking was available, at no extra cost. The rooms were well maintained, and the staff were friendly and helpful. I will be staying here in the future for sure.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Coopers Colonial Motel: Unfortunately our stay wasn’t the best, we stayed in the family room. Room definitely needs an upgrade. Had small cockroach’s 🤢 air conditioning barely worked and to top it off we went out for 3 hours and put the sign that asked for the room to be made (the cleaners saw us and were in the room near by when we left) yet when we came back the cleaners didn’t come in how disappointing what is the point of a sign yet the cleaners don’t care?? I was super disappointed with my stay here. It's nothing like the online booking photos. Beware. The room we had was as unloved as a red-headed step child. The floors were still sticky from a previous stay, the bin hadn't been emptied, cracked basin, mold on the shower. I should point out there's was no management onsite on the weekend we arrived. Instead, my name was on a whiteboard with a room number assigned next to it.. I called the number on the reception door and was told the room is unlocked, the key is inside. Not having any management onsite also leads to those in other rooms having parties and hanging out noisily in the car park. For $240 a night I feel ripped. On the bright side clean linen and bed but let's face it, that's the minimum expectation. Tea and coffee had also not been restocked which also has added to my unfavorable review. Couldn't sleep in because of the birds that seem to have made this place home oh and it's in the flight path of Harrisfield airport a few blocks away. Don't bother with this place. Excellent Service and staff , looked after us and made sure we Comfortable room. Only recommendation is they add mugs to the kitchen items available rather than tea cups. 🍵 Location is great due to Foodary next door for anything you need to stock up with/snacks etc. Room is clean and comfy but cutleries and kitchen wares a bit dated (i.e. stains on the cup) Complimentary coffee and tea doesn't seem to be fresh and there's no milk to make coffee.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Scherhazade Indian Restaurant: The food was very nice however the serving was quit small for 20. We ordered two dishes and asked the waiter if it’s good to share and she said yes however when she brought them out they were the size of my hand which was surprising considering they were around 22 each. What made me full was the bread we ordered. The food was great but it would have been better if the serving was worth the price. And maybe some music considering it was only us and another table so pretty quiet 😅 Excellent Indian food. We are new to the south of Brisbane and we have tried all India restaurant in this street. This was the last and we didn’t want to come as it’s always empty but don’t let that put you off. We were very surprised. The food was wonderful and this will be our favourite and regular Indian hangout. We will see you next weekend. BYO drinks and friendly staff. Good Indian food! Love this place! Easily the best Indian in town. Everything is made to order and the flavours are intense. Nice to eat in too. This is a weekly regular of ours. Their curries are amazing and made fresh to order - there are no bain maries here. Definitely the best Indian in town!!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "McDonald's Cannon Hill: I just had the worst experience with this store tonight. I got 2 cheesebugers and chips to take away and I found there is no patty on both burgers. Also my kids had diarrhea after eating chips. What a nightmare and the store absolutely ruined our night! This place is disgusting and the school teens that are allowed here that do not get told off or to leave by the staff is even more disgusting and ridiculous. Makes your store look horrible and filthy the mess they make and the noise and the disrespect they have for other people and children coming in and out. I’ll never bring my small children inside again. Do better honestly. Don’t even bother going here during late hours they either say their system is updating so they don’t have to serve or they give you the stingiest servings. This happens every time I come here thinking it will be better. Paid for a medium frappe and  took this photo as soon as i got it before i drank it. Tasted like coffee but it was “chocolate” Wasn’t gonna bother going back because the manager drags his feet around like he hates the job he chose to have. I worked at maccas so I know the work ethic of some, the grossness behind the counters and how easy their job actually is. But I moved on at 16, maybe old mate should too. Morningside isnt any better either I bought a Large Decaf latte through the drive through this morning on my way to work. Undercooked chips, forgot ketchup and the coke was flat. Big Mac was good.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai Terrace: Super delicious. We ordered Thai prawn fried rice, Chicken Laksa and Thai Pang Chicken Curry with a spicier taste and more authentic Thai taste requests. Visited on a mums night out and we found them to be very patient and accommodating. They adjusted really well to some dietary requirements and provided great service. The food was lovely too. Very lucky to be surrounded by some great restaurants and Thai Terrace is one of them. They also accepted 8 split bills without any fuss. Went for dinner with friends.  The place was totally empty, the service was non existent, the chicken pad see ew had no chicken in it and the calamari was cold.  Very disappointing all round.  I see the owner comments on these reviews so if you're reading this get some staff who actually want to wait on customers and not sit behind the counter ignoring them and put some meat in your meat dishes.  It's not that hard. We had dinner to this restaurant on Sunday night, it was the worst experience we ever had from foods to service. The Pad Thai we ordered tasted like instant noodles and very sweet,  We asked for fresh chilli to make it tastes better but we were given with sweet chilli sauce which it made it worst and it took 10minutes to arrive. We had to look when is our chilli comes. Quite often eat here when going to the cinema. Great customer service, super friendly staff. Last night after we had our chicken pad Thai and masaman beef, both as usual extremely tasty, we had the opportunity to speak with the owner of Thai Terrace. A very lovely lady who was more than happy to spend time chatting with us. Do yourself a favour if you're in the neighbourhood drop by for dine in or takeaway deliciousness",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Astor Metropole Hotel: Room completely dirty!!! Me and my boyfriend we spent some days there and the courts in was broken and pierced we couldn’t close the courtain, they told us they will fix for us, but nothing happened. Room 1405 - Close to the CBD, comfortable, great balcony view of city facing north, huge bath/ shower, very comfortable bed, full smart tv all for $130. Would stay again. As someone who's been working/staying in different hotels from 3 to 5 stars in Southeast Asia & Australia I can confirm: this is the worst hotel/motel that we've ever stayed in our lives. Have a very bad experience with this hotel , water was coming from the floor , terrible room and hygienic was not available. Receptionist are rude, most of them are so arrogant. Not very clean place, floors and the bench tops were all sticky like it hasn’t been cleaned in months.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "McDonald's Cleveland: Stale cold chips! Absolutely appalling response when calling to let the staff know they had messed up our order and that when receiving it delivered only 4 min away from my house that it was stone cold. The staff member that answered the phone didn’t even acknowledge that it was McDonalds I was calling. It was “HELLO” I had to ask if this was McDonalds. The lady then began to yell at me telling me she is only 19 years old before hanging up on me. Absolutely disgusting. This is the second time in 2 weeks we have orders from the Cleveland store and it has arrived could and or wrong order. I rarely give 1 star but this by far is the worst maccas ive been to and I'm hoping with this review McDonald's in Cleveland will take notice. Always served flat and warm drinks cold chips and on the verge of stale burger buns. Quality very poor. Shrinkflation hits Maccas again...big probs with the new big mac menu aren't your fault but still getting the order wrong and half portions of fries? They didn't have half a star option, so I had to choose 1 star.. Take the 24-hour sign down and put it in the bin with your service. I just wanted some below average food, but I couldn't even get that cause they weren't serving any food at 3:30am",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pepe's Mexican Restaurant at Jindalee: Our experience with Pepe’s was great! The food and service was amazing, and we really enjoyed it. We chose to sit outside, and they even turned a heater on for us! I highly recommend the Burrito, and the rest of my family recommends the Sizzling Fajitas. Thanks for a wonderful lunch! 🌮🌯🍽️🤩👍 Pretty good Mexican restaurant, food was nice, so was service, and even had a large variety of drinks especially sodas! Great Mexican food and service, didn’t get a chance to review the cocktail menu, but it looked pretty good! We love Pepe's because it's just straightforward good Mexican food. We love the chili con carne as a side to anything we order! People always go for the burritos and the enchiladas but in my opinion the empanadas are a quiet winner. They are cooked well and very flavourful - I always order guacamole and sour cream on the side as well. The salad in the empanadas is perfect to cut the richness in between bites. The food is amazing and I frequently visit this restaurant. Service, food quality and the overall seating arrangement is all too good!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Steve’s Hotel: its great having a pub you can walk into at anytime Someone needs to evict the junkie staying there who’s bashing people terrible service, terrible food and terrible staff. Went there for a very important birthday meal. The staff were rude and un-professional. They dint know how to make drinks properly and the serving was messy and my drink was split every where. We waited 30 minutes for entrees and then it was a further HOUR AND A HALF till we got our mains. May I state that it was a Tuesday night and not , many other clients in the room. The food was over [priced and poor served. if you want a decent night out; NEVER GO HERE. Dinner Tuesday, restaurant didn't have a kids menu or entree sized meals had to resort to limited bar menu. Ended up with very average pizza, steak and bowl of chips. Definitely not a family/child friendly pub. Also no lemon or lime for Corona's !!! Get rid of Steve the squatter that lives there",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Caravanserai: We tired lots of entree and main options as you can see from the photos. All of them were great. Specially the feta bread. Very happy with everything. We dined at this Turkish restaurant on Friday night, having made reservations beforehand. Our table was set and ready upon our arrival, courtesy of the incredibly friendly staff. However, the restaurant was so noisy, making it hard for us to converse, we could barely hear each other. There was also a notable wait for our meals, which, while satisfactory, didn't particularly stand out in flavor. Apart from the noise, the setting was cozy and welcoming. Overall, a mixed experience with some room for improvement. The food was on point! It’s a hidden gem in the city ❤️ the service was quick. Food was served in generous portions everyone was happy! Someone recommended this restaurant and I must say we absolutely loved eating in this place. Excellent restaurant. Very friendly greeting. Great service and wonderful food. Highly recommend and will certainly return. We were there for lunch and totally enjoyed the experience",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Namaste India Authentic Indian Restaurant: Bland. First time ordering from here. Only tried this place because our usual was not answering their phone. We called and made our order and was told there was a 45min wait. Upon arrival they had one of our dishes as a Tikka Masala instead of Vindaloo. Had to wait another 20min. Super bland madras and vindaloo. The hot vindaloo was not spicy at all. Thin sauce for both. Saffron rice tastes and looks like it has no spices in it. The vegetable samosa was nice. This was my first time trying this restaurant and I won’t be back! We were a group of six that dined here for the first time on the weekend. We were welcomed by the young staff member who showed us to our seats inside. It is quite noisy inside when people are talking so we sat outside. The waitress was very helpful when we asked for something not the same, as the menu. In the end we stuck with the menu and she gave us good suggestions. The food was served very quickly, and was very tasty and enjoyable. The one dish that was suggested was goat. As we have never tried goat before we took her up on her suggestion. Didn't rate it. Everything else was excellent. As a first-time visitor to Namaste Indian at Eatons Hill, we were delighted with the experience. Although it is a small venue at the back of the small shopping centre, we found a gem of Indian flavours. It was a balance of spices and seasonings and full of flavour. Then aromatics of the chicken tandoor, creamy curries, with every bite being a delight for the senses. The menu offered a wide variety of options across the Indian flavour range. The chef special goat curry was absolutely scrumptious. Namaste is without a doubt the best Indian Restaurant around. Have been going here for years and have turned so many of my friends and family onto them as well. They make authentic, delicious food and have the most friendly service. They are amazing Delicious food. This Indian restaurant will not disappoint. It’s an absolute gem and we will continue to support such a great little place in Eatons Hill.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Yiros Shop - Cannon Hill: DO NOT ORDER DELIVERY (door dash)!!! Took 55mins and was cold. Driver blamed restaurant and also admitted to getting lost. We are 7mins away! So disappointing as this was a special treat for kids. I tried their beef yiro and the taste was good and satisfying. The atmosphere and there of the place are wonderful, relaxing and gives you a Greek vibe. The lamb yiros & chips are top The Yiros Shop Cannon Hill offers fantastic food at great prices. The Yiros is tasty and freshly prepared. While the service can be a bit challenging to get, the overall experience is excellent. We have come to Yiros Cannon hill several times and have never been disappointed - quality food at a good price point. My go to is the Yiros Plate - chicken. Fantastic!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai At Home: Review is for takeaway order. Tasty meal with outdoor seating along the strip of restaurants at St Lucia. Came here for lunch and tried the pad thai and it was amazing I highly recommend Pad kee mao lunch special was the bomb! Love me my drunken noodles and this is one of the few in brisbane that have hit the spot for spice and flavour. Love! Lovely lady running the place, cute set up and delicious tasting food. I'll be back! Terrible bland food. Left the duck curry full after tasting it once. The “charcoal beef” came out very rare. We asked for it to be cooked more as my wife is pregnant. Sent out again raw after 1 minute. Asked again can we please have it cooked through. It came out deep fried to a crisp. Not a hint of bbq flavour just greasy tough inedible meat.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "One Thornbury Boutique Bed & Breakfast: I couldn't have possibly expected such a fantastic time at Michelles bed and breakfast. Best accommodation ever! It is one of these places where you can see they truly care about their guests, and they want to make your stay as pleasant as possible. From now on, every other place I stay in will be judged against this one. Heritage house with spacious clean rooms. Perfect location, walking distance to supermarkets, restaurants and other amenities. So many little details to love about it. It is clear the care and love they put into everything. The 'chef-inspired' breakfast is to die for! Well worth the price you pay altogether. This is my 'go-to' B&B from now on whenever I'm in Brisbane. 10/10! Comfortable and well located accommodation in Brissie. Very good value with a charming and well mannered proprietor. If I was to have an honest whinge, there was no milk in our room for a coffee. That being said it's probably our own fault as we arrived early and he had to rush to get us in . Parking is limited. Always a very relaxing stay. Professionally run by Geof who goes out of his way to make everyone feel welcome. Helpful with tourist information & the latest happenings in Brisbane. Located so close to the city & the valley, although still amazingly quiet. The breakfast is always yummy with little changes so it is never boring if you are a regular. Awesome heritage home so well set up for a B & B. Very comfortable and wonderful host. Breakfast is excellent the best ever when staying at a B & B. Nice walking distance to the river where we enjoyed a river boat trip back for dinner from the huge range of restaurants. Thank you.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sunnybank Hotel: I recently had the pleasure of visiting Sunny Bank Hotel for the first time and it exceeded all my expectations. The food was absolutely delicious, offering a variety of flavors that catered to all tastes. The ambiance was perfect, with a warm and inviting atmosphere that made the dining experience truly enjoyable. I have stayed here a few times now when business takes me to Brisbane.  All the staff (from hotel reservations to bistro, bar etc) are helpful and friendly.  Yes, the rooms are older style, indicative of price point, BUT the bed, linen, and doona are not.  Great night's sleep.  I also love the fact that you have everything there.  A room, bistro, bar, gaming etc. The team and the atmosphere here is sensational 👌,  always a pleasure eat and drink here, a shout out too, Jacob, Katie, Dani, Angelica, your service and attitudes are always second to none! Keep up the good work guys and girls Haven't been since the renovation. Looks great more modern. The menu is great, good to see different things. Our meals were delicious. Enjoyed our time here. Recommended This is a fantastic place for food, drinks, live sport or pokies. They've  got 3 massive screens playing all the popular sports and they always have the current live games playing.  The food is always done perfect and staff are super friendly.  Its spacious and the decor is very nice. Love it.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "punjabi Indian Restaurant: Wawa (wow in Hindi) HIGHLY RECOMMEND. Always dine in though!! The dine in food is exceptional Indian cuisine and I highly recommend it to anyone looking for an amazing curry. I cannot say a bad thing about their dine in food as it has been consistent and exceptionally fantastic. The service is also very good with the waitress being extremely polite. Please consider the dine in food is quite different to  the takeaway/delivery experience. We have eaten here a lot over the last few months and can safely say that dining in is the only way to eat this food. I've read reviews about their delivery service and I can tell you they are not wrong. We ordered delivery and they had forgotten some of our order but thankfully we live close enough that it wasn't too much of an inconvenience. They did give us a free can of coke which was a nice gesture.  We've had takeaway and whilst it is still good food it is a 'watered' down version of their dine in curries and their naans are never as fresh and can sometimes be overly chewy. It did also take just over an hour for the food to be delivered. I do not want to deter anyone too much from getting takeaway from here but I would advise that if you are after the proper food experience you should dine in. Dine in 5/5 - Takeaway 3.5/5 - Delivery 2/5 Good service with friendly staff and quick meals. However both curries were very sweet (they shouldn't have been sweet at all), almost disgustingly so. I don't understand why they feel the need to dump so much sugar in at some of these restaurants. It's not authentic and tastes horrible. Behind the sweetness the flavours were quite nice. Will never go back. Worst service. The waitress was so rude. We went around their lunch break time, and she kept coming back to our table every 2 minutes to say \"the restaurant is closing soon\" as soon as our dish arrived. We tried to order more naan but she refused and said the kitchen is closed now. Then she started cleaning our dishes before even asking if we were done. This all happened less than 20 minutes of sitting down. We just wanted to leave at that point so we paid and was leaving, and she yelled at our back saying \"Wait! Is the card approved?\" and held us at the door as if we would run off without paying for 20 something dollar lunch. Such a shame, used to go here all the time and recommended this place to friends, would never be back after this horrible experience and I recommend you do the same. Have eaten at this indian restaurant a couple of times, each being good. The butter chicken is by far the best dish, creamy and not too spicy. Garlic naan is also a favourite.  The service received here was okay, with the server returning throughout the meal to check if we were going alright.  Ambience inside the restaurant could be improved however it was acceptable.  Will definitely return, authentic Indian at a reasonable price.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Springwood Hotel: I had an amazing dining experience at Feast Springwood! The food was delicious, with a great variety of option. The ambiance was welcoming. But what really made my visit stand out was the friendly and attentive customer service. The staff went above and beyond to ensure I felt taken care of. Highly recommend Feast Springwood for a great meal and a wonderful overall experience! Great food selection and decent price. Always hot and fresh. It would be nice to change it up a bit, as everytime we go, it's the same options. But otherwise a great place. Wow ...what can I say Have been many times for meals at The Barra Bar and have always enjoyed. The last 2 times have been disappointing having to wait far too long for our meals. Yesterday afternoon 1 meal was burning hot and the other barely warm, chips not hot and salad leaves wilted. Change of chef/staff? Always have a good time atmosphere is uplifting great lighting staff are always there smiling ready to help how ever possible. Just a great place to spend time with friends or family or even strangers who become friends.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bearded Dragon Hotel Tamborine: Brought family here for dinner on Tuesday 30/07/2024. Atmosphere was nice, 5 tables of people compared to my previous visits on a Friday and Saturday where it has been quite packed. Absolutely an amazing room, with a shower that you will not want to stop to the spa bath, these room have a high standard to quality with air-conditioning that works to storage for you clothes and they even provide a bench seat out front of your room with a delightful table. Celebrated my son’s 21st here. We flew over from New Zealand. Food was tasty, good service and amazing views. Very satisfied and we shall return! Tamborine Restaurant We booked the donkey picnic and it was the best thing we did on our holiday!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Ainslie Manor Bed & Breakfast: This place was beautiful, quiet, well maintained and homely. The owner was a lovely lady to chat too as well, very friendly and kind. Breakfast was good too. A decent variety of options. It’s safe, easy to come and go through the self serve access codes and really close to shops and restaurants too. If you’d like a home away from home vibe, it’s definitely perfect for it. We stayed at Ainslie Manor for over a week.  Lynne made us feel right at home and our room was lovely and comfortable. Breakfast time was always entertaining with meeting other guests from around the world. We would definitely stay again. Thanks Lynne!!! 🤩 A really damn good place to stay, very comfortable, very quiet, room was clean and had pretty much everything we needed, and the beds were comfortable. Everything was easily worth 5 stars Beautiful experience We enjoyed a lovely stay of 3 nights. Room comfortable and roomy with outside balcony overlooking pool. Excellent value - continental breakfast included. Host Lynne was wonderful and kindly dropped us at the station on way out. Very happy to recommend.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bangkok Milton: On a cold night, these Barramundi fish and chips with a big serving of salad were very nice. Well cooked and delicious 😋 The food here is the best Thai food in Brisbane . Their pineapple fried rice is amazing. The restaurant has a lovely atmosphere. They Also serve Indian food. The prices are good. You won’t be disappointed eating here. I recently dined at Bankon Milton and had the pleasure of trying their Massan Curry and Chilli and Basil Duck Stir Fry. Both dishes were absolutely amazing! The flavors were rich and the ingredients tasted incredibly fresh. 😋 Not only that, but the portions were also generous. It's definitely a five-star experience! ⭐⭐⭐⭐⭐ The best tasting Thai food that I've found in Brisbane, all the dishes had plenty of great flavours, spice level and plentiful sauces. Quick and easy to order and better than average prices with generous servings. It would be great to see a more environmentally friendly approach in the future with takeaway bags and containers. We had a problem with the delivery. We informed them and they immediately contacted us.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Victoria Park: Hands-down the best putt putt course I have ever been to. Staff are lovely and the grounds were immaculate. All 18 holes are unique in their own right and had 3 different types of difficulties. This is a great place to bring any ages. They also have a QR code that let you keep scores on your phone and order drinks from there as well. Highly recommend and will definitely be back! This is a spectacular venue both in the day or night for an event or wedding. The food has been fantastic every time I’ve been as well. There are so many ceremony spaces available and is located so close to Brisbane city and accommodation. It never disappoints! Great open spaces for just going for a walk My wife & I have not been here for many years. Today, we bought our daugthers to the bristo for late lunch. The burger were amazing and the food was serve within 30 mins. The service was very good. We will need to make some time to come back here for the putt putt. My daughter (in pink last year) and I (in blue) have been coming to Victoria Park every single year for Melbourne Cup.  We make it a special day just for the two of us.  This year Victoria Park Golf Club have decided that you must buy tickets in 4, 8 or 12 and I was told point blank on the phone that they could not accommodate us for two seats - Poor form Victoria Park!  Your customer service is zero",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Moda Steak . Tapas . Seasons: The best pate and octopus salad i ever had! Their carrot puree was on point oh and the meat... so tender! Everything. Duck liver paste was wonderful, octopus was average, drinks were average. My partner loved the steak, I felt it was alright. All in all, food quality is not bad but it doesn’t worth the money Great night out at Moda. Service was to a high standard. Fit out and atmosphere was fitting (loved the exposed brick and truss structure). Food and wine selections were plentiful. Highly recommend any of the steak selections (you cannot go wrong). Very much enjoyed the octopus, scallops, and figs tapas though a little underwhelmed with the paellita. Will definitely return Solo dinner. Waiters were perfect and the sirloin was absolutely insane. Great Spanish wine selection too. Loved the scallops with the cauliflower escabeche and jamon, was cooked perfectly. Food was $84 so not a cheap dinner but still felt like very good value. Will be back. I loved this restaurant! We went here for dinner, I let my friend to choose everything he wanted to share and everything was so amazing! Even the waitress was adorable, professional and polite.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Gunshop Cafe: Spacious and comfy ambient to meet up friends for gathering. The best brunch I’ve had in a long long time, very delicious avocado brunch with well paired toppings that made it better than others I’ve had! Coffee was great too, polite staff, nice atmosphere & clean! Would highly recommend if in the area! Loved the food and juice here! Smoked Salmon Eggs Benedict was perfect, though a bit pricey, and the waitstaff was knowledgable about the food which helped me find something to fit my dietary restriction. The food and coffee is absolutely perfect. The atmosphere was great, we sat outside was lovely watching the traffic go by not that busy. The service was excellent the staff were very friendly and food came fairly quickly This is an absolute stunner! Hash cakes coated with a light drizzle of sour cream. We added on the roasted tomatoes and spinach and it was a banger of a meal.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lefkas Taverna: Pleasant place with Greek-themed decor. We ordered lamb shank, it was quite salty, but overall it was good. We also ordered moussaka, which was tasty, but a little cold in the middle. Absolute great food. Big platters - definitely enough for 2. The quality of the food is great. Service wasn’t as attentive, but that wasn’t too bad for us. Drinks were good. Overall great dinner. If you’re looking for authentic Greek food then this the best place one can visit.  Their food is amazing and their starter is enough to fill your stomach.  They provide their meal enough for one person, good amount of quantity. We went 5 people and we couldn’t finish everything so we bought back our food in containers. Their fish is awesome 🤩 atmosphere is ok if you’re sitting inside though outside is better. Service is fine. Overall I would recommend this place EXCEPTIONAL. After hearing nothing but rave reviews from friends about Lefkas Taverna, we booked in for lunch on Saturday. The whole dining experience was nothing short of perfect. The vibes were great, the staff were attentive but not intrusive and as far to say as warm. They were just a delight on every interaction. With Greek cuisine being my favourite, I was exceptionally excited to visit Lefkas. And was not let down at all. The menu is diverse and the food was incredible! The zucchini and feta balls, dang! So so good! We had about 7 dishes and they were all incredible. Excited at the thought of returning. True, genuine, high quality Greek food for the win. Beautifully delicious food and friendly staff. The Italian waitress was delightful in helping us pick from the menu to satisfy some hungry women. The cutlets, halloumi, lemon potatoes - cooked to perfection! The Ouzo was a lovely way to finish it off 🧡 Also the outside heating was perfection on a cold winters night.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "E V Fish And Chips: We stop in here every chance we get. Their chicken thighs and crispy pork are absolutely to die for and the service is some of the best I've ever had. The young man there always makes us feel welcome and picks out the biggest pieces of pork belly for me. Today they were selling home-made cupcakes as well which were phenomenal! The cupcakes were better than anything you'd get from a bakery and their fried meats are better quality and value than any restaurant. If you haven't been there before I heartily recommend them! I’ve been to the store three times and Kenny has served me every time. Kenny has exceptional customer service. He is super friendly, constantly works with a smile and is a valuable member of the business. The country fried chicken is delicious as well. Absolutely love their Bubble Tea range & menu. My New local favourite. 2piece chicken, hot chips and drink is so delicious. Chicken is hot crispy and juicy. Chips are always fresh and hot. It’ll be the best fried chicken place in Logan Worst fish and chips I’ve ever had.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Libertine Restaurant & Cocktail Bar: We were lucky coming here on a quiet night. A Classy Fine Dinning atmosphere. Food was interesting, of fusion style between French and Vietnamese /Japanese. The manager was very pleasant talker. Interesting facts about the history of the restaurant be told. A real nice experience. Will be back for a special occasion for sure. Recommend. 10 of us did the Sunday long lunch $45pp banquet. We had to do the banquet due to the size of the group. The food and ambience was great but it was too little food. I knew this because everyone wanted to order dessert and no one wanted to share. If we had the a la carte option, I realised I could have ordered everything that was brought out for half the price we were charged. Please review your pricing. Superb service! Very attentive staff. Making sure you feel comfortable. They know what to give you even before you ask them. Love the staff. Food was 10/10. Cosy ambience and great atmosphere in a beautiful restaurant. The banquet was just what we needed, incredibly tasty and full of flavours. The combination between French and Vietnamese cuisine blends perfectly. We enjoyed a memorable banquet dinner at Libertine last night.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Alchemy Restaurant and Bar Brisbane: We had an amazing lunch here on Wednesday, drawn in by the Dine Brisbane City special for June. At just $25.00, it was an exceptional value. The menu offered four dishes, plus a glass of wine. We tried the smoked Burrata, which was beautifully fresh, the seared pork belly, which was extremely flavorful, and the light, fluffy gnocchi with perfectly balanced Gorgonzola cream. We also ordered the freshly made focaccia bread for an additional $2.00 per slice, and every bite was worth it, from the texture to the flavor. The service was outstanding. If you haven't been here yet, take advantage of this deal—it's sure to make you want to return. Beautiful location.   Food was delicious (the wagyu and gnocchi were excellent) and service was friendly. Absolutely fantastic experience for dinner celebrations! Wonderful Italian restaurant, down by the river, with spectacular views and wonderful ambience. I loved the octopus and the steak, and all the other meals were tasty and well presented. This was a great place for our team dinner, not too pricey and and with excellent service and cocktails. A big call out for our waitress who was brilliant. Great service and food. I visited here to have dinner with my mom who flew all the way from Korea to see my graduation. The waitress Michelle help us selecting the menu to take care of my whole dinner. She even provided me a congrats plate! Thank you for making my day memorable with my mom. The food was amazing especially risotto!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Cloudland: This place looks fabulous, great decoration, delicious food and friendly staffs, i can't wait to come back! They have recently re-branded the restaurant here and it was worth a visit. Cloudland Garden offers a truly delightful dining experience. The lush, inviting atmosphere immediately set the tone for a relaxing meal. I started with the cured meats board, which featured a delicious variety of textures and flavors, perfectly paired with some pickled jalapenos. Dining at Cloudland was nothing short of a fantastic experience that truly left an indelible mark on my palate and overall dining satisfaction. From the moment we stepped into the warmly lit, inviting ambiance of the restaurant, it was clear that we were in for a treat. The food, an exquisite blend of flavors and textures, was absolutely delicious, satisfying both the eye and the palate with its presentation and taste. A surprisingly great feed - I thought cloudland was only a nightclub but I was proven wrong. The menu is varied and the dishes are done well, I wouldn’t say its value is centred around the skill of the meals but the food was elevated and there were no complaints. The Arancini and Calamari were both delicious, the pizza had a great base and delicious topping, the pasta was incredible and fresh, and the steak was good for its price point. The prices are also pretty good, including the drinks with cocktails for $22 and wine starting around $50 a bottle. The cocktails did let us down a little, but that was made up for by some incredible shots we got at the end. Finally, the service was 5 star and shout out to our amazing server Bianca who went above and beyond to make our night fun! The venue is also absolutely beautiful, and they are connected to a rooftop pub to carry on your drinks afterwards. I cannot rate Cloudland highly enough as a venue to celebrate a special occasion. I celebrated my 60th in the Moon Room. The venue is fantastic. All communication before the evening was prompt and professional. On the evening itself, the staff were extremely attentive. Food was delicious. A very memorable occasion!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Springwood Tower Apartment Hotel: We stayed a few nights after our house was flooded. The room was excellent but the room service was so bad. First day I had to ring to reception in the afternoon as our bath mats were taken away and not replaced. The bed was not made up. Next day, the towels were not replaced even though we left them on the floor. Apart from that, all was good. Just came back from spending the weekend in Brisbane for a family wedding. The service and accommodation was great. We Stayed in the 3 bedroom apartment and couldn't get over the space we had. The only issue I would say is the parking. Only a limited spot to park. Coming back late there was no guest parking left and had to park outside. Can't understand why each unit should have their own spot. But besides that would recommend staying here. Will be staying there again. Brilliant! Love the location, Love the rooms, Love the secure car park. Highly recommend this place. We’re already booked again. The Chinese restaurant is an absolute must do and the little bar is a nice quiet spot to unwind with a cold beer at the end of the day. Much appreciated. Friendly staff l, room was comfortable and clean. Pleasant stay Check-in and check-out was effortless and excellent. Room and facilities was clean and tidy. Springwood Tower is still my first preferance place to stay in Brisbane.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Malt Dining & Bar: I tried the crispy duck and ham for starter and the roasted pumpkin for main and the chocolate brownie (decorated for my birthday) for desert. All three were really tasty and yummy. Nice atmosphere and professional staff as well. The service was amazing, so friendly and professional and made us feel like a regular. The venue is so homely and with a style that almost makes you forget you’re in the city! I was most pleased I got the table I asked for in the restaurant! But the food, oh my goodness. The food was incredible! My wife is a foodie, I wouldn’t say I am but even I got lost in the flavours, textures and presentation! Just amazing, we had the best night and will be going back more often that’s for sure! Very delicious food, friendly and professional service, the elderberry cocktail was amazing. Everything was amazing. The atmosphere is a blend of traditional and modern, being in an historical building with abstract modern art and the soundscapes were easy on the ear. Comfy velvet chairs add to general ambience of understated class and style. Absolutely excellent whisky and dining experience. We chose to dine in the bar area and were so pleased with our choice. So many excellent whiskies to choose from, along with delicious food cooked to perfection. Outstanding service by staff. Highly recommend I booked the private cellar option for 16 people 17th Wednesday 2024. The menu for lunch chosen was the premium Chef’s Feast to cater for the big eaters in our group, I also added a 3rd protein to the main courses. Everyone of my clients raved about how good the food was in terms of quality but also quantity. Super happy with Malt Dining for providing such a great experience for our large group!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Inchcolm: 10/10 Exceptional Stay at The Inchcolm Hotel! Great customer service and really nice hotel. The service was outstanding and all the staff was super friendly and helpful, the rooms had a boutique feel to them which I loved they were also very unique in a good way. the fragrance they put throughout the hotel was phenomenal I have never smelt a better hotel. The parking was not on site, but it was very close to the hotel, which was awesome. The services that were also included with the rooms was exceptional , especially the free lolly bar that my kids loved. Very happy with our stay at the Inchcolm. Front desk staff are super and made everything easy and comfortable both in the hotel side and the bar. The evening social hour is a nice touch. Room is very comfortable, clean, and we slept well. Great location just a few steps from the central train station. This hotel is a great find. Don't bring kids here. The Inchcolm is an incredibly beautiful venue that I am so happy to have booked for my wedding. We booked the entire hotel and so had a lot of the wedding guests staying in the hotel and they treated everyone with the same care. They left champagne not only in the bridal suite but in the rooms of the wedding party too.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "In a Pickle: The cafe is super cute ! They have nice gifts and lots of cabinet options. We're so glad we discovered In A Pickle. The food is amazing and our serve of cake was huge and filling. Coffee was pretty good to. I recommend the potato salad it was to die for. Also the pumpkin fritata was delicious 😋 😍 👌 I have been going to this family run cafe for years and it just gets better and better. The service is friendly and fast, every meal feels like a warm hug, the food is delicious and you really get your value for money and then some! The cafe has a wonderfully inclusive vibe and the treats at the counter are divine. I have used In a Pickle for catering several times and I highly recommend this as well. The sweets and cakes are so tasty and the savoury sandwiches and hot items are big crowd pleasers! Can't wait to go back again! The vegan bowl was AMAZING. Enough said. It’s been a few weeks since I had the pleasure of having brunch here and going through my photos I was reminded of the deliciousness I experienced. I had to share. Spectacular I love everything about in a pickle, from the awesome cakes, divine breakfast and caring service, I also absolutely love their takeaway meals so good the massam curry  and lasagne are the best. Also their catering is just next level. My favourite. ❤️",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Friday's Riverside: Friday's Riverside function room was fantastic! We attended a birthday party here and the view was definitely the highlight of Friday's. From the balcony your view is directly out to the river and the Story Bridge. The room was a great size for a more intimate sized party and there were plenty of seating options (mainly bar type stools). The food was tasty and there was great selection of vegetarian/vegan and meat finger food options, and the private bar was fantastic. The staff were friendly and moved around the guests well with the food. The person behind the bar was friendly and had a good knowledge of wines, etc, that were being offered. By the time the party had finished the main area of Friday's had music playing and people dancing. This was not distracting in the private function room and looked like everyone was having a fun night! Highly recommend Friday's for your next function! Frequent at Fridays regularly as it's a chilled place to wine and dine and who can go past the awesome view of the Storey Bridge. The staff are acceptional, friendly and attentive and make the experience of dining there even better. Highly recommend. Advertisement said djs would be playing.  Got there only one other couple thought it was closed no music no vibe it was a bit depressing.  Food was quite nice but the cocktails were probably largely fruit juice so doubt I'd go back.  Location is fabulous right on the river.  Need to seriously up their game if they want to compete with the other bottomless brunch venues. Recently visited Fridays for lunch. Great spot with an amazing view of the Story Bridge. Staff are friendly and very attentive. Food was yummy - can recommend the beef burger or steak sandwich. Terrible experience here. A friend of mine accidentally pulled their vape out at the OUTDOOR bar, and put it away after realising they couldn’t use it. Security instantly kicked them out despite the fact they didn’t even use it. You lost about 8 people and a couple hundred dollars worth of drinks, nice!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp Truckstop: My car had an issue that needed urgent attention. Thanks to the BP team for their patience. Safety was definitely their top priority above all. Today I had the pleasure of putting fuel in my car. Whilst the act itself is pretty boring the beautiful, respectful nice crew made the experience. I don’t often leave a servo feeling impressed these days but I really felt that this BP really prioritised good old fashioned customer service. Was served by Brett, Thankyou for showing me that customers are still valued. Im an uber driver, Stay away from this servo, their fuel is the most expensive in Brisbane 100 % The staff are always so friendly - the young lady on shift around 6pm yesterday had the best customer service I've experienced in a while. Whoever is hiring staff there is doing a great job. Sadly their pumps are often out of order and I feel their fuel prices often a smidge higher than other places... but I understand it's a super convenient location close to the CBD so also expect to pay a little more.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Jetty South Bank: Absolutely amazing! Came here for the first time to celebrate a birthday, the food tasted great, the service was top tier and the views were stunning! The atmosphere of the restaurant was very lively and well decorated. The perfect place for a great night out :) A special mention to Olivia and Zoe for the great customer service! The customer service at the Jetty was A1, the lady serving us was exceptional and accomodating. My friends and I enjoyed the food and it was well priced. Coffee was great and a bonus point for not taxing on the iced coffees. We had a lovely breakfast this morning. Eggs Benedict on potato gems with smoked salmon and the smashed avo on toast with crispy bacon on the side. Coffee was great also (including my decaf). Lovely staff members. A good view of the river, nice place to sit and chat and watch the world go by. Lots of walkers, runners, cyclists and dogs 😊 Perfect place for a date night or cute celebration. Have a nice waterfront view while you eat. The food tasted amazing. Filled of flavour and super tender. Even the beans tasted good (I don't usually like beans). There is some parking close to the venue other wise a small walk for meter parking. Will be coming back. Stopped at the restaurant next door last night for just desserts and a cocktail. As it was late they didn't want us (they had 8 tables still eating) so we tried our luck here at The Jetty. Not a problem even though they only had 2 tables left. We felt welcome even though they were winding down for the evening. The desserts and cocktails were amazing. So good that I have come back today for lunch. I am killing time before heading back to the airport so taking my time ordering starters one at a time reading my book overlooking the river views. The staff are friendly and accommodating. So glad we were rejected next door The Jetty is an absolute joy to dine in. The menu having so many choices that were GF was an extra bonus. Highly recommend.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: This is by far the best Subway I personally have ever been to. The store was immaculate clean. The server was on point. Thank you very much, Cory. All the staff were happy to be there and it was a Friday night. I ordered a pizza sub for my wife. She said it was that good! And I just had to try it. This has become my new local. I’m giving more stars here. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️ Honestly the best subway I’ve been to! The staff there are amazing!! Mollys customer service is outstanding !! Always making sure we’re happy with our food. You deserve a pay rise girl 🙌🏼 Consistent product & service provided by the kindness of the staff! Friendly & efficient service provided! Always fresh toppings to place on the freshly baked subs! A very filling meal! Wheelchair access is available plus plenty of parking is provided! Ask to have the union, pickles, capsicum removed they are still added. We pulled up at 8pm, on a Monday night, tired and hungry and were greeted by a",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Ordered 2 subs and a salad, one sub ended up having chicken pieces instead of beef meatballs, other sub ended up having a copious amount of some kind of spicy Chipotle sauce instead of ranch. I did give up on this store last year, as their prices were  inconsistently high despite the same order each and every time.  I have seen many staff members come and go from this store, it was always under staffed. Thankfully that has all changed, the staff are familiar, super friendly, organised and customer focussed, and the long queues have disappeared.  Their prices are now in line with correct Subway prices. The guy who runs the store is fantastic, it has made a big difference, he cares about his customers and makes them feel important and well taken care of.   It's now a pleasure going back to this store, and my son can order his regular sub without being over charged. Never fails to disappoint. Even when there is no other customers and no pending uber eats orders the sandwiches are just throw together. Toppings are buched up and subs don't get toasted properly. Slop! Pictured is a toasted meatball sub. Very polite BUT, BUT didn't toast the bread when asked to be toasted and put wrong toppings on the sandwich and didn't properly fold the wrapper so I nearly lost my sandwich, they need to focus on training there staff more Not my favourite subway but it still worked. I have to get a gluten free wrap and some staff are better at wrapping that and keeping it together than others. This subway doesn’t have a huge amount of seating but its easy parking and nice staff.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Fat Noodle: Look it’s a nice place out for dinner. Service was friendly. But if you after good Asian food, there’s plenty elsewhere better in Brisbane and for at least half the price. Salmon was overpowered by mandarin etc. Laksa was tasty but lacking any real punch in flavour that you’d expect. Dim Sum and tofu just average. Chicken salad was super tasty!! It’s a nice spot but no where near the price tag. Would I return? No… Have been to Fat Noodle few times now. It’s located inside Treasury in Brisbane city. Have tried most of their dishes and member’s specials. Their peking duck pancakes, fried rice and Thai salad is quite delicious. Over the many years I have absolutely enjoyed the Fat Noodle Member specials. It’s such good value for money and they do not compromise in the quality and the flavours of the dishes. I leave feeling satisfied every time.  We do order off the menu too. I don’t like to pay too much for Bahn Mi but that Crispy Pork Belly was just so tasty.  The service is great too. Even when they are extremely busy the staff are there to accommodate. Thank you to all the staff and the chefs for your amazing hard work. I highly recommend the food here. This is a restaurant Dined at fat noodle to celebrate chinese new year and Valentine’s day",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "La Madrina Pizza: Superb pizzas the couple times we’ve ordered. Ham is a bit tasteless though. These are the best pizzas in the greater Brisbane area. Do yourself a huge favour and go to La Madrina for your pizzas. Quality ingredients and made with love. Consistently mouth watering pizzas and have been for many years. Impeccably clean and friendly professional service. As I said, the best pizzas in the greater Brisbane region and the best pizza I have eaten. We recently ordered the family-sized \"Outback\" pizza from La Madrina and wanted to share our experience. Firstly, the pizza is generously sized, making it a good choice for family or group dining. The price, at $31, may seem a bit on the higher side, but it's justified by the ample portions and the liberal amount of toppings they use. It's always great to see a pizza that doesn't skimp on the good stuff! Awesome pizza but for some reason they never answer the phones on a Friday night, not the first time I’ve had this issue…. I have always enjoyed the pizza...never disappointed,  5 stars for pizza. But tonight I thought I'd try some pasta, carbonara. It was very average in flavour, the take away container was half full and cost me $18.95. At least give me a full container with a bit more flavour for that price . Quite a let down!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Alfred & Constance: The vibe at Alfred and Constance is unique, set in a beautiful old Queenslander, it’s quite casual but fun. There’s plenty of dining areas both inside and out. Staff have always been friendly. Have always enjoyed my time and food here, unfortunately just never seem to enjoy the cocktails too much. Had lunch on the cafe side which has ready-to-eat food like paninis and salads (I think the other side is made-to-order). Meredith's Apricot Chicken is absolutely delicious and their salad selections offer more than your regular side salad. Great ambience and lovely, friendly staff. The best chips in Brisbane, oh my word they are superb. Paired with Alfie's cheese burger, the serving is extremely generous and filling. Amazing little bar in valley, usually our teams go to place for after work drinks catchup The cocktails I tried were very good!  (how I met your mother and the tropical one) but the customer service was quite bad. The girl who was in the counter was quite rude with all of us who were there for no reason and without the place being full at all 👎.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "anouk café: Great place! Had to wait a bit long for the food though despite early morning with very few guests. We had breakfast at Anouk. I ordered the shakshuka baked eggs,  very tasty dish. Coffee is Merlo , flavour was good. Service spot on. Seating outside where you can sit with your dog or plenty of indoor seating available The pulled pork tacos OMG they were so good… who thought to pack everything in a roti because they were onto something real good. Super flavourful, great portion sizes if not a little more than you’re paying for. We also tried the donuts which were incredibly chocolatey and sweet, could only have one at most but perfect for those who have a sweet tooth. Chai latte was one of those deconstructed ones lol Gorgeous place, coffee was delightful, food was also good. Even though it was busy we were seated pretty promptly. But experience marred because of our very odd waiter. He asked if we were OK then said he's too busy when we started ordering, when he took our order after practically having to force it on him he stood like a mile away so I had to yell my order over all the noise of the cafe. Thinking back I don't know whether to laugh or frown, felt like a prank. First time visitor to this venue and it was a good experience. Food is a little different, menu is very diverse and offers a slightly different offering to what you would expect, such as using Roti’s for tacos tortillas. Service was excellent and fast.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: One of the most expensive Night owl and smallest fuel stations , never come back. It is also a night owl convenience store. The service is always very decent. They aren't pushy, but offering upselling is part of the job. You have to accept these places get mystery shopped and there are penalties to the employee if this is not being done. Excellent coffee & super friendly staffs!! Very expensive petrol here. Just paid $1.58 a litre. Also been overcharged twice for packs of ice blocks which are icy inside .  Freezers don't seem to work properly.  Not a patch on what used to be a great local store as well  as petrol station. Better off going to Woolies for food and it's not hard to find cheaper petrol. friendly service and larger convenience store. petrol is always pricey compared to others in the area though. you can receive velocity frequent flyer points here.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Uno Caffe & Pizzeria: Decided to try this cafe for a breakfast. It is located just on one of the entries to the shopping centre. I strolled up to the counter to look at the menu. I was greeted by a friendly staff member who then took my order. It was early and there was plenty of seating to choose from both inside and out. I ordered scrambled eggs on toast, which is served on lovely thick toast. Eggs were pretty good. Also ordered a flat white which was also nice and hot, with a good flavour. Lots of choices for both breakfast and lunch. I have been here a few times and bought clients who I take out and not had a too bad experience, however today was different. The staff were miserable behind the counter. I ordered the vegetarian  breakfast and told them that I don't eat bread would they be able to take it off and put something else. Immediately it was \"no, we can't swap for another item\", I would need to pay for it. I also ordered a piccolo,which was a teaspoon of coffee and the rest milk and froth! Nothing like anywhere else, when the food arrived I was so disgusted! On the plate was about 10 wilted spinach leaves with one cut up cooked mushroom on top,one very small poached egg, the smallest tomato they could of found, cut in half and cooked, all for $16.90!! What a rip off! Because I was quite hungry I ate it, i should of sent  it back and got a refund.. The older lady who was will me was also disgusted at the portion size, she was going to order a cake but saw how small the cake slices were! Relaxed atmosphere with staff who have always been tremendously attentive to Cafe guests. It's more like visiting old friends than going to a Cafe. Very enjoyable, and they always interact well with children and oldies alike. My wife and daughter are Ceoliacs. The owner and the Chef could not have been more supportive. We have eaten there twice now and will continue to go back. Very flexible with the menu and will talk through how they prepare and cook the food.  Oh BTW the food is great too. I am a customer and have tried uno caffe multiple times and well being at the caffe I have and witnessed on several occasions the bosses treating staff with disrespect. This behaviour made me feel uncomfortable and as though staff are not treated fairly or with respect. Recently I went their with my partner to order food and the food was nice and coffee was amazing and the staff there are lovely but they are not treated right, I will not be returning to this cafe as it makes me feel uncomfortable.Although  girls that work their are lovely, and make the place feel welcome I just  that stuff are treated unfair",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Brisbane Club: Great wine, even better French martini 🍸! Classic old fashioned club. Love it. I have been here only once for the Whiskey Expo 2019. It was one of the worst places to hold such an otherwise joyful event. The air conditions were off. A few guests went to the club staff to complain. They weren't on until the end of the event. The staff at the bar whose only task was to serve lunch packs couldn't have been less unfriendly. Went for a couple weddings. As always, an incredibly nice place with intimate setting and beautiful furniture. Great place . Staff welcoming",
        "Additional_Info": ""
    }
]