[
    {
        "Place_Reviews": "Canberra: "
    },
    {
        "Place_Reviews": "Novotel Canberra: 1) We checked into our room and had a worker walk into our room unannounced, opened the door with his key and saw my husband standing there and said I need to come in to “lock the interconnecting door”. We looked and it was already locked. We raised it with Reception and all we got was sorry. The Novotel is very conveniently located in the centre of Canberra.  The public areas are nice and must have been fairly recently refreshed however the rooms and corridors were very dated.  There were a lot of stains on the carpets in the corridors and the design of the rooms was quite bizarre.   The bathroom was partly open plan with a glass partition to the bedroom- which was very badly positioned close to the bed.  In the middle of the night getting up for the loo I couldn't see it and bashed my face into it.  It is quite dangerous. Don’t expect to use there car park it’s so tight and hard to access they only have about 20 car spaces and it’s subject to availability if your planning on driving you need to park in a nearby car park and walk 10minutes away we found it pretty bizarre for a well known multi level hotel. The room itself was tiny and my door key broke twice during my stay, also the lifts are very old and small and you have to wait a while, first edition breakfast buffet was nice but other than that I wouldn’t say I would stay there again. Overall good, rooms good, maybe the hotel is a little dated with it's brown and dark decor. Breakfast was good and a good selection. Good location and good price, will come back. staff is good also Was very happy with the size of our room, it wasn't cramped at all. The floor we statyed on had a strange smell , but the room was fine. The swimming pool was amazing  and we also loved the buffer breakfast. Would stay again!"
    },
    {
        "Place_Reviews": "QT Canberra: Our stay at QT Hotel in Canberra was outstanding! The true test of a hotel's quality is how they handle things when they go wrong, and QT Hotel passed with flying colors. We experienced a minor issue during our stay, but the staff's prompt and efficient response turned it into a positive experience. This is one of the hardest reviews I have had to do. I would have given it his zero stars if not for the staff. The staff there are amazing. Really good. Nothing is too much trouble. The service is great. That’s where it ends sadly. Having stayed in multiple QT hotels, I was sorely disappointed with the quality of the rooms compared to the other locations. Rooms are usually extremely lavish and quirky yet the QT Canberra felt more like an IBIS. The lobby sadly is the only real modern aspect to the hotel. There is also extensive and noisy construction going on outside which can be heard even with the balcony door closed. $365 a night no breakfast. Right next door to major build works. There is no where close to get brunch or the like as this hotel does not open for food until 12pm. The room is adequate but not stunning which is why I feel like this is a $160-$200 Max place as it is quite ordinary. Prices on the menu are not correct, there is an additional charge. Good location. Parking at $30 per day which feels a lot on top of the accommodation."
    },
    {
        "Place_Reviews": "Pavilion on Northbourne Hotel: Stayed one night.  Room was clean, bed comfortable.  Was surprised that the room was quite large and had a bonus small bath / shower. Reception staff pleasant. Bar down stairs was quiet with a TV and lounges. The alcohol was reasonably priced.  The heating system wasn't quite that good and there wasn't any blankets but everything else was good Great place for an overnight stop and a meal. I can't fault this hotel. It is excellent value. Very pleasant staff. Good sized, clean, modern room on the 3rd floor with all inclusions. On site restaurant with well-priced meals and a very good buffet breakfast. The on-site parking is behind a secure gate. Will definitely stop here again on our way through Canberra. We have stayed here a number of times and always had a lovely room, however this time we must gave lucked out as we had the worst room, the carpet was old and dirty and the furniture all chipped and the shower impossible to regulate, it had two settings, Scalding hot or cold. Took a science degree and steady hand to find the right sweet spot. So if they book you in to 205 ask for another room! Frequently visiting Canberra and have stayed at many places. This time being a last minute trip there wasn't many options. Did plenty of research and was sceptical due to the review ratings. Pleasantly surprises with how good it was. Easy parking and close to everything. Gym is not much to ride home about. Attrium was a nice area to relax and have a drink. Very unique. Rooms were clean and well presented. Only dealt with staff during check in. No complaints there. Considering the price it was exceptional value and will be our first point of call next time we visit. Be careful to not to be burnt when shower because water temperature is unstable. It can be freezing or very hot. Room is freezing. Air con temperature in the room can’t be controlled. Set 30 degrees but still freezing. One of the lamps was not work."
    },
    {
        "Place_Reviews": "Hyatt Hotel Canberra - A Park Hyatt Hotel: As a wedding photographer, it was a pleasure to document one of my clients' wedding day at the Hyatt Hotel Canberra! They had the private and luxurious wedding of their dreams here, and the stunning architecture, beautiful interior decorations, and gardens were nothing short of phenomenal. From beginning to end, the staff were exceptional at their job, and the ceremony and reception went seamlessly. First time staying here. I’ve had my baby shower, my 21st in the buffet area, my first wedding anniversary, my graduation etc. so in the last 35 plus years many memorable experiences. We stayed for the week end to have our 12 year wedding anniversary as a staycation. We have such a relaxing weekend. We had a tray of chocolates with happy anniversary when we arrived which was lovely. The atmosphere of the hotel I really loved. The bath tub was great, the bed was comfy and the room ever so spacious. Fantastic service provided by the staff. Attentive & friendly house keeping staff deserve a praise. Room was comfortable & spacious. Huge bath tub & clean bathroom. Very comfortable bed & pillows. Great location to the lake. Gym facility/pool was excellent. Highly recommend. The Park Hyatt is a truly beautiful hotel with excellent rooms however the service is dismal. After staying here multiple times Ive found the staff to be inexperienced and are not good at listening. A simple request is often not delivered correctly and needs to then be re done. A very beautiful, peaceful and luxurious hotel with a real Old Money vibe."
    },
    {
        "Place_Reviews": "Crowne Plaza Canberra, an IHG Hotel: Stayed here in Canberra on a deal that included a one-night stay, entry to the Ancient Egypt Exhibition, and a buffet breakfast. I must say, this experience exceeded all my expectations! The room was clean and the bedding was very comfortable, we all slept surprisingly well. The carpets and bathrooms are showing their age but the fantastic service from all hotel staff make up for the other small things that could be improved. Special thanks to the Manager Owen for taking the time to show us the room before we booked and for being so courteous and polite. The breakfast was good, selection from the buffet was good and again, all staff at breakfast were friendly and helpful. Yes, we can see the hotel room fixtures are showing their age, but the pricing was competitive. Overall, an enjoyable stay at the Crowne Plaza Canberra. We stayed for 4 nights in the winter school holidays. Excited about our holiday with family of 4. Stayed here with my wife 3 kids and we had a great time. The breakfast is great value and the service was amazing."
    },
    {
        "Place_Reviews": "ibis Styles Canberra Tall Trees: We had to extend our trip due to myself having an emergency procedure done, our room was originally up stairs but I was unable to get up stairs as I had to get a stent in the valve to my kidney.(there was no lift either and we also have two kids under two) I  asked to change to ground level and the people at reception changed our room without question or hesitation which was amazing, they were both so kind, understanding and accommodating to mine and my families needs. The rooms are great for a few nights stay, absolutely perfect. Would stay here again and again. Clean rooms with good sound proofing, nice and quiet, centrally located, lovely staff and great value over all. I would definitely stay here again. 😃 Overall our room was spacious, but there was dirt, sawdust, and the bathroom was poorly cleaned. We asked for the room to be cleaned, only the bed was made, the bathroom was still dirty, the furniture was shabby, the floor lamp was in such a state, I don’t understand why it wasn’t cleaned if it wasn’t cleaned. t cleaned. t cleaned. I don't work. I left a cup and spoon after coffee, thank you, it’s very nice that you washed it) the hotel is 3 out of 5, they don’t do cleaning Overall our experience was very disappointing. This being stated location is good, close to the Dickson restaurant precinct, very quiet environment, staff helpful when we voiced our concerns however, there is no excuse for the extreme cigarette odour that we were confronted with. Now this experience is specific to room 104. On entry to this room we were “hit” with the stale smoke odour and, as we are, I suggest, typical older aussie’s we decided to tough it out and not make a fuss. WRONG decision, awake at 3.00am and found it necessary to open up outside door and turn on the air conditioner for any chance of sleep. Yes we were moved to room 106 when we complained, better but not perfect.We were in Canberra to celebrate our 50th wedding anniversary and his experience took the edge if it somewhat.Smoker rooms are completely unacceptable. Stayed here recently with our 2 grandchildren. Staff faultless reception smelt amazing.Family room we stayed in was clean  & roomy.Water pressure amazing.Would recommend this establishment."
    },
    {
        "Place_Reviews": "Alivio Tourist Park Canberra: We stayed here for a few days for a little getaway . The older 'ridge' cabin was not so great, beds were horrible and it was quite old and freezing!! After giving some feedback to the staff the next day they were able to upgrade our room for a great price and they informed us that the older cabins were next to get fixed up! We then stayed in a newer villa which was great, beds were comfy and the place was new and clean! Great facilities. Pool, Spa etc. Awesome park, caravan sights are all drive through and well spaced. Heaps for kids to do! Amenities are clean and modern. Nice and close to the city. Definitely wouldn't order the takeaway pizza with garlic bread, would be better off going to the supermarket and getting a frozen pizza and garlic bread. It was almost uneatable and $25, $26 pizzas with $9 garlic bread. Other than that I can't fault the park all staff were so welcoming and friendly. This is a great park when travelling for vacation and the drive-through van sites are super convenient.  I've stayed a few times, most recently in a cabin.  Well appointed with great facilities for all interests.  Will stay again when travelling for holidays. Nice enough a place. The rooms are a descent size and were reasonably clean. Did not have to engage with the staff much due to a short stay but they seemed friendly. The buffet breakfast was good."
    },
    {
        "Place_Reviews": "Garden City Hotel, BW Signature Collection: The accommodation was truly excellent. The room was dated but decently clean.  The shower pressure was good, but the temperature fluctuated.  The very squeaky door to the room was fixed after I mentioned it.  The light flickered in the bathroom in a creepy way, but I forgot to mention that until my last day.  The buffet breakfast for $25 was terrible.  Selection was poor, and quality was low. I’ll start with the positives first. The staff were friendly and helpful. The water pressure is strong, the aircon works fine and the bedroom and bathroom was clean (but outdated). I tried the dinner room service and the food was tasty. My granddaughters and I had a fabulous week in the ACT using GCH as our base. We didn't use the bar or restaurant, but the fare looked quite acceptable. We also didn't use the pool as it was the middle of winter, though it looked beautiful. I don’t know where to start from. Room was an absolute shocker for me and my husband. The pictures they have posted online don’t match when you see them live. There was a very unpleasant smell in the entrance, throughout the hall way to the rooms. Room was very small, was not cleaned properly. There were tissues in the bedroom bin and the toilet bin already. The cups, glasses and the spoons were dirty. When I told the guy in reception about the cup, he was not interested in swapping. He was like oh ok bring the cup downstairs and I will swap it for you, seriously? Why did I pay $154 for? Never going back there again. The receptionist was rude."
    },
    {
        "Place_Reviews": "Adina Serviced Apartments Canberra James Court (Formerly Medina): I recently had the pleasure of staying at the Adina Serviced Apartments during a business trip, which lasted about a week. The location is notably convenient, nestled close to the shopping center of Canberra, making it an ideal spot for those looking to explore the city's retail offerings. The premises were consistently clean and quiet, providing a peaceful retreat after a day's work. Great location, staff were friendly. The apartments are a generous size but they are in desperate need of an upgrade. The building was built in the early 90s and the kitchen and bathrooms are definitely from that era. I cannot recommend this hotel enough! The customer service was amazing from check in to check out, the rooms were big and spacious, very clean amenities and very close to the city centre. Parking was extra $ but that's expected in the city - it's private and secure so was worth the money. Definitely book if you want a nice room, good sleep and a stones throw to the Westfield, coffee shops and restaurants. 2 bed apartment needs upgrade.  Beds were as hard ad rocks! Microwave from 80s and some mould on bathroom.  Two LIFTS not working very inconvenient.  Cost high just the same. Air con in lounge very old with old remote. Room pretty run down, hot water system needs an update if you want to bath and shower."
    },
    {
        "Place_Reviews": "Adina Serviced Apartments Canberra Dickson (Formerly Aria Hotel Canberra): Wonderful overnight stay on our way from Melbourne to Sydney. Stayed in a 1 bedroom apartment which a huge dining and kitchen. Air conditioning heating was tricky to operate as it takes a while to heat and warm up, I had to check with reception for instructions. Comfortable and decent. Will stay again. I have stayed with Adina a number of times. I stayed here for 2 nights with a client. We requested 2 rooms. When we arrived there was only one room booked despite there being a confirmation email for 2 rooms. I paid for the one room and expected the second room to be charged to my cc. It wasn't charged until we checked out which was fine but then I received a phone call requesting the full amount for 2 rooms to be charged. The charge was pending in my account and I requested they wait until it cleared but they charged the full amount anyway. The whole experience was dreadful and I will not be back. Damn shame too. Canberra is a cool city. Appartment was in poor condition, thin curtain everyone can see inside, hot water took 3min to work, no mugs just cups, very small room compared to other places for same or cheaper price, no microwave, no kitchen, expencive movies, rooms are grouped together with two seperate doors, outside door then the two room doors for no reason. Accommodation doesn't have restaurant onsite but short walk to a very nice restaurant in next hotel.  Great meals."
    },
    {
        "Place_Reviews": "ibis Styles Canberra: This could be the worst hotel I’ve ever stayed in and I’ve stayed in many. Yes you probably get what you pay for but it is still no excuse for the dirtiness of this place. 2 nights was way too long. The rooms are tired. They could do with a paint and the curtains are delapidated, falling off. Rooms ok. We took the package which included breakfast. This was the worst accomodation for price I have ever witnessed! $260 per night! We arrived after a 5 hour drive to what was like a jail cell. No lamps or power points, The king bed was joined single beds and different levels. Refreshments were at floor level.  Carpet was stained and smelly and the bathroom sink was cracked and dirty. We called to get an upgrade and they brought an extension cord and power-board so we could charge our phones from kettle powerpoint on the other side of the room. We asked for an upgrade and we were told was it was the best room they had. Asked for a refund and left. Definitely try Abode apartments just up the road and much better, plus a lot cheaper. Looked like a nice fancy place in the reception but looks can be deseving, once we heading into the door to where the rooms are it's not what we expected."
    },
    {
        "Place_Reviews": "Mercure Canberra: Stayed here for 6 nights. Room was comfortable, heater worked well. Spare blanket in cupboard and the shower was lovely.Convenient location with a car. I booked my stay with Caitlin who has been a wonderful partner to work with when it has come to booking previous functions and events. Caitlin has always made me feel welcomed and was very good a paying attention to details. If it was not for Caitlin's amazing customer service, i would perhaps looked at a different accommodation for my recent trip. However because Caitlin has always been amazing to work with and she made the whole process seem less, i chose to stay where i felt comfortable. Not trendy but good value, given the very moderate price we paid. Staff were great. Mercure Canberra offers excellent service and clean, nicely decorated rooms. The location is great, close to the city. The building is old but charming and well-maintained. The only downside is the lack of a lift, which made carrying luggage up the stairs a bit challenging. Despite this, the outstanding customer service makes up for it. I will definitely stay here again next time I'm in Canberra. We love this hotel and try and stay here every time we visit Canberra. The rooms are spacious and feel homely with warm colours and decor. The loft rooms are our favourite as they provide great space for a young family of four. Breakfast was sumptuous as always, and there was plenty of it given how busy it was both mornings. Though I would say the coffee machine was sub-par and neither of us even bothered to grab one on the second morning as we couldn't drink them the first day. The sofa bed could do with replacement due to the mattress sagging terribly but it was fine for small children. We will certainly be back again."
    },
    {
        "Place_Reviews": "Quest Canberra: Very nice studio apartments. Service was excellent, they kindly allowed me a late check out. The location is perfect, right in civic, moments walk from so many great pubs and restaurants and public transport. The place was clean and quiet. Hot tip: the lift is a bit noisy and the beds a little hard (for me personally), but it's comfortable and you can choose from various pillows. I would recommend Quest for a longer stay if you have business in town, I was happy there. Let me start by saying stay anywhere but here on a Friday or Saturday, the noise from the pub below will be unbearable, so much so that the floor vibrates! The staff are apologetic and say that can’t do anything about it, but that doesn’t wash with me. And I’ll preempt the ridiculous robot reply I’ll receive and many others have, stick it! You clearly don’t care about your customers and are greedy a-holes. Let’s see what response I get. I had an almost 10 hour drive the next day so thanks for nothing. Be warned, don’t stay here! I recently stayed at this hotel, and it was fantastic! The service was top-notch, the rooms were clean and comfortable, and the staff was incredibly friendly. I would definitely rate it 5 stars and highly recommend it to anyone looking for a great place to stay. Had a really good experience staying here. Traveled for work and was really happy with the rooms. Very clean and neat. Very helpful staffs and attentive as well. Thanks to sabitri, helping me with some issues i had as was staying for a week. Definitely recommend them and looking forward to stay here again😊😊 Most experience is great. Some items are old, but still acceptable. The only thing I don’t like is they used too much air freshener, not very friendly to the allergy person."
    },
    {
        "Place_Reviews": "Hotel Realm: Our family trip to Canberra wouldn't have been the same without our stay at Hotel Realm! It was absolutely perfect for us with young kids. They had a blast splashing around in the heated pool and spa, and my husband and I enjoyed the steam room, and sauna. The buffet breakfast was average (but a win with the kids!), and the staff couldn't have been more friendly and helpful. The family room was amazing (2 bedrooms) - spacious, comfortable, and clean. The kitchen had a microwave, fridge, dishwasher, and washer/dryer, which was frequently used! The bathroom was big too, and the kids loved the jetted bathtub. Parking was affordable at $15 a night, which is cheap coming from Sydney! Honestly, we couldn't find a single fault with Hotel Realm. It's luxurious yet surprisingly family-friendly and well-priced. We highly recommend it! We recently held our wedding at Hotel Realm and were thrilled with almost every aspect of our experience. The venue is absolutely beautiful, with a grand ballroom that provided an elegant and spacious setting for our reception. The staff were incredibly professional, attentive, and ensured that our special day went off without a hitch. From the delicious food to the luxurious accommodations, our guests were consistently impressed. This review is long overdue. We've stayed at this hotel twice and found it to be comfortable and has all the amenities needed for a family. The room was spacious, clean and decor was nice. Customer service was splendid, check in and check out was easy and smooth. I was greeted by a very lovely young boy. The one with the Big hair was very helpful and patient with me. I believe that for such a young man, he is more than capable of the job. What a lovely hotel. The room was so big and so much space. Happy with everything, from the tub to the kitchen area to the room having a split space and the bedroom having its own tv. Bed comfy and close by for food. The lighting was really cosy"
    },
    {
        "Place_Reviews": "Canberra Parklands Central Apartments Hotel: Great service with staff at reception, called late night and were very accommodating.. rooms are good, not as clean as I would of hoped, dirty pots, splash marks on the walls ect but overall okay. My room had no remote for the room TV. Pool is great, but only thing for kids to do, no grassed areas or play sections. nice location. Save yourself the time and avoid this place. I've been waiting a month for a refund, and the management is terrible. They claim to have 30 properties, but that’s no excuse for making me wait so long. It's not my problem they can't manage their properties. The rooms were dirty, I felt unsafe, and the toilet didn’t even work. I left within an hour of arriving. Really needs a good clean. The bathroom was filthy, the carpets stained and the furniture scratched and tired. We enjoyed our stay here. Hotel needs a good cleaning on a regular basis and needs some repairs and paint. The room was comfortable and clean . The pool was very cold and although very pretty, the pool area needs some work. Hard to locate pool, no signs . Coutyard was very nice . Definetly worth the price we paid. Have stayed here many times. Both Matt & Monica were very obliging nothing was too much."
    },
    {
        "Place_Reviews": "University House Hotel: I thought this would be like a dorm, but it is more like apartments. There is a generous living area, and lovely views. It is located within walking distance of restaurants so you need not eat in every day. That being said, the cafe is lovely and I would recommend the included breakfast.  I will stay there next visit! Not entirely handicapped accessible, so be sure to check this when you book. The living area was spacious with plenty of cupboards and storage. The furniture is classic. The bathroom had a large walk in shower and again plenty of space. However, our particular bathroom and a smell of urine so had to leave the window open. The suite of rooms was otherwise clean and well looked after. The accomodation is ideally placed for exploring all the sights in this lovely city. Good value so well worth staying here. Classy dining with a heritage setting in the confines of a big university. The wine selection is excellent and there is a choice of indoor and outdoor dining weather permitting with cheaper options available. Formal top end dining is also available with excey cuisine. Parking is plentiful and free after 5 pm and all day on weekends. Thank you for the nice place and services, also the delicious meals here, we were always provided with fresh australian apples. Beautifull experience🥰 Old world, simple but spacious & clean. Very comfy bed, nice treed view. Great balcony. The restaurant was superb. The cafe was good though bar service there was slow. Easy to get around & helpful staff."
    },
    {
        "Place_Reviews": "Ramada Encore Belconnen: We stayed for two nights, and overall, the stay was pleasant. The room was large with a queen and single bed configuration. The bathroom was extremely clean, though a bit dated, but it had an excellent water pressure shower. The whisper-quiet air-conditioning unit made the room warm, cozy, and easy to fall asleep in. Work trip last minute booking, room was clean and tidy. TV, aircon and bathroom really outdated. Couldn’t have a decent shower, felt like water temperature fluctuates immensely. No breakfast even though restaurant in in reception area, also no lift for second floor rooms which is a little inconvenient after a long day and bag in tow. Clerk was polite and accommodating. Wonderful place ,Neha,staff member helped us with booking a room there and a male staff member was also very professional and had a big smile on his face when we went to check in. Shops and restaurants on walking distance. Clean well presented. Overall pleasant stay. Stayed at this hotel for 1 night and never would again the rooms were small, the TV remote had the batteries in the wrong way and no back on the remote so they fall out constantly, there was a plate taped on the wall covering the plumbing with electric tape that fell off suddenly. The shower was Terrible due to going from boiling to freezing over and over the whole time I was in it that night and in the morning! When I went and told the receptionist she said she would have to get that looked at and apologized then went to the room to check over the condition before coming back and saying she could smell remnants of smoke and I wasnt getting my full deposit back, which I needed to get home.(guessing this happens to a lot of their customers). Eventually she called the manager and they changed their mind and gave me my money. Overall I would never recommend this place to anyone and definitely will never go there again. We feel comfortable when living here. The receptionist is friendly. The room is well designed for 3 people. It is peaceful. I hope to go back here when visiting Canberra"
    },
    {
        "Place_Reviews": "BreakFree Capital Tower Canberra: The is a nice Serviced apartment in the heart of the Canberra city. Trying to be completely fair here.  The apartment was spacious, though old.  In a good location, if there wasn't a huge construction site next door.  Staff were friendly but busy, potentially understaffed. Reasonably priced.  The main reason we wouldn't stay here again was the lack of ventilation. The apartments just smelt of mould, no windows opened, and the air con/ heating wasn't helpful.  The bathroom, in particular, was dreadful in regards to drainage and air. Customer service was good when arriving and leaving. I did not use any other amenities the apartment has. People living above the apartment I was staying at were washing clothes at 2 am, on the first day of my stay. Rooms and location is perfect. however, room service is not professional. the rubbish bag in toilet didn’t change. used toilet papers and sanitary pads in bag. We had breakfast included but you have to walk 3 minutes to Peppers Hotel for your breakfast."
    },
    {
        "Place_Reviews": "Canberra Central: "
    },
    {
        "Place_Reviews": "Red Cedars Motel: Tidy hotel, quick and easy check in. Good wifi and facilities. We had a room with a kitchenette which was good and had most cooking equipment and utensils. A little dated but comfy, affordable and generally a good place to stay. So i booked a room on thursday 4th of july i then called Monday(day arriving at hotel) to confirm everything was running smoothly until i got there to be told that my room wasnt booked then even tho i showed proof of calls etc i got called a liar. Finally got a room had to pay extra for room for 2 nights . the  room wasnt even what we asked for for our children with speacil needs. The fridge also kept freezing everything including my medication. Room was visibly dirty, crumbs on the floor and dirty tissues on the floor under the bed. Family room was large with more beds than requested. Excellent location and good price. Rooms equipped with everything we needed. 2nd time back as a return customer says enough, modern updated rooms, the bathrooms are not but they have everything you need and suffice nicely."
    },
    {
        "Place_Reviews": "Mantra on Northbourne Canberra: We stayed in a two bedroom apartment. We liked that it had facilities in the room such as washing machine, dryer, kitchen, microwave. For long term stay would have been great. However the cleanliness could be better and on the website it looked modern but in reality its not a modern apartment. The swimming pool and gym felt like you were entering a dungeon and to get to the gym you had to go pass the swimming pool. The windows were closed and just seemed like there was no air to breath in the little space. Breakfast options were great. So for long term stay is a good option. For one or two nights I would spend a little bit more for somewhere more cleaner and modern. love doing our glitterdolls shows at this hotel for the bucks parties! the kitchen is easy access to serve everyone beers while its all open plan living and the lounge area is perfect size for our live shows, plus we have never had a noise complaint all positive experiences for 13 years Comfy and cosy. We stayed in a King room and there was a full kitchen with utensils and a medium fridge. The 2 bedroom apartment is good for families and the place is near to the CBD, so walkable to all joints nearby. Very disappointing stay. Could only watch live tv. After 20 minutes trying to get tv to work with any apps, gave up and called reception- only to be told that the TV hadn’t been connected to the internet yet. Perhaps they could have at least told us at check in. Also “heated pool” frozen or broken or whatever. Tried to charge $5 for a baby cino (no marshmallows either) in the cafe downstairs. Beds were comfortable and rooms spacious. Ask is they have fixed their tvs before booking"
    },
    {
        "Place_Reviews": "Pinnacle Apartments Canberra: They are my pick  the 2 and 3 bedrooms are a great size and good price and ifs easy walk to the Kingston pub for a feed. Be aware that the EV charging is SLOW! 13.5 hrs to get 45kW so be prepared. I drove down from Sydney so needed a decent charge. You need to bring your own cable as well... The location is amazing. The rooms could use a little love, and the carpark is built for corollas, not 4x4's.  I would stay again Great location, room layout and facilities! Staff also seemed nice. It has also been nicely renovated some time ago. Only complaint was that there were small stains on the couch/carpet and the wifi sometimes cut out. Located walking distance from restaurants and shops, bunch of nice gents on the front desk, room was large and beds were good. We had booked a 4 bedroom/8 adults apartment. The apartment itself was well presented/equipped. It was clean and comfortable for our group. The biggest issue was that there is no lift. We had to climb 32 stairs to reach our apartment. One of our group was an elderly lady with limited mobility and this was quite an issue. One reserved car park for 8 adults was another issue. Luckily, there was street parking. Hot water ran out after 4 showers. Found a quite small water heater within the room, a larger one would be ideal! Especially given the room is for 8 people."
    },
    {
        "Place_Reviews": "Madison Capital Executive Apartments: Well it is a great and affordable hotel (if this is its category), we stayed there for one night due to business in the area. The rooms are basic, clean, and have everything you need to cook and prep food. Everything was clean and nice. Do you plan on driving to this place? Don't bother coming here. Spent 12 hours driving down from Queensland only to discover the parking complex is tiny and absolutely does not fit the number of guests' cars. I spent at least 20 minutes circling around the blocks trying to find any kind of parking. There was nothing. Only by a sheer miracle did someone finally leave the car park and I could park into the itty bitty space that barely fit my small car. It wasn't a very great stay for the following reasons: Our recent stay at the Madison Hotel and Suites Executive Apartment Hotel in Canberra was far from satisfactory. Several issues marred what should have been a comfortable and enjoyable stay. We weren’t even able to stay 1 night of what was going to be an extended stay celebratory trip of our wedding anniversary. Good value for money. Came here for a day trip to Canberra."
    },
    {
        "Place_Reviews": "Forrest Hotel and Apartments: Fantastic location, within walking distance to parks and shops and the lake.  A simple room but with everything you need.  Comfortable bed, warm linen, fantastic shower.  The Queen room had a toaster, kettle, microwave and bar fridge.  Staff very efficient.  I spent a wonderful 4 nights here in April and we’ll definitely choose this place again for our next visit.  Also, the beautiful tree lined street was such a bonus! The 2 bedroom apartment was lovely. Very clean and comfortable. The kitchen, bathroom looked new. The ceiling needs a refresh. Stayed here with my 3 children during school holidays. Be careful, this is as  scam! This hotel charged me twice for a double booking. When I spoke with them to refund the money, they were initially very polite. However, after I left the hotel, they made it hard for me to get a refund. They asked me to go through a longer process, including getting  by an agent. When the agent made the request, they rejected it. I am going to make a formal claim against them. We will definitely book this place again."
    },
    {
        "Place_Reviews": "Burbury Hotel Canberra: Finding the hotel was easy, upon arriving at reception, the gentleman showed amazing customer service. He was professional, polite, kind and very helpful. Which makes a very good first impression. We checked into our two bedroom apartment, despite no lifts to our apartment, the stairs were easy enough to climb to the top floor with a luggage. The apartment had everything we needed for a family stay (including cookware and utensils). The linen were fresh and clean. It was very spacious all round with a large balcony and seating. We were very comfortable and felt at home. When we checked out and left, later in the day we realised our son had left his watch behind. We called and reception and housekeeping found it quickly. Thank you the warm hospitality and made our stay in Canberra pleasant. Excellent location, and the staff were extremely nice .  we had a concierge by the name of Edmond , what a gentleman   very warm and attentive.  Keep it up mate your the best concierge I've had , it was a  pleasure too meet you . Extremely  happy will always stay here on my business trip . My family stayed here for a very long time - almost six months!  We had an excellent extended stay in an apartment.  The beds were comfortable and the hotel had great amenities. Quiet location within the Doma area, so can make use of surrounding facilities. Nearby bars and restaurants are also great for a quiet night cap while the kids rest upstairs. I do have a complaint, the older bed mattress was well worn in and had a dip which did not agree with my back. The atmosphere and decor is a little hard and 'cold' but otherwise great. Very good coffee, served (with a smile) quickly and hot. I didn't eat but members of my party all commented in the positive."
    },
    {
        "Place_Reviews": "Adina Serviced Apartments Canberra Kingston (Formerly Medina): Great location, but rooms are desperate for a refresh. Everything you need for a comfortable stay, just needs a few things fixed like the shower head and kitchen cupboard doors. Dryer could also use an upgrade as the bathroom was covered in lint. There was a family with young kids above us for a couple of nights and we heard all their movements. Location is the biggest draw card. Reception hours are 9am to 6pm so it is very difficult to get service after hours when your actually in the apartment. Had to wait in the cold for meal as no access for UbaEats etc after 6pm. Could not access guest internet & maintenance not available after 4pm. Arrived late evening and very little lighting to safely navigate steps etc with suitcases. Too bad if your in a wheelchair because there is no accessubility. Only one lift for 200 odd apartments to each floor but steps thereafter. Access to shower a trip hazard waiting to happen. Rooms dirty, sheets dirty (had to request sheets on the two single beds in bedroom 2 to be changed before use), sauna not working, roof repairs underway, outdoor pool dirty. Very impressed with our experience. The room was excellent. Modern, clean and comfortable. The staff were helpful and courteous. The price was reasonable. Big TV to watch. Two air conditioners  kept the place at a comfortable temperature. There is also a pub right across the road which is family friendly and serves great food. 👍 Very comfortable 2 bedroom apartment with all facilities. We’ll located, close to shops and supermarket. A 25-30 minute walk to the Parliament district. Be prepared to pay $10 per day parking on site, a bit of a shock when most accommodation provides free parking. Good wifi should be included in the cost. Unfortunately it is not. Apart from that, a good place to stay."
    },
    {
        "Place_Reviews": "Hotel Kurrajong Canberra: Great place - neat & tidy rooms. Haven’t tried food here but the coffee is definitely good. This is my third stay at Hotel Kurrajong and they don’t disappoint with their service and attitude towards customers. Definitely a recommended place to stay when in Canberra 👍. This is a lovely colonial-style hotel. Our room was well-appointed and tastefully decorated. The walls are thin, and we could hear people coming and going, but nothing too severe. Stayed 2 nights here. Reception was very welcoming and helpful. Rooms were nice and cosy with stylish bathrooms. It also got a bar with a restaurant for breakfast, lunch and dinner. Food was great but the drinks not so much to my liking. Nice seating area out in the garden or inside area opening to garden. Will definitely stay here next time too! We have always loved our stays at the Kurrajong Hotel in Canberra, making it one of our most favorite places. However, our recent experience was quite disappointing due to the noticeable decline in cleanliness. During my stay at this historic gem in Canberra, the echoes of its rich past resonated throughout. From the intricate hand-carved mantel to the vintage photographs adorning the walls, the hotel seamlessly weaves together history and modernity."
    },
    {
        "Place_Reviews": "Courgette Restaurant: We celebrated our first anniversary few years ago and came back for my birthday 🎉 What a fabulous experience! We had a large group and they set us in a beautiful private room. We all got the three course degustation, and our waitress was able to recommend wine to match for entree, main and dessert. Everything was delicious, the service excellent, and the atmosphere a lovely balance of high class, exclusive and relaxed. We will definitely be visiting Courgette again! A classic fine dining experience with great table experience and atmosphere makes for a perfect date night. Staff accommodated to us switching out one of the desserts which was great. There's only 2 things I would fault here, or it would be a 5 for me. One, there was only the option of tap water or sparkling. I prefer still mineral water. Two, the finger carrot was raw and not tasty. Otherwise, every other dish was perfectly matched and delicious! The staff were attentive and friendly. I will be back and hopefully by then you will have a mineral option. 😊 Excellent food and excellent service. Staff are attentive and serve you with a smile. The atmosphere is lovely just a perfect place to dine. Well done 👏"
    },
    {
        "Place_Reviews": "Canberra Rex Hotel: Very reasonable price for the room, room was clean, quiet and comfortable furnishings.  Easy parking,  reception staff friendly.  Bar upstairs was popular and had a great mood about it. Fairly standard prices for alcohol. Internet was good. Bathroom clean. Our stay has been amazing, 20 minute walk to the city it's easy, there is a tram station located 100m up the rd. I stayed at the Rex for three nights on a business trip and had an exceptional experience. The service was outstanding, and the facilities were excellent; room was big and had everything i needed. Breakfast was fantastic, with a great variety and quality of food. I loved the coffee :) Decent accommodation and service. Not worth the value. I recently attended an event held at the Rex and also spent the night. The event was great. The conference rooms were large, well catered, great audio and visuals."
    },
    {
        "Place_Reviews": "Oxley Court Serviced Apartments: This place is cheap and cheerful. The rooms need maintenance and some refurbishment. We didn't really mind, being only there for one night with some kids for a school sports event. the location is excellent and the place is fundamentally clean. It's just a bit tired. The value is good, though! Stayed in a 2-bedroom with my family for 1 night. Found some dirty underwear and a pair of socks behind the door of one of the rooms, and the toilet was filthy. There was no one at reception and no one was picking up the phone so I can raise the concern right on the spot, so had to pick up the dirty underwear and chuck them in the bin myself. Moreover, we were a family of four, but there was just 1 set of toiletries available. They do not have wheelchair accessible rooms told us they did!!!! Great location, room was very clean which is great for this style of accommodation. Great family option in central location. Helpful staff also. Great accommodation. Clean, spacious, has everything you need. Highly recommend."
    },
    {
        "Place_Reviews": "Manuka Park Serviced Apartments: Everything is great, it has great bed I slept well, the only bad thing is the faucet controls are very sensitive and i had bad wifi in my room, however the reception was considerate to gave me their wifi instead We're on holidays from Brisbane catching up with family. The free EV charger is great bonus. And if I could give 6 stars for customer service, I would 👍 Loved staying here. We stayed here with a group of friends and we all agreed we'll go back. The rooms were a good size and clean. We found what we needed in the kitchen. The bed was comfortable. We were able to walk to both Manuka and Kingston and everything else was a short drive away. The staff we met were lovely."
    },
    {
        "Place_Reviews": "Rydges Canberra: At first glance, Rydges Canberra seems like a dream come true: a gorgeous lobby, a serene central location, and spacious rooms. But, like a beautifully wrapped gift hiding a brick, the reality is a bit of a shocker. Rooms were dirty and rundown. I changed rooms because my first one was unclean and second one was also bad. I wiped down all the handles and surfaces, which were disgusting (see picture of dirt from fridge handle - and that was cleaner than the cupboard!), and there were bloodstains on the mattress protector which you could see through sheets. What a shocking experience from the moment we checked in to the day we checked out. The beds were not clean, the service lacked a little integrity as they said they would make sure we were taken care of at the restaurant after we changed our own bedsheets and pillow cases as the staff that was responsible was already off work. Food is nice but no table service for dinner at the prices you’re charging. Breakfast staff are friendly and busy but time to hire more staff tables are left dirty for ages 30 mins two tables haven’t been cleaned."
    },
    {
        "Place_Reviews": "Iori Japanese Restaurant: I wanted to extend my heartfelt thanks for the wonderful dining experience we had at your restaurant on 19th July . From the moment we walked in, the ambiance was inviting and serene, setting the perfect tone for a delightful evening. What a lovely experience to dine in! All courses had impressive presentation, and the receptionist and all staff treated us respectfully. We got a little treat from the chef because it was a birthday anniversary. Thank you so much for making our dinner extradionally special. We had a pleasant time with divine food. Best Japanese ever … Omg .. I had a blast with this food ! Everything was absolutely perfect! I love the miso soup, everything was super fresh and tasty!! And everyone is super sweet and kind ! I will come back for sure 🫠🥰 It was a mind-blowing experience. All the sashimi was fresh, and the chef so kind gave us complimentary sushi on the house. Always such a great experience."
    },
    {
        "Place_Reviews": "Ramada Diplomat Canberra: If the rest of my stay had been as comfortable as my bed, I would have given this hotel 4 stars. However, it was the coldest hotel I have ever stayed in. People, including me, were wearing heavy jackets and scarves in the dining room - something I've never seen before. The dining room service, while pleasant was incredibly slow and by the time my meal arrived I was seriously cold. I really enjoyed the stay. The breakfasts were really delicious and good customer service. Room is spacious and clean, the window in my room is small and is facing a drive way. Other than that, the room smelt not as good as lobby area. Still i really enjoyed the stay so i give it 5 stars. It is really fancy. I recently stayed at the Ramada Diplomat Canberra with my family and found it to be a very comfortable hotel. The location is convenient, making it easy to explore the surrounding area. The rooms are spacious and immaculate, which added to the overall pleasant experience. The staff were friendly and approachable, always ready to assist with any queries. Was my 5th time staying here, but first in winter cold.  The restaurant food nd staff and area are exceptional.  The big downside is the freezing cold temperature everywhere in the restaurant and bar area. Even the staff said it was freezing. Everyone was in parkas and lots of jumpers. I will never go back there in winter cold again. A few heaters around would be good. This hotel is very comfortable to stay at. Everything is convenient as you walk around and take it all in. Rooms are Spacious and immaculate, The staff are very Friendly and approachable. Daniel at reception was amazing on my arrival with my elderly mother. he was very welcoming . The atmosphere was very pleasant and relaxing."
    },
    {
        "Place_Reviews": "Lyneham High School: their good at chess but bad at everything else, except that i am better than them at chess. This is an offical decloration of war from cgs. Have fun! most of the people are nice but there are HEAPS of ppl vaping n smoking weed un the toilets. I moved skls because of how bad the teachers were and also bc i almkst got bashed by a yr 9 The school is actual so good I used to think this school sucked but when I moved I realised how good this school actual is. They barely care about uniform and in my new school they are so strict about everything. Better than Campbell in most ways Service was great but the gum under the desk tasted stale. Also there was lots of soviet posters around???"
    },
    {
        "Place_Reviews": "Lyneham Primary School: It was a w school but then they started removing stuff and all the teachers left Border Security! Sketchy guy said he went here, don’t think so 😜 This school was one of the first primary schools in Canberra to intergrate  blind and special needs students  in 1981 even earlier when I was there I had stern teachers  then but times have changed  I don't think it's obsolete like that now  but always has excellent morals  for young students  and I hope it is there for a long time to come please keep the mulberry trees and Pips grove chair Good school love the yr5/6 teachers. fantastic friendly local school for well-adjusted kids"
    },
    {
        "Place_Reviews": "Glenloch Interchange: It really needs a speed camera here, because everyone speeds and nobody gives way. Which is a problem because so many roads diverge here and people really need to use their indicators properly, and leave safe space. Can take all exits and merges at full speed if traffic allows. Overly complicated, doesn't allow movement from William Hovell Drive to GDE northbound. I got lost here for a week. It's nice"
    },
    {
        "Place_Reviews": "Canberra Lyneham Motor Inn: Nice bed descent heating in Canberra 🥶 Family rooms are dated but very clean and spacious. Beds are comfy, nice big fridge. Exterior and general look isn't great but it's value for money and immaculately clean. Would stay again Absolutely loved this place.....it was quite even though they had worker's here. Perfect place to stay on a budget. It's clean and has all the basics, such as kettle, fridge, microwave, cups, a box of sugar, tea, and coffee.  In the  bathroom, you'll get a couple of soaps. They make your bed every time. The lady at the reception area is very nice and helpful. We all forgot our phone and Ipad charges, and my kids were quite upset about it. So the lady at the front desk straight away lent us some extra ones she had. Great customer service. Also, the location is fantastic. Have stayed here twice. Very comfortable large rooms with all facilities. Rooms were clean and the bed linen was fresh.A great place to stay. Great value for money!"
    },
    {
        "Place_Reviews": "East Hotel: Gisela at the reception was very warm and welcoming. For me, it made the experience exceptional. Right from the beginning you can tell this is going to be a beautiful please, Starting from outside it’s clean and tidy. Then you’ll be greeted by very friendly and helpful staff, the rooms are incredible it was my 2nd time staying here and I stayed in two different rooms and they were both incredible, clean and up to date. I had forgotten my toothbrush which is no hassle, All I needed to do was pop onto the IPad in the room and order one which came to my door in less than five minutes that is very impressive. I travel a lot for work and this has to be my favourite place to stay as of yet and I’ll certainly be back again. Top spot user friendly central position.  easy under building parking. Great staff. Had brekky in Muse room really good and busy booking required. Range of classy close by restaurants. Spent 2 nights here for work. Recently stayed four nights. This is our fourth visit and the hotel does not disappoint. Our \"room\" was more like a self contained one bedroom apartment. It was fully fitted with kitchen and white goods equipment. There was a good size living area and a large screen tv, with a slightly smaller screen in the bedroom. The only slightly negative issue this visit was that several surfaces in the living area and bedroom were dusty and did not seem to have been recently cleaned. This is really unusual for this hotel."
    },
    {
        "Place_Reviews": "Pilates Canberra: Overnight, weekday stay during the winter months was adequate. For the price of the room, we were disappointed we were placed right near where renovations were being done, having to endure unpleasant noise from early morning. Would have expected to be placed further away from the construction area considering the abundance of rooms. The room was fitted as expected of a hotel of this calibre, but be warned as you'll need to bring your own dental amenities. Location of the hotel was good, close to very good dining options at the nearby Burbury hotel and near parliament house. Great little hotel with excellent facilities. The gym was very spacious and well-equipped, and the spa area was also great. Staff were very friendly and capable. The room itself was more than adequate for a one night stay. The hotel itself is about 2 minutes from parliament and 10 from downtown Canberra by car. Would happily book there again. This is an excellent hotel situated in a quiet leafy area. Only minutes to local shops in Kingston and Manuka  and a stones throw from The back of Parliament House. This place has really comfortable beds. If you're looking for a good night's sleep, then this is the place to go to. The rooms are large and sunny, however there are some issues with maintenance. Our toilet didn't work properly. We had to take the lid of the cistern to get it to refill. There is no minibar in the room's fridge, which wasn't that clean to begin with. The gym is really well appointed; much better facilities than your usual hotel gym. If you want to have a workout during your stay, this place is ideal. They have two squat racks and bumper plates, as well as free weights and machines. The push bike hire station is a great addition too. We hired for 24 hours and rode all around the city. The staff were very friendly and approachable. Good location and good value for money. This is the hotel where we usually stay when we visit Canberra. The rooms are clean and reasonably spacious. It has it's own restaurant. We often go for long walks when we stay here. No, unfortunately it's not in the middle of any shopping areas. But I like the quiet suburban atmosphere of the district."
    },
    {
        "Place_Reviews": "Belconnen Way Hotel & Serviced Apartments: Worst accommodation ever. Microwave disgusting, dirty toilet, cold showers, alot of visible dust. Unfriendly and rude staff who were not really helpful or proactive about complains . Good thing we brought our own domestos, jif and dishwashing liquid to clean out everything first. We had to put a blanket over the couch because it was itchy and prompted so much sneezing. If you're allergic to dust then don't come here. Very poor lighting. Teles dont work. Staff didn't really take care of us in terms of supplying refuse bags daily- we had to buy these. Same receptionist for check in and out - very rude didn't even greet us or pretend to be friendly. Layout of apartment is weird -1 bathroom which is on suite, then others have walk in the bedroom to get to the bathroom. Parking safe and secure. New Bhutanese Bisto in adjacent building for supper or drinks - only plus! Great value for your $. Rooms are neat, clean and comfortable. Staff very friendly and accommodating. Location is handy to most attractions and is quiet at night which is important to me. I would definitely stay there again We booked the 2 bedroom apartment for a night stay. The apartment are dimly lighted with yellow warm lights in the hall & rooms so it is fairly dark. The kitchen and bathroom are brightly lit with white lights . You get what you pay - it is pretty old building but at least it is clean, and the bedrooms are spacious. The only complain will be the leaking aircond in both the bedrooms and soft bed which is not ideal for those with backbone illness Was there because heating in house broke down 6 days TV's wouldn't work cold water in showers toilet door locked couldn't get in had to go home late at night to use toilet though they fixed these issues made the stay uncomfortable and made me look like a pest they were apologetic but to late go one days refund We booked a two bedroom apartment as a family with kids. The rooms could use a spruce up as it is getting on a bit, and the lounge could use a steam clean (hence the 4 stars), but otherwise the rest of the apartment was clean, warm and had everything we needed. The room's pluses were space, a spa bath, laundry facilities and the large choice of channels, plus the staff were friendly and allowed us to park right at the door."
    },
    {
        "Place_Reviews": "ibis budget Canberra: The staff at the reception are amiable and helpful. I have been using Ibis Budget for the last five years and enjoy my stay each time. The location is ideally close to most of the tourist spots. I highly recommend this hotel to those seeking budget accommodation and value for money in Canberra. The room was exactly as pictured so you can get a good idea from the photos online. It was small but clean, the bed was comfortable, the room had an air con and tv plus tea/coffee. The service was friendly and welcoming. The bathroom is very very small and everything (I mean everything) gets wet so be prepared - I did expect this from the pictures and the price. It’s manageable for a night but can get annoying with the toilet and walls getting drenched. I also felt having a parking fee was unnecessary since there were so many spots available and unused. Worst example of global Ibis Budget brand. Worn out hotel, with dirty room with patched up paint work in 4 shades of green. Very much enjoyed my stay in Ibis Budget Canberra. Despite close proximity to Highway my room was super quiet.  Very clean and tidy.  Had absolutely everything I could need. Excellent check in with very helpful and friendly staff nember.  And by using my accumulated points I got to stay for $60 a night in our Capital City.  Can’t argue with that value. Bathroom NOT suitable for those that are pregnant! Or with any physical mobility issues. Materials, design and metal step guard are leathal. Signs warn it's slippery but there is nowhere to grab on to and slipping is almost guaranteed. It has a step up too that is brutal for anyone but especially the vision impaired."
    },
    {
        "Place_Reviews": "The Statesman Hotel: Please read. Well renovated, \"The Statto\" was once a little rough but is now a very pleasant visitor experience. The bar serves the popular brews at a good price and the pie I had for dinner is seriously one of the best pies I've had in recent experience. A great place for a light dinner and a chat. Will go there again. I didn't try the rooms. Special shout out to the Policy and their lovely kitchen staff. The chicken wings were cooked to perfection and the cauliflower florets were the best we’ve had. The Chef in particular was very committed and understanding of my wife’s dietary requirements. As she is celiac they took extra precautions to try to avoid cross contamination. Overall would recommend to locals and folks passing through Canberra. Came to the Statesman for dinner. Food was awful. I’ve never given a 1 star rating before but this bad rating was deserved. Everything seems to be done on the cheap. I don’t expect this business to be around much longer with this level of poor quality. I won’t be back. This is one of the worst hotels I have ever stayed in! The rooms actually aren’t bad but the digital check in system and lack of receptionist is an absolute disaster!"
    },
    {
        "Place_Reviews": "LJ Hooker Manuka: I've had a great experience renting with Property Manager Sukh. She is responsive, professional, and always quick to address any issues. Her excellent management has made my tenancy smooth and enjoyable. Highly recommend! Thank you Natalia Danilova is extremely professional and honest! She managed my investment property with great care and attention, earning my trust and achieving the best possible results. I highly recommend Natalia as the best property manager in Canberra! Professional, efficient and great team. Stephen and Luzian and their team are absolutely wonderful and professionals to work with. Very considerate and humble, we couldn’t be happier with the level of service. We highly recommend Stephen Thompson and his team for any real estate related matters. What a beautiful experience. As a corporate worker and single I have contacted Samuel Thompson via email, but he did not respond."
    },
    {
        "Place_Reviews": "Indian Affair Restaurant (Canberra): A hidden gem in Canberra for Indian food. Food is very tasty and lovely. Staff are so welcoming and friendly. Place is also very quiet and ambience is calm. We celebrated my son's 11th birthday at Indian Affair Restaurant and had an amazing time. The staff were so welcoming and made our occasion extra special including by spoiling the birthday boy. Nothing was too much trouble for our big group, byo wine and cake was fine and help provided with ordering and quantities. Food was divine, spice levels perfect and taste delicious, a real treat. The ambiance of the room is lovely. Highly recommend. Our first time visit to this beauty nice/ cozy restaurant and definitely coming back. This restaurant is consistently excellent at providing top notch authentic Indian food. Service is always five star and the staff are always very friendly and polite. Pricing is a little on the high side but in this case you get what you pay for and we and obviously many other customers keep coming back for excellent Indian cuisine. Quite possibly the best Indian cuisine in Canberra. Great food, extremely reasonable prices and lovely service. Lucky for us it is also local!"
    },
    {
        "Place_Reviews": "Ovolo Nishi: If I could give more than 5 Stars 🌟 I would. The staff went above and beyond to make us feel welcome and comfortable. The rooms are beautiful and the common areas are awesome to sit and relax by the fire, or in the library.  The architectures I very cool!!  The food was delicious, breakfast and dinner and in-room dining at good prices.  Location was fantastic but the parking was a bit much (Wilson parking at $35 per day).   We will most certainly be back and would recommend to anybody going to Canberra. I recently stayed at Ovolo Nishi in Canberra, and unfortunately, it was a highly disappointing experience. From the moment I arrived, it was clear that this hotel did not live up to its hype. I loved the hotel, the amenities and the service. The wood panels are amazing and Monster is incredible. However, I had two bad experiences that don’t allow me to give a 5-star review. One of the reasons I booked with Ovolo Nishi was that it included breakfast, a free minibar, a complimentary drink, and a tote bag. On my arrival, I was informed that the offer had ended that day, and that I didn’t have the right to it. I complained, and they offered me some vouchers for breakfast and drinks, but the minibar wasn’t free anymore. That was a ridiculous situation, as I arrived already needing to complain. Then, when departing, I was informed the total price was different from the price when I booked with a 30% discount. I checked my email, and it was true- the discount wasn’t in my confirmation email. I am 100% sure that when I booked the price it was showing was much less than what I paid in the end, and there was no way to prove it! I should have taken a screenshot when I booked. Again, I felt cheated and unhappy, the opposite of the way I was expecting to leave. Seriously, beautifully done hotel. Ugh where do I start… I can’t explain how disappointing my experience here was. I don’t think I’ve had such a poor hotel experience in my life."
    },
    {
        "Place_Reviews": "Portia's Place: This traditional Chinese restaurant has a history of over two decades, as indicated by the entrance sign.👏 The service staff were warm and friendly. We were the only table of Chinese descent, and initially, we assumed the flavors might be more Westernized. However, to our surprise, the staff introduced us to delicious dishes, and the food arrived incredibly quickly.👍🏻 I accidentally miss my water bottle in restaurant, but the staff promptly chased after us to return it; their actions were truly appreciated.👍🏻 Average place - bland food - rude service. They have said rice price is per person , even it’s written in the menu that it’s per person. When I entered the establishment, I was greeted by a quiet elderly lady, a friendly young woman, and a nervous young Asian man wearing glasses. However, the experience was marred by the behavior of the young man, which significantly impacted my perception of the restaurant. I Walked in and looked at the menu on the table then went to sit down, Then the staff said it was a different price and I laughed and said maybe cheaper because of no plastic takeaway containers and didn't see my sarcasm with tongue in cheek. Just had the most disappointing meal in a very long time complete waste of money.Crispy duck pancakes $45,for six each on it's own plate so by the time it hit the table it was cold,cold shredded duck and cold floury pancakes are not a dining  experience  in any level, not sure what happens if you have a table of six wanting pancakes wouldn't be enough room on the table for all those stupid plates.There was far to much cold stringy duck in each pancake and don't know where the crispy  bit came in to it,of all the delicious  ways to eat duck this is on the bottom of the list,hey ho we had some chicken ginger and pineapple  see photo,it was mangled chicken skin,NO pineapple,just had to get out of there,on top of that 12 bucks for tea and 12 bucks for rice bill of 98 $ SHOULD OF STAYED HOME AND RIPPED UP 20s$Must be something good about it ,it was chockers, no music ,no atmosphere,it's a No from me DONT EVEN BOTHER"
    },
    {
        "Place_Reviews": "Bunnings Fyshwick: Having a carpenter/painter husband it’s always first choice to come to this Bunnings as for trade and special order they are better organised and have more options. We came to buy material for deck and pergola and they were very accommodating to what we needed. Very happy with customer service especially from the ladies at the trade desk. We have bought several items for residential jobs also our own home. Wouldn't allow a fully vegan sausage sizzle and yet don't force others to have a vegan option. Really not a good look, Bunnings. Especially since the charity was for animal rescue. Why eat some to save others? Bizarre decision by a store I will now personally never visit. One stop shop as far as I’m concerned  when it comes to all things building, hardware, gardening with a little bit of crafting supplies thrown in. And if it’s not there or you’re not sure just what it is you’re looking for ( re what ever project you happen to be working on.) there’s always a staff member handy who will be helpful, with either directing you in the right direction within the warehouse or what other store may stock it. 1. Multiple occasions, called prior to check stock availability before driving in to find disparity between computer and actual, wasting trip. Ordered $300 worth of cut timber on a Tuesday to be delivered on the Friday. After waiting all morning, it never arrived. Tried calling five times but the phone rang out. So we drove back to the store where the cashier shrugged and said the order was never processed and the wood hadn’t even been cut. An hour later, four employees and no apology later, we drove home with our timber. Surreal experience. Unreliable and rude staff."
    },
    {
        "Place_Reviews": "Nesuto Canberra Apartment Hotel: My mom and I stayed there last week as we were helping my nephew move into his University dormitory. I organised the room two weeks before the stay and specified a suite  with TWO SEPERATE BEDS, as it's for a mother and son. They said no problem. The day before traveling there , I gave them a courtesy call to confirm TWO BEDS in one suite. They said yes , no problem. We get there, the suite has ONE KING SIZE BED. Call them up on it immediately, they apologize, tell us that there are no rooms left with 2 beds, we'll bring you a trolley bed, which they plonked in the middle of the lounge room, and for the next 3 days we had to walk around it , and it looked like you were in a hospital room. Not happy. Great location, easy walk to shops, restaurants and bars. The place is old, desperately needs a refurb. The rooms are clean-ish. My mattress was very soft. My room had the shower in the bath with a shower curtain. I could hear the water in the pipes at all hours of the night when people showered or used the loo, super noisy. The hallways have a really strong musty odour but the rooms don't smell. The hotel needs to do a deep clean of all the furniture, carpets and clean the aircon, if you suffer from allergies don’t stay here, it’s not clean enough and I got very sick after my stay here. The people at the front desk are friendly and location is good. The staff and location were the only thing this place has going for it. For the price you'd expect to not walk into cleaning equipment left out in the room or the sofa bed half pulled out with cushions left all over the floor or finding wrappers and bottles under the bed. I had to wedge a wooden spoon into the dryer door to keep it shut so it would work. Glass in my foot too. Beds were not comfy at all. Did have a nice hot shower and nice cooking appliances, air con was nice and cold but very noisy. It needed a good cobweb clean outside and we got bite marks from the extra blankets. If your in a pinch and need somewhere convenient then great but otherwise be warned. We left a day early couldn't stand it another night there. These apartments are in a convenient location for conferences.  They have good quality furnishings and well fitted out kitchenettes."
    },
    {
        "Place_Reviews": "Hertz Car Rental - Mitchell Downtown: No issues. Car was ready on my arrival. Brand new Mazda. It was cleaned. Had fuel. Staff were friendly. All good :) The car was scheduled for 1 pm, but nobody arrived until 1:30 pm, and they claimed they were still 20 minutes away. They seem indifferent to punctuality and disregard others' time. We shouldn't have to plead for a car. It's incredibly frustrating. We rented a cube van for a move.  The van was in great shape and worked perfectly.  I thought the price very fair for what we got and the staff were very helpful. I was being instructed by anoz bika. He was really nice with his job and the service he gave us was mind blowning. I've been renting car alot with hertz if i was travelling a long way and till date this service was really comfortable. No issues at all, highly recommended"
    },
    {
        "Place_Reviews": "Abode Woden: I was very happy with my stay here. The rooms were clean and spacious. Beds were slightly too soft, but that's just due to my preference. The only other thing I would have liked is parking options, as if you were staying  multiple nights and wanted to sleep in, you couldn't due to having to go down to pay for parking in morning. Other than that, I would stay here again for sure. Many thanks. Location is very convenient, close to bus stops, taxi stops and shopping centre. Staff are very friendly and helpful. The catering on site is good and room delivery is easy to access from online booking. Room is clean and spacious. Facility is convenient to use: washing machine, dish washer, etc. Rooms were clean and tidy. However we found there to be no bin liners, sanitarian bags, salt or paper and not much sugar for our coffees. Certain objects were in very odd places that you wouldnt usually place. For example the toaster was found on the bedside table and the kettle was found under the bathroom sink. But everything was clean and tidy. Wasn't the best view (a brick wall) but that I understand can't be helped as its the building across the room. But very affordable for one nights accommodation and was close by walking distance to the local supermarket. Best place to stay hands down!  It felt like the priority was on the guest's experience, not on profit.  You could do everything online, order from the pantry for pre-made meals & snacks, room service with not charge & check out.  The food was amazing & the coffee hands down best in Canberra. Close to lots of amenities in the ACT - more centrally located compared to Civic."
    },
    {
        "Place_Reviews": "The Village Canberra: Had a truly great stay here! Great facilities, nice relaxed vibe, amazing location! Special thanks to the lovely Ryan on the desk who was extremely helpful! Very limited parking available on-site, $15 daily parking at nearby Canberra centre was easy. The Staff are very attentive and friendly always ready to help you if you need any assistance. Rooms are big and amenities very well looked after. I would highly recommend it the Village if you come to Canberra Do not recommend for young people, especially women. The only good thing is the location, closer to the Canberra Centre. Actually quite a good hostel. Carpet, paint and decor is a bit old but otherwise very solid hostel option in the middle of Canberra with reasonable parking options nearby."
    },
    {
        "Place_Reviews": "Quality Hotel Dickson: The Quality Hotel in Dickson ACT is an adequate place to stay whilst in Canberra if you are looking for a comfortable place with the convenience of nearby shops and restaurants. The furnishings are clean, pleasant and modern and expect to find the usual in-room facilities such as kettle, air conditioning, microwave and free wifi. I booked my room online, weeks in advance and thought I caught a pretty good deal for a one night stay, but my room overlooked a central courtyard with a bar on the ground floor, so a lot of noise reverberated upward and I wouldn’t had been able to retire to an early night had it not been for the earplugs I packed. There was another wing which appeared to be tucked away from the noise, however it was not clear when my request for an alternate room was denied whether this was because of my discounted accommodation or if the hotel was indeed fully booked. Otherwise, the reception staff were friendly. Another unexpected but disappointing surprise was how the tea with my room service continental breakfast was served in a disposable paper cup. Were they thinking I wanted my tea to go? We had a very pleasant stay at Quality Hotel Dickson recently. We were part of a large group who were attending an International Reunion in Canberra. I am a regular visitor to Canberra for work. My preferred stay is at Quality Hotel Dickson (when available). To anyone considering a stay at this superbly renovated hotel, I wholeheartedly recommend it to everyone. The newly refurbished restaurants and cafes offer exceptional dining experiences with food that is simply delightful. A special shout-out to Savanna, Olivia, and the entire front desk staff for their professionalism and outstanding customer service. A heartfelt thank you to each person contributing to the excellent work, and keep up the fantastic job! The room was clean, decor was modern, staff were friendly & helpful, plenty of pillows to choose from for the bed."
    },
    {
        "Place_Reviews": "Wokitup! Braddon: This place is reasonably priced and good amounts. Fast service and polite. I had the combination chilli box. Was nice and just right for a cold night to warm up. The noodles were not very long in length. I think the cook might have cut them while cooking.  Probably a bit too much onion and there was not much separation in the ingredients- by which I mean it all melded together a bit and was a bit greasy. Others had the Singapore box and that was much better - so maybe I just got a average serve. I would recommend this if you are in a hurry. I ordered the chicken noodle and veg box but the box came was an enormous amount of noodles and no vegetables or protein. The only piece of chicken in the meal did not  taste fresh at all. A pretty l decent amount of food in each dish. I got two. Probably way too much rice compared to the protein…that would be my only issue. Apart from that, it tasted good and filled me up. A few years ago, I would have easily given Braddon 4.5 stars, but the taste and quality Great fresh food. Staff are friendly.  Serving sizes large. Will definitely return"
    },
    {
        "Place_Reviews": "The Australian National University: Visited the university during a short stay in Canberra. Heard it was Australia's top university, so had to make a visit. Campus is located in the center of the city with access to the newly built tram that's within a walking distance. University is well maintained and quite modern building infrastructure. There are a number of shops located within the campus. It's a beautiful campus and obviously a great research institution, however if you aren't an academic/in research or simply studying an undergraduate that isn't in a select few areas, then they have no concern for your learning experience. This is one of few unis that is incredibly stubborn and uncaring in regards to any real world experiences, issues or difficulties that you might go through in your life. Shame on you that you have professors like Alam saleh that is supporting the Republic of Islamic of Iran (head of the terrorists) thats killing the Iranian, Syrian, etc. since 45 years ago till now and he thinks he's an Iranian. Shame on you for having this professor I feel sorry for your students. My daughter was planning on going to your university but as we were researching there is no point to send her there when you have terrorist supporters like him working there support terrorists. I'm an Iranian who lives in Australia. I'm biased, but this is a great uni. Lovely people, great courses, great tutors 😊. Especially the School of Management. Has spent almost 10 years in ANU, it is always a lovely place for work and study, really enjoyed the peaceful nature environment and the culture of the academics."
    },
    {
        "Place_Reviews": "National Zoo & Aquarium: I was pleasantly surprised! It was a fantastic experience with a great layout and a wide range of animals to see. Compared to Taronga Zoo, it had fewer hills, making it easier to navigate and enjoy. Surprisingly, it also felt larger than Melbourne Zoo, offering plenty of space to explore. My wife and I did the Wonders of wildlife experience during the recent school holidays. It was amazing. A whole 7 hour day of encounter after encounter. Quite an extensive zoo that seems dedicated to providing natural environments for the animals. It has a network of user-friendly paths and exhibits. It is an excellent interactive educational site for children. The aquarium is good but seems tired. We’ve always loved the National Zoo and living in Canberra have been lucky enough to visit many times over the years! Today we did the African Savannah Safari with the lovely Jolly and Cooper and had the best time! We learned so much about the wonderful rhinos, elands, lemurs, zebras, giraffes, Barbary sheep and cheetahs. Such an unforgettable experience. The guys were super knowledgeable, friendly and made the whole experience just awesome. It’s so nice to see and hear how much the staff at the zoo truly care for the animals and know their personalities. Highly recommend the experience! Huge location in regards to parking, different entry points and very spread out."
    },
    {
        "Place_Reviews": "High Court of Australia: This is a hidden gem! I did not realise you could tour this place but oh my goodness I'm so glad I went! In every room there is a guide there who will talk you through the different architectural, legal and historical aspects of the room! The tour guides are knowledgeable and they go above and beyond to make sure you learn and that your visit is meaningful for you! I will definitely be back when there is a case on to check it out! Cannot recommend it enough for all ages! If you are a fan of brutalist architecture (I am), then this is a building not to be missed. Around forty years since it opened and still looking pristine - the same cannot be said for the approaches to the building which are being poorly managed. Had a nice time touring this place. The staff, from the security to the informants, are very kind and knowledgeable, going out of their way to help my experience. Nice time here Odd place to visit, but quite a spectacular building and well worth spending 20mins looking around.  Its 50m away from the Art Gallery.  Helpful staff very happy to provide information about the building.  best to visit when courts not in session! Oh Australian , oh Australian, what spectacles I see in this Land,"
    },
    {
        "Place_Reviews": "Thai Cornar Restaurant: Excellent service by their staffs. The place is so crowded. Do not recommend for laksa at all 😭 The restaurant is right in the famous Manuka circuit. I was craving for Thai food and I am glad I found this. The staff are efficient and attentive. The menus are reasonably big and embrace many variants, all done well, while the food is fresh and fast. The best tasting food, comfy area and great service. Fastest food delivery. Would definitely recommend the seafood clear noodle soup, the flavour is sensational. Not really busy so not too loud even on school holidays. I eat pad krapow wherever and whenever I can including Thailand.  This was not Pad Krapow.  The hero should be holy basil but I struggled to find any.  There was a “bland gravy” rather then a pungent sauce.  I requested “super spicy” and again, struggled to spot the chilli portion.  I also requested chicken mince but it came with chicken pieces - again not normal with pad krapow. We were looking for a Thai restaurant on Sunday afternoon and this place was open. We didn’t know what to expect but the food was quite good. The stir fry duck and the chicken and mushroom soup were my favorite dishes."
    },
    {
        "Place_Reviews": "Peppers Gallery Hotel Canberra: Our first stay at Peppers Gallery. We stayed for 3 nights and loved our stay. Reception staff were so friendly and helpful.  Location was ideal for visiting ANU. Parking was very secure. Beds were super comfortable, and rooms were very clean and large (we booked a king room). Loved the touch of walking into a warm room with soothing music being played. Breakfast buffet is continental only, but you are offered a full cooked breakfast straight from kitchen which was delicious.  Unfortunately we didn't get to try their very popular restaurant, as it was closed on Sunday nights.  Library Bar was lovely to have a drink in. Highly recommend a stay here!! Clean and comfortable room, very large bathroom. The room we booked had a massive bath tub which was amazing, and there’s Himalayan bath salts to go with your bath. Bed was comfy and hotel was nice and quiet. The dinner from the restaurant was very good, highly recommend the pappardelle pasta. The room was tiny. You open the door and walk into the bed. There are two frosted glass panel doors that go into the bathroom. I could fit my hand between them when they were closed. If your into watching someone on the toilet while you sit on the bed, this place is for you. The shower soap wasn't in the shower. You had to get out of the shower and go to the vanity to put the soap on the wash cloth. The bathroom windows had frosted plastic contact stuck to the glass that was falling off everywhere and that was your privacy. Missing towel rails. You had to put your towel on the toilet cistern. My wife had a bath. I had to wait 30mins for the water to heat up again before I could have a shower. We were told AFTER checking in. There are only 15 parking spots at the hotel. I had to park two blocks away on the street and pay extra for parking. The entire hotel just felt tired and unmaintained. The only good thing is the location. We could walk everywhere. Definitely do not recommend this hotel Beautiful place with a relaxing atmosphere. The fancy bartender was really welcoming and fantastic at making drinks. Might be the best Tommy's margarita I've ever had. Plus the chat was great. Came here for my partners birthday, which the staff had prepared nice surprises."
    }
]