[
    {
        "Place_Reviews": "QT Canberra: Our stay at QT Hotel in Canberra was outstanding! The true test of a hotel's quality is how they handle things when they go wrong, and QT Hotel passed with flying colors. We experienced a minor issue during our stay, but the staff's prompt and efficient response turned it into a positive experience. This is one of the hardest reviews I have had to do. I would have given it his zero stars if not for the staff. The staff there are amazing. Really good. Nothing is too much trouble. The service is great. That’s where it ends sadly. Having stayed in multiple QT hotels, I was sorely disappointed with the quality of the rooms compared to the other locations. Rooms are usually extremely lavish and quirky yet the QT Canberra felt more like an IBIS. The lobby sadly is the only real modern aspect to the hotel. There is also extensive and noisy construction going on outside which can be heard even with the balcony door closed. $365 a night no breakfast. Right next door to major build works. There is no where close to get brunch or the like as this hotel does not open for food until 12pm. The room is adequate but not stunning which is why I feel like this is a $160-$200 Max place as it is quite ordinary. Prices on the menu are not correct, there is an additional charge. Good location. Parking at $30 per day which feels a lot on top of the accommodation.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pavilion on Northbourne Hotel: Stayed one night.  Room was clean, bed comfortable.  Was surprised that the room was quite large and had a bonus small bath / shower. Reception staff pleasant. Bar down stairs was quiet with a TV and lounges. The alcohol was reasonably priced.  The heating system wasn't quite that good and there wasn't any blankets but everything else was good Great place for an overnight stop and a meal. I can't fault this hotel. It is excellent value. Very pleasant staff. Good sized, clean, modern room on the 3rd floor with all inclusions. On site restaurant with well-priced meals and a very good buffet breakfast. The on-site parking is behind a secure gate. Will definitely stop here again on our way through Canberra. We have stayed here a number of times and always had a lovely room, however this time we must gave lucked out as we had the worst room, the carpet was old and dirty and the furniture all chipped and the shower impossible to regulate, it had two settings, Scalding hot or cold. Took a science degree and steady hand to find the right sweet spot. So if they book you in to 205 ask for another room! Be careful to not to be burnt when shower because water temperature is unstable. It can be freezing or very hot. Room is freezing. Air con temperature in the room can’t be controlled. Set 30 degrees but still freezing. One of the lamps was not work. Beautiful clean friendly rooms were warm beds comfortable absolute delight topping it off the breakfast was frigging amazing my wife is gluten & dairy free and they were great in  accommodating her needs.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Garden City Hotel, BW Signature Collection: The accommodation was truly excellent. The room was dated but decently clean.  The shower pressure was good, but the temperature fluctuated.  The very squeaky door to the room was fixed after I mentioned it.  The light flickered in the bathroom in a creepy way, but I forgot to mention that until my last day.  The buffet breakfast for $25 was terrible.  Selection was poor, and quality was low. I’ll start with the positives first. The staff were friendly and helpful. The water pressure is strong, the aircon works fine and the bedroom and bathroom was clean (but outdated). I tried the dinner room service and the food was tasty. My granddaughters and I had a fabulous week in the ACT using GCH as our base. We didn't use the bar or restaurant, but the fare looked quite acceptable. We also didn't use the pool as it was the middle of winter, though it looked beautiful. I don’t know where to start from. Room was an absolute shocker for me and my husband. The pictures they have posted online don’t match when you see them live. There was a very unpleasant smell in the entrance, throughout the hall way to the rooms. Room was very small, was not cleaned properly. There were tissues in the bedroom bin and the toilet bin already. The cups, glasses and the spoons were dirty. When I told the guy in reception about the cup, he was not interested in swapping. He was like oh ok bring the cup downstairs and I will swap it for you, seriously? Why did I pay $154 for? Never going back there again. The receptionist was rude.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adina Serviced Apartments Canberra James Court (Formerly Medina): I recently had the pleasure of staying at the Adina Serviced Apartments during a business trip, which lasted about a week. The location is notably convenient, nestled close to the shopping center of Canberra, making it an ideal spot for those looking to explore the city's retail offerings. The premises were consistently clean and quiet, providing a peaceful retreat after a day's work. I cannot recommend this hotel enough! The customer service was amazing from check in to check out, the rooms were big and spacious, very clean amenities and very close to the city centre. Parking was extra $ but that's expected in the city - it's private and secure so was worth the money. Definitely book if you want a nice room, good sleep and a stones throw to the Westfield, coffee shops and restaurants. 2 bed apartment needs upgrade.  Beds were as hard ad rocks! Microwave from 80s and some mould on bathroom.  Two LIFTS not working very inconvenient.  Cost high just the same. Air con in lounge very old with old remote. Great location, staff were friendly. The apartments are a generous size but they are in desperate need of an upgrade. The building was built in the early 90s and the kitchen and bathrooms are definitely from that era. Room pretty run down, hot water system needs an update if you want to bath and shower.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Courgette Restaurant: We celebrated our first anniversary few years ago and came back for my birthday 🎉 What a fabulous experience! We had a large group and they set us in a beautiful private room. We all got the three course degustation, and our waitress was able to recommend wine to match for entree, main and dessert. Everything was delicious, the service excellent, and the atmosphere a lovely balance of high class, exclusive and relaxed. We will definitely be visiting Courgette again! A classic fine dining experience with great table experience and atmosphere makes for a perfect date night. Staff accommodated to us switching out one of the desserts which was great. There's only 2 things I would fault here, or it would be a 5 for me. One, there was only the option of tap water or sparkling. I prefer still mineral water. Two, the finger carrot was raw and not tasty. Otherwise, every other dish was perfectly matched and delicious! The staff were attentive and friendly. I will be back and hopefully by then you will have a mineral option. 😊 Excellent food and excellent service. Staff are attentive and serve you with a smile. The atmosphere is lovely just a perfect place to dine. Well done 👏",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Canberra Rex Hotel: Very reasonable price for the room, room was clean, quiet and comfortable furnishings.  Easy parking,  reception staff friendly.  Bar upstairs was popular and had a great mood about it. Fairly standard prices for alcohol. Internet was good. Bathroom clean. Our stay has been amazing, 20 minute walk to the city it's easy, there is a tram station located 100m up the rd. I stayed at the Rex for three nights on a business trip and had an exceptional experience. The service was outstanding, and the facilities were excellent; room was big and had everything i needed. Breakfast was fantastic, with a great variety and quality of food. I loved the coffee :) Decent accommodation and service. Not worth the value. I recently attended an event held at the Rex and also spent the night. The event was great. The conference rooms were large, well catered, great audio and visuals.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Iori Japanese Restaurant: I wanted to extend my heartfelt thanks for the wonderful dining experience we had at your restaurant on 19th July . From the moment we walked in, the ambiance was inviting and serene, setting the perfect tone for a delightful evening. What a lovely experience to dine in! All courses had impressive presentation, and the receptionist and all staff treated us respectfully. We got a little treat from the chef because it was a birthday anniversary. Thank you so much for making our dinner extradionally special. We had a pleasant time with divine food. Best Japanese ever … Omg .. I had a blast with this food ! Everything was absolutely perfect! I love the miso soup, everything was super fresh and tasty!! And everyone is super sweet and kind ! I will come back for sure 🫠🥰 It was a mind-blowing experience. All the sashimi was fresh, and the chef so kind gave us complimentary sushi on the house. Always such a great experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Indian Affair Restaurant (Canberra): A hidden gem in Canberra for Indian food. Food is very tasty and lovely. Staff are so welcoming and friendly. Place is also very quiet and ambience is calm. We celebrated my son's 11th birthday at Indian Affair Restaurant and had an amazing time. The staff were so welcoming and made our occasion extra special including by spoiling the birthday boy. Nothing was too much trouble for our big group, byo wine and cake was fine and help provided with ordering and quantities. Food was divine, spice levels perfect and taste delicious, a real treat. The ambiance of the room is lovely. Highly recommend. Our first time visit to this beauty nice/ cozy restaurant and definitely coming back. This restaurant is consistently excellent at providing top notch authentic Indian food. Service is always five star and the staff are always very friendly and polite. Pricing is a little on the high side but in this case you get what you pay for and we and obviously many other customers keep coming back for excellent Indian cuisine. Quite possibly the best Indian cuisine in Canberra. Great food, extremely reasonable prices and lovely service. Lucky for us it is also local!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Precinct Pasta: Amazing value for portion sizes, pasta flavours are 10/10! It is a little on the saltier side for my liking but it’s so satisfying and delicious. Definitely recommend the precinct pasta. Garlic bread is a tad oily but the focaccia is incredibly light and fluffy !! Staff are always friendly and attentive !! Waiting time for mains do take a little longer and we tend to go during off-peak time, so just be aware. The decor is dated, chairs can get uncomfortable to sit in after a few hours as well. But I’d definitely recommend if you are craving pasta! My partner and I stumbled across this gem tonight and can’t stop raving about the food! We love a bowl of pasta and this pasta is perfect! The service was fantastic as well, very polite and kind. Would recommend! If I could give more than 5 stars I definitely would!! Everyone knows precinct pasta has one of the best pasta menus in Canberra. They also have absolutely mouth watering breads, but this evening I branched out to order the lamb shank from the specials board. BY FAR! the best dish i have had in over 12 months!!! I cannot express in words how much i enjoyed every flavour and every texture. sensational food made even better by warm welcoming staff. Great balance of generous, well crafted meals, fair pricing, and friendly efficient service. We had dinner for two (2 mains and a bottle of red wine) for about $85. Reminded me of the comfort to be found in great little Italian restaurants - an authentic restaurant's heart reaches beyond the plate.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The George Harcourt Inn: Quick, friendly and helpful service. We love this place. Food outstanding the best in all of Canberra 👌 😋 the drinks amazing and so many to choose from, the coffee is very good 👍 the atmosphere is calm and nice lots of old antique things to see hanging around the roofs and walls. The kids enjoyed their meals and finished all ( all kids' meals $12), which is saying something. I'd highly recommend you visit you won't be disappointed at all. We will be coming back for sure if you are ever back in Canberra Absolutely loved the steak and Guinness pie here! The flavors were spot on and it was cooked to perfection. The vibe of the place is fantastic, creating a warm and inviting atmosphere. Definitely a great spot for a meal and drinks! Had lunch today. Was a Tuesday afternoon so not busy. Great seat by open fire. Foods always amazing. Atmosphere is great although if you don't like loud avoid sitting inside during the late arvo to evening as it can become loud - understandably normal of course since it's popular.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Portia's Place: This traditional Chinese restaurant has a history of over two decades, as indicated by the entrance sign.👏 The service staff were warm and friendly. We were the only table of Chinese descent, and initially, we assumed the flavors might be more Westernized. However, to our surprise, the staff introduced us to delicious dishes, and the food arrived incredibly quickly.👍🏻 I accidentally miss my water bottle in restaurant, but the staff promptly chased after us to return it; their actions were truly appreciated.👍🏻 Average place - bland food - rude service. They have said rice price is per person , even it’s written in the menu that it’s per person. When I entered the establishment, I was greeted by a quiet elderly lady, a friendly young woman, and a nervous young Asian man wearing glasses. However, the experience was marred by the behavior of the young man, which significantly impacted my perception of the restaurant. I Walked in and looked at the menu on the table then went to sit down, Then the staff said it was a different price and I laughed and said maybe cheaper because of no plastic takeaway containers and didn't see my sarcasm with tongue in cheek. Just had the most disappointing meal in a very long time complete waste of money.Crispy duck pancakes $45,for six each on it's own plate so by the time it hit the table it was cold,cold shredded duck and cold floury pancakes are not a dining  experience  in any level, not sure what happens if you have a table of six wanting pancakes wouldn't be enough room on the table for all those stupid plates.There was far to much cold stringy duck in each pancake and don't know where the crispy  bit came in to it,of all the delicious  ways to eat duck this is on the bottom of the list,hey ho we had some chicken ginger and pineapple  see photo,it was mangled chicken skin,NO pineapple,just had to get out of there,on top of that 12 bucks for tea and 12 bucks for rice bill of 98 $ SHOULD OF STAYED HOME AND RIPPED UP 20s$Must be something good about it ,it was chockers, no music ,no atmosphere,it's a No from me DONT EVEN BOTHER",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Royal Hotel QBN: My family and I dropped in here for dinner while visiting Canberra from Sydney on a Friday night. We didn't realise we had to make a reservation but one of the staff accommodated us at short notice, which we were grateful for. The food was fantastic, reasonably priced, service was quick, staff were friendly and atmosphere was great. And would you believe we won a meat raffle! What a way to top a great night out. I would highly recommend this venue and will definitely be eating here again :) We had a wonderful 2 course meal at a surprise birthday party and it was absolutely delicious. The staff were so accommodating and helpful with a fantastic atmosphere!! Highly recommend and will be going back for sure! I am very disappointed about my steak, I ordered medium. Look!! what I got well done steak!!! Look like the chef doesn't understand medium!!!! So many times with the steak is always like this! Fantastic food, large menu, reasonably priced and short wait times, a large variety of tap beers that are a bit pricey. Has pokies room, TAB, dining area and couches. Enclosed, heated outdoor smoking area, is nice but not very big. Facilities are clean and obviously well maintained. Amazing pub. No wonder it was pub of the year (NSW) and won best steak in Australia. Amazing food. Great live acts (music and comedy etc). Food fantastic. Good TAB area - proud to call this my local. Great staff -  in particular Hevi, Matt, Mariana & Melinda.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Wokitup! Braddon: This place is reasonably priced and good amounts. Fast service and polite. I had the combination chilli box. Was nice and just right for a cold night to warm up. The noodles were not very long in length. I think the cook might have cut them while cooking.  Probably a bit too much onion and there was not much separation in the ingredients- by which I mean it all melded together a bit and was a bit greasy. Others had the Singapore box and that was much better - so maybe I just got a average serve. I would recommend this if you are in a hurry. I ordered the chicken noodle and veg box but the box came was an enormous amount of noodles and no vegetables or protein. The only piece of chicken in the meal did not  taste fresh at all. A pretty l decent amount of food in each dish. I got two. Probably way too much rice compared to the protein…that would be my only issue. Apart from that, it tasted good and filled me up. A few years ago, I would have easily given Braddon 4.5 stars, but the taste and quality Great fresh food. Staff are friendly.  Serving sizes large. Will definitely return",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai Cornar Restaurant: Excellent service by their staffs. The place is so crowded. Do not recommend for laksa at all 😭 The restaurant is right in the famous Manuka circuit. I was craving for Thai food and I am glad I found this. The staff are efficient and attentive. The menus are reasonably big and embrace many variants, all done well, while the food is fresh and fast. The best tasting food, comfy area and great service. Fastest food delivery. Would definitely recommend the seafood clear noodle soup, the flavour is sensational. Not really busy so not too loud even on school holidays. I eat pad krapow wherever and whenever I can including Thailand.  This was not Pad Krapow.  The hero should be holy basil but I struggled to find any.  There was a “bland gravy” rather then a pungent sauce.  I requested “super spicy” and again, struggled to spot the chilli portion.  I also requested chicken mince but it came with chicken pieces - again not normal with pad krapow. We were looking for a Thai restaurant on Sunday afternoon and this place was open. We didn’t know what to expect but the food was quite good. The stir fry duck and the chicken and mushroom soup were my favorite dishes.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Evergreen Bed & Breakfast: Beautifully presented, lovely owners, good sized room, great shower with optional shower stool. Lovely full breakfast, including catering for dietary restrictions. Waterproof mattress protector and very comfortable and fresh bedding and linen. Parking on site. Can’t fault a thing. Would gladly return anytime I go to Canberra, especially if with my additional needs child. Highly recommend. Had an awesome time at this cute little bed and breakfast. Walking distance to shopping and local attractions, yet far enough away to be quiet in the evenings. Toasty warm with amazingly comfortable beds. The hosts are friendly and accommodating. Nothing is too much trouble. Full continental breakfast or cereal available in the morning. Highly recommended. I stayed here for two nights on my travels, Pete & Chloe were very welcoming from the minute I knocked on the door. They filled me in on all the sight seeing in the area and the easiest ways to get around. The whole place was decorated very nicely, the house was very clean but homely, beds were very comfy, room was nice & warm, tv worked without issues. Also a big shower & bathroom area. I would highly recommend i'll be staying here next time I pass through The response from the hotel owner to my booking being cancelled below is inaccurate. Despite the hotel advertising that they are pet friendly, I informed the hotel that I was travelling (for one night only) with a PUPPY. Despite this, and puppies NOT being the size of a pony, they told me I would not be accommodated. Their pet policy is NOT friendly and they shouldn’t falsely advertise that they are. Our family booked & paid $225 +$1.01 for 4th July 2020 stay, they were closed & took our money.  Pete Dickinson told me he had refunded it 5th July.  It is now 27 July & my family haven't had a refund.  Just excuses.  It ruined our time away & we had to pay again to stay elsewhere.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Wokitup! Phillip: Like the other reviews, I got the satay chicken. Was tasty but there was two pieces of chicken in the whole meal (regular not small size) almost no vegetables either. Unfortunately won’t be going back anytime soon. The food is good and fresh, they've really nailed the portion/sauce/noodle/meat balance. Service was fast and the restaurant was clean. Like the other reviews, we ordered 4 regular meals ie satay chicken, 2x pad thai and chilli combo. Very little meat and almost no vegetables.  So basically noodles with sauce. We ordered the satay chicken, the VG box and the chips and all was great! Extremely salty! Staff who cannot care less about customers at the counter. Ignores despite several attempts call out. Really bad attitude and my money has better places to go. I will not \"disturb\" them anymore. There are many other choices!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Reading the reviews, I think some people may have unrealistic expectations of retail staff. Honestly though, service was good, and the food was high quality. I'm use to the chicken being died af, but it was fresh here. Had a great experience, iv never been into a subway that was so organised! The two men working were fantastic and worked so well as a team during the busy lunch period. Ordered veggie delite, Lima (staff member) started preparing chicken for another customers sandwich while mine was toasting so I asked her to change her gloves and she refused saying it doesn’t matter because everything is mixed and touching. I said I would still like her to change her gloves, I had to ask 4 times before she changed them with complaint and kept telling me how everything is mixed so I shouldn’t care and she shouldn’t need to change her gloves. Lima was rude and uncaring staff and talked down to me because I had asked her to simply change her gloves. No other worked at any other subway I’ve ever been to as had an issue with being asked to change gloves. Disgusting behaviour from Lima. No frills but good bang for the buck and I never hesitate to pop in for lunch. Staff are friendly, efficient service, and thankfully the toaster issue seems to have been solved; around Covid it was out of service for a solid year, dealing another setback the world didn't need. A good (but not great) store, same as most of the others in the chain. Lots of stock, food was fast to prepare, and value is reasonable. Staff can be hit-or-miss.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Nando's Woden: We were visiting canberra with friends from melbourne. As we love nando's we went to this one but were shocked with the food quality & cleaning of the place. Staff was nice & friendly. I believe this is one of the worst branch we have ever been to. Never had bad experience with nando's before. It ruined our day as we were having late lunch & were hungry.I hope they fix it. Used to be good ...this time it was a very bad experience...probably the worst nandos branch i have been to..portion sizes were  very small...i noticed my chicken breast was sliced near to end ,where it supposed to be whole. I love veggie burger and pita also its have perfect peri peri chips because nothing deep-fry other than chips on chips fryer. Poor value for money. Poor customer service. Heard staff getting yelled out at the back by someone, the owner? Do yourself a favour and go grill'd instead. Compared to Belconnen Nando's this one not great..... i have been so many times, they deliver over cooked Chicken every time.... :(",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Baso Canberra: Great venue that gets lots of good acts.  Have been to quite a few this year, really good to be able to get so close to the action Multiple stages, friendly staff and great bands, make it the place to see alternative acts in Canberra. Whether it's for a meal, a cheeky game of pool, watching a band, having a drink or all of the above, the Baso is an all-round great venue. The Basement is everything you want in a gig venue. It's grungy, has great pub food (I had a Temple of the Dog), pool tables, and great staff (the guy who picks up the glasses is an awesome dude!). The one downside is that if you're not up the front when the band starts, you can't see much more than the bands' heads (see photo). It would be good if the stage was a little higher. That said, the sound was amazing! If I didn't live in Melbourne I'd be there more often! A++ Great option for a night out in Canberra.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Please train your staff better. I was there today at 6:09pm trying to collect a parcel. I showed the barcode, the code, the email, my ID, everything. The staff member said my parcel isn't there. Then she apparently tried calling someone in the back to help, put me aside and helped the people behind me. No one came out to help me. After she cleared the line, she took my information again, then open the cupboard again and my parcel were there. She then pull out some paperwork and filled it, slowly. I have picked up parcel from BP Phillip before, no issue at all, walk in, show ID, have the code, walked out. Today the whole thing took 30 minutes, I really don't understand how or why. Please train your staff better and inform them on how to look for parcel, wasting customers time is unacceptable, especially the parcel were in the cupboard the whole time. I called last Friday to confirm how long I had to collect my package, I was guaranteed 2-weeks. I came to collect it today and was told my package was no longer there and that the holding time was 7-days. This is extremely frustrating. If the correct information was provided this would never have been an issue. Very disappointing & now I have to chase up my packages whereabouts. The employees is there job but he was asking for me different questions Please train your staff before placing them on Counter. People were waiting in three pumps - but the staff was nowhere to be seen. He didn’t activate the pump, the pump was getting crowded. I have recently been using my Qantas FF card to earn points at BP service stations.   Today the man at the BP, Woden, told me very rudely that my card was old, and shoved it back at me.   I asked what I needed to do, and the fellow said 'get a new card'.   'The card needs to be scanned.'",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp Truckstop: NOTE: They are back open and the fuel machines have been all replaced. Positive: The fuel prices are consistently lower than many other service stations. Past few times we have filled up here, diesel has been around 20c cheaper per litre. Not coming back to this store anymore.Filled up the fuel, the person who is responsible didn’t gave me clear instructions of claiming my discount on fuel.After tapping my card, he mentioned that the rewards card must be scanned before tapping my bank card which resulted in not getting my rewards point or discount I deserved.Waste of travelling all the way to this one,I better off to Kingston store. Old mate working as a cashier in this store is rude. Hope I can give 0 star as this place is dodgy. I filled my tank with them tonight and the amount I need to pay was $105.57. I asked the staff to split the paymemt to $90 and $15.57. And he passed me the EFTPOS terminal with the amount of 165.xx! Luckily I checked it before I actually paid and told him that the number was wrong. He was unwilling to change it and said that the number was correct just the reading on EFTPOS Terminal was wrong. OMG, what an excuse!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: One of the worst excuses getting from your worker. I order and I Clearly mentioned that please pack it half-half ( separately) but she didn’t and when I asked her why she didn’t follow the instructions she said that she don’t have time. So team please teach or give some training to your workers that how talk with the customer. Thanks The Indian-looking woman in the black shirt was blunt and unfriendly. It is 5pm on Saturday in the food court and it is closed even though supposed to be open until 8pm??? The lovely lady works by herself so she's handling food and payment by herself, I was watching her she received cash payment without take off the gloves and later on was pressing some Salads on the bread using the same gloves. Possibly the worst Subway in Australia. Avoid. Below is a routine experience I've had many times there:",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Friendly staff made great sandwiches.  Not overloaded with sauce. When I advised my sons was only chicken and cheese, the sandwich was promptly finished, have had experience at other subways where they continue to ask for salad and sauce and salt and pepper, when told nothing else. Great listeners. Fairly new store at the time of this review. Friendly staff, great service, easy parking. Seems relatively busy, which keeps the salad being used and fresh! Food was fine but didn't like the dropped salad being picked up off the counter where meat was also being handled. A food delivery service was using the disabled car park right outside. Subway should discourage this and not use drivers who do this. The team are wonderful. The service is exemplary.  The food is consistently terrific. Could not rate these guys more highly.  Definitely best store in our region. Went in tonight (11th) and had an amazing experience! The young lady who helped me was bright, warm, and organised. I had a large order and she guided me through the whole way! Very well done to her",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Dropped in for lunch - barely anyone there. Rediculously stingy on toppings, until you ask for salt. You won't be able to see your 2.5 leaves of spinach through the distribution of salt that makes maccas fries loop moderated and healthy. Ordered a footling meatball on the subway app to have it delivered. It took 1 hour with back and forth progress only to have my ordered cancelled. Number doesn't even work. Served by the \"tuxedo mask\" look alike asian male with glasses. not a word, no personality after I said \"Hello, happy new year\". Went there 1 hour prior to closing time, staff said could only do a fresh sub as they’d turned the toaster off which I overlooked; only had 4 of the 10 salads as everything else was wrapped up and was asked to leave abruptly saying they’ve closed the shop because the staff was too lazy to get salads from the fridge. Disrespectful.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rocksalt Restaurant: I love coming here, it's a lovely sparkly gem of hawker. This unassuming cafe packs a punch when it comes to service and food. Staff are attentive and provide efficient service in a warm and approachable manner. Water was provided straight away. Drinks were served quite quickly after placing the order and my knife replaced with a steak knife before the food arrived. No matter how many times I go, the food presentation is impressive. Servings are generous and taste delicious. Hotcakes where light and fluffy, and cooked all the way through, a success for a hotcake so thick. The banana bread was satisfying, not overly sweet, not too dense, and still full of great banana flavour. I loved seeing morning steak on the menu - it makes me nostalgic. This item even blew away my great memories. If you've never had Steak n Eggs for breakfast this is the place to do it. Steak was cooked well, though a little under seasoned for my taste. The bacon was crispy, the eggs just runny and without an acidic after taste, an the holindaise was delicate and creamy. It's a great place to come again, and bring friends. A couple of beers the night prior saw the need for a bacon sandwich and boy did this place deliver! There is a good chance it was the best bacon sandwich I’ve ever paid for. There was so much bacon it was spilling out the sides. Nothing like a morning coffee with some gorgeous breakfast. With a Latte in one hand and muffin in the other, my brunch at Rocksalt Hawker was gladly a great start. My coffee was a lovely flavour and well mixed, however i did find the drink hot for a least 30 minutes. A little hiden gem and glade i live close enough to be able to go back. Next visit big breakfast. Totally recommend. First time here to try it out. The food was ok, nothing out of the ordinary. The steak was too chewy. I found the servings too small for a big price tag. No warm welcome or a smile. If I'm going to spend that much, I expect someone to show appreciation for going there. Food is quite pricey. We've had breakfast quite a few times, and the Turkish bread is cut into sticks, which is a little weird, especially with the big breakfast. The butter in the little plastic containers is messy and annoying. Great coffee.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Canberra Airport: I was truly disappointed with the serving size of my salad bowl on my first visit to this Subway branch. Despite regularly ordering the same item at other branches, the meager serving here was disheartening. It's my hope that the store manager takes note and ensures staff are trained to meet standard portion sizes. Additionally, I hope the server understands that being stingy isn't conducive to her career advancement and might drive customers away. I would probably give this branch another shot next time, and I'm open to adjusting my review if I see improvements during my next visit. Surprisingly good. It's standard Subway food but the service was great. The guy working was friendly and stayed open a little past closing to serve me. Doesn’t put enough quantity compared to other subways. Really bad. Ordered latte, expressly said 'ordinary milk not skim, no sugar'. Tastes like rubbish. Very sweet. Took back to counter and was told they cannot make a latte except with skim milk powder! It's revolting el cheapo skim milk powder and is undrinkable. Said I couldn't drink it. No refund offered. Just told 'Sorry.  That is the new model.' Very polite but it's not what I ordered and I've thrown away $2.70 on dishwater. Good amount of ingredients. Not stingy",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Pretty reasonable subway based food.  Service is fabulous usually quite good and most times I go there the ingredients all look fresh.  Oddly I find the price of my meal changes during the week??? Not sure what that is.  Certainly was more than accept for food court sustenance! Disgusting service. I asked for a subway melt and after the meat was placed on the bread was told they don't do them anymore cool. Before I could say that's fine the chicken meat that had been on the ham was thrown back into the rest if the chicken and the ham thrown back. The bread was put back in the cabinet. Such casual contamination of food, let alone those people who have religious requirements not to eat or touch pork! Went for a subway on Friday 16/09/22. Ruined my day!!! My experience at Subway today was terrible! I would have rated this no stars if it were possible! I wanted my birthday deal, but after ordering I was unable to receive it, as it was unavailable at this particular store. Which resulted in having to pay for something I would have not ordered if I knew. Would never go here again. Still fairly new in trying Subway, the customer service was very smooth and the food taste pretty good. I didn’t get too stressed from ordering which is nice, the staff who catered me wasn’t rude but patient. I would comeback again😊",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: I placed an order online today for Veg Subway. When I went for pickup my order then there was a lady on the counter who was serving another client and she asked me if I have an order. I told her my name, she took the food and thrown it in front of me as you don’t even serve animals that way (store wasn’t busy) No Thank you, no welcome, just ignored!! Why is that??? Very disappointed Whenever I try to order food in person from them they always overcharge my order. I get a salami sub which on the app is around $10 for footlong on the app but whenever I do it in person they charge me $14 to $18 (it has been $14 and $16 and other amounts as well) It’s gotten to the point where if I order from them it’s NEVER in person and always through the app as I’m really tired of having to pay extra. Lena from Subway Weston was very helpful and lovely after we called having some issues on the app! Thank you Lena :) Terrible customer service; are staff here trained fir customer service?, they look annoyed, bored, unpleasant, and arrogant talking to customers I placed an online order for two wraps, one fresh and one grilled. When I arrived to pick up the order, the staff were very unfriendly, abrupt, and blunt. The grilled wrap had grill marks but was cold inside, and the cheese was not melted. The salad was minimal on both,  not what I would expect on a large wrap.  I have received more salad when I have bought the same wrap at other Subway outlets.  The cookies were hard, not like the soft ones I've had at other stores. I'm not sure whether they were overcooked or just old. I also note that this Subway charges a flat $1 surcharge on all orders. That is, if you place the same order at the Phillip franchise, it will cost $1 less. My advice, take a 3-minute trip to Phillip and place your order there.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Great service, very kind people. I have also just witnessed a middle-aged female customer abusing one of the workers, who handled the whole situation professionally and with dignity. I'm sorry your workers had to experience such nonsense, and I hope Subway looks after their workers. Only 1 person serving had to wait 20 minutes. They had 3 lots of people leave. She really needed help. Most Sauces running out and she couldn’t go out the back to get any, as too many people waiting Too many negative reviews, but on the contrary I have had great experience, they staff is friendly and hygienic as well. If you have concerns of contamination u just ask them to get new ones. I did order at 9.40am The taste was not good. He didn’t make it according to the order. Waste of money.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Got three subway foot longs. For the price you pay they are quiet tight on how much salad they put on. Almost counting the pieces placed. The people serving not very inviting and not smiling. I mean you chose you job not one is forcing you to be there. (My opinion for underlying rudeness) The bread is terrible, very chewy and tastes old. Pretty much as per the other reviews, they don't put much in the sub. For $15.50, you're better off getting a burrito from Zambrero or a wrap from Oporto. These people have never seen a sandwich in their lives couldn't make a sandwich to save said lives. The whole point of a sandwich is to get a little bit of everything in each bite yum. The sandwich I got the ingredients were in different area codes Their motto is how little can I put on this sandwich. I asked for capsicum and she showed me 1 out of 2 peices she had put on. Been here multiple times and it's worse every time. I wasn't the only customer questioning how little they were putting on! Just had a 6 inch tuna with lettuce, tomato, cucumber, capsicum and carrot delivered.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Unfortunately this is the only subway near my work. Bad service, stingy on the salads - i hate it everytime im forced to come here. Great sandwiches, try the sub club with turkey and ham. Awesome staff, I grab lunch here regularly and they always make great subs. Poor vegan options. They really should add a beans, or falafel, or mock meat option.... Text:",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "King O'Malley's: The star of the show at O'Malley's is undoubtedly their Guinness stout on tap. Poured to perfection, it was rich, creamy, and smooth, exactly how a good Guinness should be. The pint had the perfect balance of roasted malt flavors and a slightly bitter finish, making it an absolute pleasure to drink. For any stout enthusiast, this is as good as it gets outside of Dublin. Enjoyed a glass or two or three of hot cider/& hot mulled wine whilst our stay in Canberra. Mostly good food except a rotten chip in my daughter's meal. Have absolutely Nothing positive to say about this place. From the time we walked in I thought the ambience was great but, that's were it ended. What a great experience in an authentic Irish pub.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: I love going around n trying subway to all different places but this one is definitely the worst in whole Canberra, no wonder why they got 2 stars only, seems like they don't even care about if anymore, serving lady was so upset with her life or something, gave me horrible customer service and you can imagine how bad they are when you ask for take away bag and they throw it on table with mad face, she didn't even bother to put sub in the bag and left the front counter. Absolutely disgusting customer service and terrible subway by the way, half of the filling what you usually get at any other subway. I ordered this morning and one of subway staff is so rude. I told her like that you talk to your customers she replied my voice is bit loud. Her attitude does not match with her voice. She ruined my day. If you working in any store You have to keep smiling and gentle with your customers its not your house. I will never visit to this store again. After i ordered a pizza melt 6 inch, my 9yr old daughter decided to order the same. The staff were good and joined both to make a foot long in price, rather than pay for each separately. The fillings were given generously. Only complaint was the lettuce had what looked like rotten bits through it. The staff member got a fresh container of lettuce but this also had the same through it. She picked it out for me, thank you. Worst subway when i opened my order there was no salad in the roll was all wrapped around roll.all i could taste is sauce after asking for a very small amount. Will never go back Really rude staff. I asked for quesadilla and somehow she heard sub. I clarified, I wanted quesadilla and she didn’t look happy. When it was done, my wife took her hand out to grab it and attendant just threw it on counter in front of her even making the sticker go open. No thank you, no smile. Won’t be going back here.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: I am a regular customer and order through Uber eats. Ordered through Uber eats and my subway was filled with carrots which I did not mention. Had to throw the footlong as I am allergic to carrots. Also mentioned extra sauce but instructions not followed. Absolutely disgusting, charging 15% surcharge on Anzac day. The owner should be appalled in himself Staff were pretty patient and nice with our big order. 15% surcharge today is terrible no wonder the place was empty ill avoid this place at all cost from now on ! Disgusting You don’t deserve even a star. So pathetic service. We as a customer pay for the food not getting it free. I usually order online but bloody every time they miss out on something or do mistakes. So I decided to walk in the store but they the same. I order vegetarian so I asked the staff to change the gloves before serving me and the look she has given me and thrown my falafels it was so disappointing. I will never go back and hope the manager looks into the matter.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: A big thank you to the staff, lovely incredible team. Love em cookies 🍪🍪💖💖 Worst Subway in Canberra. Absolutely the best Subs and service we've had from Subway. Delivered by menulog, with a cheery note left by staff :) Great Local Subway, the staff is very friendly. Highly recommend if in need of a sub  🤤🤤🤤 Friendly staff and fantastic gluten free wraps.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Ruby Chinese Restaurant: Ruby Chinese restaurant offers a delightful blend of tradition and taste. The friendly service creates a welcoming atmosphere, complementing the exceptional flavors of their traditional Chinese cuisine. The freshness of their seafood adds a remarkable touch to each dish, making it a standout dining experience worth savoring An icon and staple of Chinese cuisine in Canberra, we’ve been to Ruby’s for many decades. The inside decor hasn’t changed much over the years and is slightly more upscale than most Chinese restaurants here. The food was of decent quality and service pretty quick though the professionalism of some staff could be improved. I would recommended the seafood dishes as you can’t get this at many other restaurants.  Overall a nice place to take family and friends for a more traditional/authentic Chinese meal. New chef, presentation and sauces used on food has changed. Less prawns in dishes but prices gone up. Over use of celery and uncooked onion (see picture) I've been here with my friend today and had a very disappointing and unpleasant experience. The food was fair, but overall too greasy. And garlic moss was not well cooked. As an Asian, I am disappointed with my food. Ordered Singapore noodles and mini Dim sims, the noodles are pretty tasteless and a bit overcooked. Overall 2/5 since the atmosphere is okay.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Utopia Vegan: Such amazing food! The wonton soup and ginger fish were delicious. 😍 The restaurant is also situated in a cool part of town. Highly recommend and will definitely be returning! We visited this place for dinner. Service was friendly although the staff were shorthanded. The food was served quickly and pretty delicious. We enjoyed the hot pot tofu and green curry chicken. A nice place for a vegan meal. Drove down from Sydney to give the food a try. The waitress that served us was a lovely, polite, hospitable young lady! The service was speedy and all the dishes were presented well and were super yummy. Best vegan Asian food we have ever had. We will definitely be back for the food and the amazing service! Everything was wonderful, a really friendly team, food was perfect 🌿 👌, lots of yummy dishes on the menu, keen to return to Canberra for this spot! Beautiful family run vegan restraunt in the ACT. Visited on a Saturday night, staff were very accommodating for walk-ins. Food was served in a fast manner and servings were generous for price. All items on the menu worth trying! Recommend the spicy fried tofu! Pay cash and received a discount, stay focused and support local ✌️",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Avenue Hotel Canberra: We had the best weekend here in one of the spa suites. It was our anniversary and they took such good care of us and were responsive with any requests we made. Everything was very clean. The room had everything we needed. Location is great and within walking distance to some high quality restaurants and bars, noting that the restaurant downstairs Marble and Grain is also a great choice. Easy parking. Friendly staff. Comfy bed and pillows. We will absolutely be back. Would have nearly given this hotel 5 stars but had issues on the first day with the adjoining rooms and had to use cardboard to hold the door open for the kids room. House keeping found some door wedges on day three which allowed us to keep the doors open between rooms. House keeping were fantastic in how well they served the room. Great location. Free parking included if you book directly with the hotel. Have stayed there a few times. Room cleanliness has dropped over the years. Daily room service and restaurant onsite. Buffet breakfast was okay. Overall a good hotel. Google says it's a 5 star hotel, I think it's more of a 4 star. Staff are very friendly and accommodating. It's a very nice 5☆ hotel, within walking distance of the City and eats district. Superior King Room was modern, clean & well appointed, with a small but ample balcony. Price was very competitive. Full mini-bar and robes. Free secure underground parking if you book direct with Hotel. My go-to if I'm in Canberra. Professional and courteous service. Parking is a breeze (hint: book direct for free parking, sign up to the email list for some great specials). Go the 1BR apartment would be my pick for extra space, mini-bar and kitchen facilities. Really comfy bed, balcony for some fresh air. All around just a pleasant experience with Braddon at your doorstep.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Water's Edge Fine Dining Restaurant: I celebrated my mother's birthday at this venue yesterday. Fritz, the ON duty manager was a thorough gentleman. Though we ended up going at the lunch closing hours, he still allowed us to dine and the food was delicious. Risotto was too good and so was the barramundi fish plate.He went an extra step by making mums birthday even more special with his in-house dessert, presentation skills . Fritz thank you so very much for making mum's day a memorable one 🙂 𝒯𝒽𝑒 𝒻𝓁𝒶𝓋𝑜𝓊𝓇 𝒾𝓃 𝓉𝒽𝑒𝓈𝑒 𝒹𝒾𝓈𝒽 𝓌𝒶𝓈 𝒶𝒷𝓈𝑜𝓁𝓊𝓉𝑒𝓁𝓎 𝒹𝑒𝓁𝒾𝑔𝒽𝓉𝒻𝓊𝓁! Amazing. The comments at the table said it all :- Visited a while ago during the summer months. Pretty decent for fine dining in Canberra. Enjoyed the view and presentation of the dishes. Very unpleasant experience, I cannot even believe this is a fine dining restaurant given the service they provided.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Charcoal Restaurant: Overall our experience at Charcoal was relatively decent. The furniture is quite dated but in my opinion it adds to the overall charm of the place. However because the walls are carpeted, it feels like you're in a cauldron. It's fine for winter but on a 30 degree day, it is quite uncomfortable and there is no air-conditioning. As far as the service is concerned, there is only one lady servicing and waiting all the tables. She definitely does her best but she is overworked. Her name starts with 'D'. The owner just sat around and didn't bother to help. When we walked in, we were made to sit at a table that was not cleared. It was messy and the owner did nothing. We had to wait for a good 15 mins before the one lone server was able to get to our table. Not a good start to our experience but thankfully it picked up from there. Very pricey but we knew that before we arrived. Their menu and pricing is available online. The food in our group was prepared beautifully,  and were delicious, consistent with it's price. Too many tables for the space allowed in the restaurant, which subtracted from the atmosphere somewhat. However, it was clear that this was a popular restaurant. For a Monday night, most tables were occupied! Food is good but not worth the price tag. Service is quite slow. Overall, it is popular but I would like to see my meal without having to wait almost an hour each time as it eats up in your time allowed per seating. Would recommend the mashed potatoes (not on the menu). You will not find a better steak in Canberra, utter perfection, I’ve been coming here since 2000 and it’s only gotten better, it’s a shame I only controlled myself enough to take a picture of desert. We come to Canberra just to dine here. Last night did not disappoint, incredible steaks, the best I’ve had for a very long time.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Parlour: Excellent food with warm service, pretty unforgettable experience in New Acton area. Some dishes, like the octopus and prawns, are tasteful; the rest, eggplant and steak, is more of a simple way in cooking. Both taste good tho. The service is really good, caring and warm, given it was a busy night. This place is absolutely stunning! I had the cheese plate, chorizo and bacalao croquettes. Good food, good service and live music. My bartender Hayden was awesome and he clearly knows about quality service. Came for a date night and the food was amazing! Great value for taste and portion sizes were ok. Looooved it! Amazing flavours, each dish was unique and super tasty. Have to try the octopus! Lovely spot in New Acton for a drink or a bite to eat. Limited menu - I tried the lamb burger and it easy pretty tasty.  Came with fries ( they looked hand cut) and a very garlicky aioli.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lemongrass: Dined in for dinner last night, food was good my partner and I enjoyed it. Even though we are frequent visitors to this place I feel bad not adding a review for this place. As I am Thai and of course I wanna support every thai Thai restaurants. Was so excited to try this restaurant for the first time I was sit there and read the all menu for a while and it is a lot of choices which is good but I would say this is the WORST dish I ever had in any of Thai restaurant even inside or outside Thailand. idk how can yall call this as a Pad Kee Mao I believe i did not eat this more then 6 bites and every time i put it in my mouth i feel like I am eating dirt and it is $21 for this dish but thank you for not charging me for this and last thing I wanna say is I HAVE NEVER REFUSE TO EAT THE FOOD FROM ANY RESTAURANT AND THIS IS MY FIRST TIME BECAUSE I CANT EVEN FORCE MYSELF TO EAT IT They're always friendly and remember me, plus the food is consistently good and fresh. If you're in the area, definitely check out this restaurant! Food presentation was overall pretty good, but as what Chef Alvin Leung says, \"Taste is King.\"",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Farmers Daughter: For the second time this winter I’ve had to ask for the heating to be turned on and this morning it was minus 2 degrees. My food and tea were cold quickly as a result. Lovely staff working under terrible conditions - a waitress was rubbing her arms to stay warm. Won’t be back during winter. A great spot for lunch or coffee. Great service and nice food of good quality. Coffee is a solid 4/5 but needs a new blend or grind to make it next level. I moved to Canberra from Melbourne, where cafe culture is everything, and Farmers Daughter is my favourite cafe. Chill vibes, great coffee, and lots of different food options to accommodate everyone. Really good place to have a relaxed meeting with clients, or just to get some work done on my own. The staff are super friendly, and it's not too pricey (by Melbourne standards!) We booked a table for six. It was all ready when arrived. The service was quick. The coffee was strong, hot, and delicious. The meals were fresh and creative. I had poached  eggs and they were perfect. My companion had the chicken salad and all the elements were perfectly cooked, seasoned, and the vinaigrette didn't over power the dish but made it taste zesty and vibrant. We will be back! I was recommended the minestrone and very glad I accepted the advice. Perfect on a cold Canberra day. Great little place out of the mainstream with a nice ambience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Poachers Pantry: Incredible dining experience! We attended the Truffle Dinner in June and it was a 10/10 dining experience. Every course was oh so delicious, and the addition of the option of a dry beverage pairing for each course was an unexpected delight! The truffles were fragrant and punchy and complimented each course perfectly— most surprisingly— the dessert!! We were sat by the fire, which elevated the dining experience and we could have sat there all evening. The service was outstanding! We will definitely be back to try the lunch menu and enjoy the views during the daylight! Always a bit of a favourite spot of ours for a wine tasting or weekend lunch, Poacher's Pantry was the most perfect venue for when our wedding came along. My partner and I showed up at Poacher’s Pantry close to 2pm towards the tail end of the lunch service. Our server Jack welcomed us warmly and was so attentive throughout our time there. We selected the $85 set menu and there were definitely no regrets with that choice. Lovely balanced flavors, the portions were very reasonable and filling for the price. Perhaps because we came during a quieter time of the day, Jack really took his time to explain the dishes and made us feel like we were going on a journey from course to course. We enjoyed learning about the chef’s intentions and the background behind the family business which made the dishes even more meaningful. The duck was definitely the highlight of the dishes. To top it all off, when Jack learned that we were there to celebrate our anniversary and a birthday he shouted us a couple of our drinks which was much appreciated. We’re not locals but hope to visit again one day- perhaps try another seasonal menu! Highly recommended! We had the opportunity to attend the Poachers Pantry Smokehouse Restaurant for the Poachers truffle dinner event. On a cold, blustery, and rather feral evening, we were cozy in the restaurant, oblivious to the elements. The food and wine pairing was delicious, the staff delightful, attentive, and engaging. Poachers is a must visit if you're in the Canberra wine region. Poachers out in Spring Range is one of those places we just keep going back to year after year. This trip took us out to try their new autumn menu as we heard their new chef (Adam Wilson ex. OTIS) was doing great things. It didn’t disappoint. We shared the king prawns entree, duck breast mains and 2 of the most amazing deserts I’ve had in a long time. A small Friday lunch turned into quite the affair!. It’s easy to gush about a place like this and worth the 20 min drive from north Canberra. Autumn and spring would have to be two of the best times to go out, garden is in full flight and wines were spot on (both poachers Riesling and the Lark Hill sticky we tried). Jack at front of house looked after us and ensured that service was spot on. Managed to get out without any add on purchases which is never easy but the wife wasn’t with me this time 😉",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Red Rooster Queanbeyan: The food was good and tastes good. The staff's helpful and its nice, quiet place to dine in. However, the toilet could be a but better. There's no hand dryer in men's toilet and all there's some paper towels left near the wash basin, soaked in water. I updated my rating from 5 stars to 1 due to the manager's poor service and unprofessional behaviour. I submitted a complaint through the Red Rooster website, specifically requesting email contact. However, the store manager called me and behaved rudely. I complained again, and this time, I received an email from Red Rooster, Chatswood. Unfortunately, I am no longer interested in their response. I have always supported this store in the past, but not anymore. They have lost a loyal customer. The case number is 142534.  I advise others not to waste their time at this store. Service was friendly. The food was very good, one of the better Red Boosters on the way they cook the food. Chips a little too salty. The place could do with a tidy up Yuck food. Went through the drive-thru on the way out of town and will never go back. Had one bite of the thrown together chicken burger and instantly regretted it. The chips were cold and soggy too. Would give it zero stars if that was an option 👎 Very disappointing for the 3rd. time straight we didn't receive what we had ordered seems as though staff do not know the anatomy of a chicken as I never get what I order? and the chips were cold again.Will give this place a miss from now on.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "NewActon: Great hotel with nice clean rooms. Only issue had was parking was hard to get. Staff were nice and treated me great. Would stay here again this is at the top of the accor chain as far as rooms go as I've stayed at them all. Very trendy and the surrounds are lovely. Great public artworks everywhere and cool little cafes and restaurants with great coffee. The cinema provides a more unique experience. The prices (and ridiculous parking fees) are reflective of the trendiness of it all. There are so many festivities you can enjoy. So much great food and the Art Not Apart Festival is held here annually and it is such a great arts show. You can take so many great photos and you can also cross the bridge to the lake! Very nice place. New Acton is a fun and vibrant area with great bars and restaurants as well as some excellent little shops. I would recommend stopping by The Curatoreum if you're in the area, they have a great selection of curious gifts. Also worth trying some of the bars, like Black Market. Upscale, arts precinct with some arresting public art.  parking is terrible but very bike friendly. Gorgeous collection of places to stay and interesting eateries.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jimmy's Place: We are Melbournians on a road trip to Sydney with a 1 night stay in Canberra. We decided on Jimmy’s Place for dinner after walking around Dickson for a bit as it was a restaurant with quite a few people in there compared to the others in the area. We thought Canberra was going to be expensive but the lobsters🦞were actually cheaper than Melbourne. We ordered a stir fry ginger spring onion lobster egg noodle & it was delicious!😋Lobster was fresh & noodles were well made/seasoned. We also ordered a variety of dishes to accompany the steamed rice. Each dish was of a generous portion with fresh ingredients used & very tasty. Total bill was also cheaper than Melb which was a bonus. Highly recommended restaurant for yummy Chinese cuisine in Canberra.👍🏻 The food is good, but the wait staff is very Terrible customer service. Table was dirty and I asked the old lady wipe it properly. After that, we got the food after an hour later!!!! And she excused that there are too many delivery orders! Didn't say any sorry. Very rude. i never come back here. It was delicious Chinese Restaurant in Canberra I have ever visited. I am not a fan of seafood due to its odour, but the dishes had no  fishy scent, and portion size was ampleand scrumptious. I eager to explore  other menu items on my next visit. My friend Anj recommended Jimmy's, so last Friday, I decided to take my family there. They have a great selection of takeaway family meals, though, so we decided to just takeaway. Pack A ($43.89, good for four) came with Mongolian Beef (truly delicious!), boneless Chicken with Lemon Sauce (moist and flavourful), fried rice (my kids took it all), and three spring rolls that were great but probably would have been even better if we had them freshly fried (we took 15 minutes to get home). We also ordered a hot and sour soup that my wife enjoyed. The counter lady was very friendly and we didn't wait long for our food. Overall, a great experience, we would definitely return and dine in so that we can really enjoy all that food fresh from their kitchen. Dishonest restaurant. The waitress told me that a certain type of chicken is out of stock and asked if i am happy to change to another type of chicken for the same dish without mentioning any additional cost. Not until checkout are we informed that we have to pay $7 extra for the change. They argued with us and insisted us to pay.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "La Cantina Italian Restaurant: Upon entering we were greeted with warm lighting and beautifully exposed brick. The place was adorned with a gallery of imitation renaissance artwork. Visited La Cantina on Sunday for a friend's birthday dinner. We had a great dining experience at La Cantina. The decor is reminiscent of a wine cellar and there were famous Italian paintings on the walls. The service was excellent and the food delicious. We enjoyed the service, food and atmosphere here. The best pizza I’ve had in Australia - and I’ve been to a good number of pizza joints. Since we were due for a lunch or dinner date at a restaurant starting with the letter ‘L’ our ‘ABC’ lunch/dinner group chose La Cantina. One of our party had dined here with work colleagues on several occasions and the pizza came highly recommended.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Tea Lounge: Had dinner there during new year’s Eve. We have ordered Oyster and each of us ordered starters and main course. I guess because it was NYE, waiters were quite occupied. Starters arrived before Oysters. The starters were only warm but not hot. General dinner taste good , just that on the service side can be a bit more attentive. This is why I am giving it a 4 stars. The high tea for a special occasion/celebration was a great experience. The atmosphere with the relaxed old world hotel charm was a highlight. The staff were professional, friendly and attentive. As for the main event (the food), the three tiers were very good with savory options on the bottom plate, a “hot option” which was brought on a separate plate, scones and jam on the second tier and sweet delicacies on the top. The flavors were excellent with great barista coffee and teas. We were so looking forward to this experience as part of our stay. It turned out to be the most disappointing part of our visit to Canberra. Went for high tea. Food was a little disappointing - prob would not go back. This experience was wonderful. The location was beautiful and such a lovely area to walk and have a look at the Bejing Gardens.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hellenic Club of Canberra: The Hellenic club is a Canberra institution and has a great food offering with Ginseng (Asian), Filos (Greek), and of course the Bistro. All the restaurants are good quality and worth a try. There is also a kids play area in the bistro area which is a great distraction for the kids. Hellenic Club of Phillip would have to be one of the nicest places I've walked into lately! It was a beautiful night of dancing. Good varied food. Tasty. Three restaurants: one of them with Chinese food, the second with Greek food. Various drinks. We came here to the disco 90. after which we started dancing with the DJ.  We danced until 1 am.  We'll definitely come back The Ginseng Restaurant catered to my requests perfectly for my mother's 80th Birthday celebrations. We had a room to ourselves and were able to bring some decorations and a cake. They even provided candles when I forgot them. The only place in south Canberra I know of that sells Galaktoboureko! Cheap cocktails, good food- would recommend the creamy garlic prawns! and it hosts good events, such as Steve-O and Issac Butterfield.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "La Rustica: Like the coffee club… but for dinner the Food is incredibly average. Very good service. There  is outdoor sitting, so they are dog friendly. I ordered caprese and spaghetti primavera - very good vegetarian option. Also, tiramisu  was amazing  ! Not too sweet, exactly as I love. A warm, inviting atmosphere, lots of young, friendly staff providing table service, and lots of loyal clientele. There is plenty of indoor and outdoor seating. Booking a table for peak times is advised. The menu has a decent range of classic Italian choices. My friend and I selected garlic bread and a slow cooked beef brisket main course,  complemented with sangiovese and chianti red wines. What\"s better than toast and beef in winter? La Rustica Restaurant in Kingston offers an unparalleled culinary experience that is worth savoring. From the moment I entered, the warm and inviting ambiance set the stage for an exceptional dining journey. The staff was attentive and knowledgeable, providing impeccable service throughout. I highly recommend this restaurant”",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Boat House: The Boathouse was our first stop when my partner and I went 'wedding venue' shopping. After our initial meeting with James, we knew the Boathouse was the venue for us and locked it in straight away without bothering with any other places. OMG.  Christmas lunch!  Thanks so much!  What a lunch!  On the lake beside the poor soggy black swan.  Staff were fantastic.  Could not fault them from the lovely greeting at the outset to escorting everyone to their cars under umbrellas at the end!  Thanks for that -- it sets you apart from others. The Boat House team did an incredible job hosting our wedding. Celebrated a special lunch birthday with family and this was such a treat. While the layout was very open and the view superb, it was a bitingly cold day. However, not only was it lovely and warm, the atmosphere was friendly. Our waiter was Matt and so charming, professional and just the right amount of sass. I enjoyed my lamb main and was cheeky enough to ask for Chefs Choice in dessert (presented with a flourish and “Surprise!”), for me the standout was the Jerusalem Artichoke ravioli. Sublime! The meal was really nice, though my main .. the beef fillet was over-cooked. The staff were nice, though the atmosphere seemed a little flat. This may have been because the temperature was a little cold in the restaurant, was cold outside, and with such an open space the sound from other tables carried.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lemon Grass Thai Restaurant: The aroma drew me in. Lovely service, prompt and efficient. Food was fresh and vibrant both visually and on the palate. Great selection of wines/beverages. A bit disappointed in the food. Was very sweet for a authentic Thai restaurant. Nothing was spicy at all including the Tom Yam. Zero chilies. Staff was wonderful and helpful. Very fast service, atmosphere was a bit dated. Needs some work. Canberra's best kept secret! Just a block away from the hustle and bustle, this gem has incredible beautiful food, great service and is one of the cheapest meals you'll eat! I cannot recommend this place enough! We will definitely be back! The food is decent. The portion sizes could be slightly better but it's okay overall for the price.  Ordered the pork dish for lunch. The lunch menu on weekdays is good if you are looking to grab something that's reasonably priced. We had dinner on a Friday night and it was quiet quick friendly and delicious. Seems most of the customers order delivery nowadays which meant we had the whole place to ourselves.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Diamond Chinese Restaurant: Ordered take away from Diamond Chinese. I regularly order takeaway from this restaurant. My experience has always been positive. Prompt delivery, food nice and hot. The dishes are a bit hit and miss - some dishes significantly better than others so I'd definitely give this restaurant another chance if your experience wasn't that great in the first try. I recommend crispy chicken and guilin noodles. Mixed reviews so hoped for the best but wish I hadn’t. Chefs special hot and Spicey chicken was just a container of bones. Their special fried rice has peas and carrots in it. Won’t bother again- extremely disappointed. Tasty food, but had to wait two hours to get it. Ordered at 6.30pm, estimated delivery time was 7.45pm. Phoned at 8.05pm to see where my order was and was told it had been delivered... huh? After explaining it hadn’t, was then told it was being cooked now and would be another 20 minutes. Offered a 10% discount on a future order after complaining, turned that down as doubt I’ll be ordering from here again. Final delivery time was 8.25pm. From start to finish Diamond Chinese restaurant in belconnen had me smiling all the way!!! :-) :-) :-)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mezzalira Italian Restaurant: We have been coming here for many years, by far the best Italian restaurant in Canberra. My family of 4 had a beautiful meal here. We ordered the Beef carpaccio and the Octopus to share,  both well worth it. Our mains were a ragu pasta, pork and fennel sausage pasta, ricotta tortellini with a sage and butter sauce..which was amazing!! I had the Cowra lamb with Jus. Came here for lunch. Really enjoyed the food and atmosphere. Love the warm and crisp focaccia with ricotta and honey. My Tortellini was amazing as well! They do decent amount of vegetarian options which is really nice. Will definitely come back again! Great food.  We had the bread, pasta and filet.  Filet was cooked to perfection.  The wine and Prosecco were great.  The location was great. I visited mezzalira to celebrate a birthday, and it turned out to be a very disappointing experience. We brought a birthday cake to enjoy after our meal, but the staff informed us that we were not allowed to eat it there. This was quite upsetting, as we had called ahead to confirm it was okay.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lanterne Rooms: Adrian and Irene provided exceptionally attentive service, and the food at this restaurant is among the best in Canberra. We held an important life ceremony here, and Adrian was incredibly helpful throughout the entire process. Irene was amazing as well, capturing numerous professional-quality photos for us. We are deeply grateful for their dedication and professionalism. Our ‘ABC’ dinner group chose this restaurant for  one of our alphabet inspired dinner dates. We all thoroughly enjoyed experience with delectable food and excellent service. We had a very charming and attentive gentleman serve out table and he was very helpful in ensuring the one member of our group who is vegetarian and allergic to crustaceans was provided with excellent alternative dishes when required. We eat here fairly regularly and have never been able to fault the food, service or atmosphere.  Food is always great and the wine list is very good, too. It's actually more than very reasonably priced for the quality of food and service. Lovely restaurant and staff. This place provided an amazing I recently dined at Lanterne, and my experience was far from satisfactory. The atmosphere lacked any sense of warmth or comfort. Adding to the disappointment was the poor customer service; the staff seemed disinterested and inattentive throughout the evening.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "McDonald's: Had the meals delivered. Not as vegetarian friendly as other similar brands. But still want to try when I start to reconsume meat due to personal reasons. Worst Mc ever, worst chips ever seen, dry and cold, floppy, soft. Bad service and low accurate food. I ordered four big macs to take away. And then waited for more than 20 minutes at the counter. The kitchen staff refused to fulfill the order. After I got my food and went home, I found all the big Macs only had a single beef patty each. Watched our order get packed and told to wait for more fries. Waited 10 minutes for fries to be made then watched them sit in the bag on the pass for another 10 so they were limp and cold. Burgers had gone cold. Asked multiple times what the hold up was, as at least 12 other people had come, ordered and gone while we waited. Got no answer. No apologies or any acknowledgement really at all. Absolutely awful fries, bitter and overcooked. Almost as if the oil hasn't been changed in a few days.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rubicon Restaurant: The literal definition of a hidden gem. Food was amazing and the waiters were so lovely. Food came out very efficiently. Writing this before I even get home because I loved it so much. Great spot for a romantic dinner out. Delicious food (perfectly cooked meats, veg etc), great service, lovely atmosphere. This is a lovely little restaurant with supposedly great ambiance, however, we were seated near the entrance and it was not as nice as the sections in the back. The food was decent but did not quite live up to expectations. The oysters were fresh and tasty, the bread was delicious but the starter and the main were a bit underwhelming. The kingfish sashimi was ok but a bit overdressed. The blue eye cod with seared scallops was tasty but the sauce was a bit thin and watery. I would rather not say anything about the house-made ice cream. Tucked away in a quiet neighbourhood with plenty of parking, Rubicon delivered not only excellent food but also impeccable service. I was there dining alone and the staff were so accommodating. The service was amazing.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sage Dining Rooms: This was our first visit to Sage and we were very impressed. We went for dinner and had the 5 course chef pick along with the paired cocktails for me and matched local wines for my boyfriend. The food was sensational and lived up to the reputation of trip advisors number 1 fine dining restaurant in Australia for 2020. My boyfriend doesn’t often comment too much on food but for him to say the food was really good as well is huge! The staff were very friendly, professional and attentive. Special mention to Maddy who was exceptional and took very good care of us. The only point I could make was to remove the butchers paper from the tables as it detracted from the fine dining experience. Other than that it was a wonderful experience and I can highly recommend especially for a date night. The mint garden outside is a beautiful setting for a cheeky drink or two. Definitely add sage to your to visit list, you won’t be disappointed. Sage provide a brilliant dining experience that can't be faulted. The location and interior are beautiful and a lot of work has been put in to make it a unique experience. The experience at Sage was nothing short of being absolutely splendid and truly special. It was my wife's birthday and the waitstaff did their very best to make it a truly beautiful and unforgettable experience. Ella, Owen, Bethany and Ainslie were so engaging, ensuring to explain every dish that came our way and went out of their way to provide for our every need. The food was undoubtedly lip-smacking, albeit the portion size being rather small. The  crocodile burger as a bar snack the trout were stand out dishes for us. Food at Sage is great! Fresh, delicious and creative. They have excellent vegetarian alternatives too. The cocktails - especially the passionfruit mojito - were super tasty. We were outside on a cold rainy day and they had a pile of fluffy blankets for us. My friends & I had a really lovely evening at Sage last night. We had the degustation & every dish was just exquisite. Customer service here is always on point - the team’s attention to detail is second to none. The wine list is also excellent, which again, the staff are across & are very knowledgeable on pairing with different dishes. Highly recommend - one of Canberra’s best!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Italian and Sons: We had high expectations for the restaurant, however the overall experience is pretty disappointing. The steak is not evenly cooked and is definitely not what we asked for——medium, it’s over done and tastes like rubber. We didn’t even have the appetite for dessert. The only delightful course is the focaccia, to be exact, the cream included within the focaccia is tasteful and rich. I expected a little bit more from this restaurant. I was seated at a table near the wall and the place felt a little crammed as there was a person directly behind me, some may call this cosy but the layout could do with some work. I have been at Italian&Sons once. I live in Sydney and rarely travel to Canberra. But what a delightful surprise was Italian&Sons. Being Italian myself and moved to Sydney in 2008 I had experience many 1,2 and 3 Michelin Star around Europe. If we talk just about food and service Italian&Sons is by far the best Italian Restaurant in Australia. Bravo 👏 What a great find! My wife booked this place based on reviews and boy it did not disappoint! The service was absolutely incredible, matched by the amazing food. Honestly we can’t rave about this place enough. Been here a few times now and can highly recommend this restaurant for the experience it provides.",
        "Additional_Info": ""
    }
]