[
    {
        "Place_Reviews": "Hotel Grand Chancellor Hobart: The Grand Chancellor is a delightful hotel that made our stay in Hobart truly enjoyable. The rooms are modern and comfortable, with a great selection of pillows to ensure a good night's sleep. Staff here are very friendly and always happy to help. Hotel is in a prime location in Hobart. The hotel itself has a well designed interior throughout. Gym and pool are decent. I would highly recommend getting breakfast included as there is a relatively vast range of breakfast options. Rooms were spacious and clean, and the bathrooms were relatively modern. Lovely hotel in an ideal location on the Hobart waterfront. Rooms are nice, would suggest selecting and paying more for a room that has a view of the harbour (for obvious reasons). It’s obviously not a cheap hotel however the hotel doesn’t try and hide that it’s a high end place to stay. Carpark underneath with plenty of places, nice pool and GREAT gym for a hotel. The sauna is actually a bit hidden as it’s  inside the bathrooms in the gym and not the swimming pool area…so when you head down there’s no signage to tell you this point unless you physically go into the gym area and into the bathroom where there’s a door in each gender toilet to get into the shared sauna Rooms are clean and functional.  The bathroom could be bigger! They charge for bottles of water in the room, which usually is free in other hotels. It should be complimentary. What a great hotel. Right across the water! Loved the little touches of Lindt on the bed 🥰 huge room, great for working. Loved the space in the bathroom and my shower was spotless. Our only issue was no elevator from the lower car park, not inclusive 👎🏻.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Henry Jones Art Hotel: The Henry Jones is in the perfect location for a weekend in Hobart, with easy access to the wharf, the ferry to MONA & lots of restaurants. My wife and I stayed for 4 nights in one of the original rooms. The room was spacious and comfortable. Most importantly considering the weather it was warm. We had a view out to the docks and could see boats come in. If you do stay we recommend the free art tour which was interesting both for the art and the historical facts about the IXL jam factory. Again and again, I return to Henry Jones because simply it is incomparable to any other place I’ve stayed across the world. The warmth of the staff is symbiotic with the hotel ambience. In a word, it is enchanting. From the moment you walk through the doors you are captivated. Each room is exquisite and unique, stone walls and long timbers framing the art laden walls. With windows which peer out on the quiet ambiance of Hobart docklands and views reaching the mountains which hold the timelessness of this city. .The presentation is  perfection. Looking forward to visiting yet again for another memorable experience. Thank you to the staff who continue to provide exceptional hospitality. We had a lovely stay at the Henry Jones Art Hotel in Hobart. The location is on the waterfront, in a historic building and a lovely walk to the high street, Salamanca Market and the MONA ferry. Room was very large and charming, including a large bathtub with jacuzzi feature. Gina at the front of house was a stand out - she was always bubbly and so helpful, providing excellent recommendations for food and parking. We stayed at the hotel for a night, left for a few days to visit Cradle Mountain and returned for the rest of our stay in Hobart. On our return, we were pleasantly surprised by a personal card and locally produced chocolates in our room. On our last day, Gina came through yet again with another card and chocolates for each person in our party. Thank you to all and especially Gina at the Henry Jones Art Hotel for making us feel so welcome! Would not hesitate to recommend to anyone visiting Hobart. I couldn't fault this establishment. It was the perfect way to \"spoil\" ourselves for the last days of our Tassie trip. The stay at the hotel was an experience in itself, just taking time to wander the halls and take in the beautiful artworks. Truly a memorable anniversary experience in an amazingly culturally rich environment.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Riverfront Motel: We had an unexpected situation come up and ended up at the Riverfront Motel & Villas. The staff were not only friendly but extremely accomodating. They went above and beyond to make our stay a great one. We slept comfortably in the warm beds with electric blankets and went to the restaurant for a delicious breakfast. If we are ever in the area again we will be staying here. Price was more than generous. Fantastic location,  pretty much central to everything.  Room service was great and the big breakfast we ordered was very yummy.  It was featured to wake up to a waterfront view. The ducks that came to visit were very cute and there is a lovely walk with a playground for the kids and a half tennis court. we will be back again.  Was very peaceful  and prices were very reasonable. Love it!! very clean neat and cosy . Went here for dinner and was pleasantly surprised! The portions were massive and you don't need much more than the 2 sides that come with the main meals. Vegetarian and vegan options are available, just ask. Pretty well stocked bar and friendly staff. Kids menu and high chairs are available. Great retro stay with excellent service and reliable food.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hearth Cafe and Restaurant: We popped by for dinner after the reviews promised a cosy atmosphere and delicious gluten free pizza. To say this place did not disappoint is an understatement! Absolutely loved my experience! From the moment I stepped in, the cozy ambiance and welcoming staff made me feel right at home. The menu boasts an impressive array of delicious options, each dish prepared with fresh, high-quality ingredients. I couldn't resist trying their signature coffee blend, and it definitely lived up to the hype – rich, flavorful, and expertly brewed. delivers on every front. Can't wait to visit again!\" A gem of a place for a casual bite. Our shared lamb, feta and rocket pizza was so delicious.  Beautiful thin crust and perfectly balanced toppings!  The date pudding with ice cream was very good.  I highly recommend this restaurant for a quick and convenient light meal or snack. Jay is the man! Fabulous coffee, sublime food, gorgeous open fireplaces. Hearth cafe has a great vibe.  Very chilled music and lovely staff.  Jay is the most accommodating host,  making great recommen3 dations about drinks and food.  Highly recommend a visit. Staff were friendly.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Wrest Point: love our 9 days stay at this hotel… it was winter low season occupancy.  It was very pleasant without the crowd except over the weekend with the young casino gamers. Terrific place to stay This is my first stay here. The only issues I have are with the room itself, which was lovely, except I'd expect a little better from wrest point  the walls were thick with dust and the loo  was very badly stained, which is not acceptable. The door to the bathroom had fake tan finger marks on it. Everything else was great. The casino staff and rooms are really just wonderful! And what a view!!!!! Beautiful hotel with lovely rooms. Very comfortable and clean. Service was great and location is perfect. Car park is included as well and very close and convenient to the entrance of the hotel. Will definitely be back again when we return to Hobart.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Customs House Hotel: Bloody Amazing... What an absolutely amazing dinner, and beautiful customer service.  Great atmosphere,  and lovely and warm on a cold rainy evening. Superb 3-course lunch for Mother’s Day!  Faultless food and service throughout.  Beautifully presented food, generous portions, and absolutely delicious.  Very friendly, attentive staff.  We will book again for sure.  Thank you, Customs House Restaurant! Lovely heritage building. I am only dining there for dinner. The seafood paella is too much on the salty side. Fish of the day is good and delicious.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Riversdale Estate Winery, Cellar Door & French Bistro: I had the most delightful experience at Riverdale Estate's High Tea. The ambiance was charming and elegant, making it the perfect setting for an afternoon treat. The selection of teas was impressive, and the staff was knowledgeable and attentive, helping us choose the perfect blends to complement our food. We just experienced a beautiful family lunch for 15 people.  The service was fantastic and the food sensational. The wine was delicious and well worth a second bottle. The locations and view across the river don’t get any better.  Thank you  for making our special day as a family even better. Very special memories. Beautiful venue with equally appealing food that tastes just as good as it looks. The Earl Grey Supreme tea is delicious and pairs beautifully with the high tea. Service was amazing. One a side note to follow google maps follow the signage and trust your gut. A lovely estate with a great selection of wines. A fantastic demonstration of typical Tassie cold climate wines done exceptionally well with a few surprises for the palette. Drew is a friendly and knowledgeable host if you’re after a tasting. We came to the Alice in wonderland high tea as a group of girls to catch up. Had an amazing time, great food, great service. I had a glass of sparkling and enjoyed it so much I got a bottle from the cellar door to take home. Highly recommend for a lovely afternoon out.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Salamanca Inn: It’s wonderful staying at Salamanca Inn, such a great location and the reception staff and housekeeping staff are so warm and friendly and quick to help with anything you require. I stayed in two rooms, the main hotel is immaculately furnished and second place across the road rooms are even more spacious and in our family room we have a great kitchen and a sunny balcony. Beds are super comfy in both. Only issue was air con was broken in main hotel but didn’t feel cold as was provided with heater. Ask for a bathtub before booking. Love the heated floor in bathrooms. And quiet too! I’ll be back for sure. 💛 Turned up to my prepaid booking through thier site and the air conditioning was broken in my room. They couldn’t give me one of the rooms where the air conditioning was working so without any assistance from them had to find another hotel. The receptionist was incredibly rude - she knew I was ill and needed air con and did absolutely zero to sort out a solution, or to treat me with respect. Note the listed “windows that open” only open a crack. Avoid booking here - you could end up needing to scrounge for another hotel room yourself because of repair issues - with no assistance and not even a printed refund reciept. Went somewhere a bit further from the market location - a whole different experience - polite, kind and helpful and suite much better … sometimes location isn’t everything! Wow the rooms have been spruced up and are lovely. But the lift OMG that thing has been cranky for the last 20 years, still it makes the trip exciting. We were so glad we booked this place for our trip to Hobart. Location is the best as you walk out and you are in the best part of Hobart. We stayed here especially for the Saturday markets as its right next to it. However it is about 10-15 minutes walk into the CBD area where most retail stores are. We loved exploring Battery point and Salamanca. There is also the Salamanca fresh supermarket nearby for groceries. We had the 1 bedroom studio with kitchen and it was very comfortable. Free laundry was also handy. They also have onsite parking which i believe is free if you book direct and if not there is a fee to park. Staff were very helpful. We would recommend this hotel. Exceeding philosophy statement, Home away from home experience. we were warmly welcomed by the lady at the front desk had a warm and friendly smile. We  enjoyed hospitality and comforts that I normally don't anticipate. Salamanca itself has a buzzing vibe most of the time and we felt part of that vibe well into the night. I would recommend to bring ear plugs if you need perfect quiet to sleep.Thank you for a memorable stop over. I will definitely be back next time I come home.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Annapurna Indian Cuisine: A very nice Indian restaurant serving yummy Indian food. Good service and nice ambience. Thanks 😊 Woohoo. Goat biryani. Stuffed naans. Yum yum. Lamb chops nice and juicy. My fingers were so red from the lamb chop seasoning though. Is that normal? Dined in and enjoyed the food with friends. Food came out quickly. Loved the Mango Chicken with Cheese Garlic Naan. The Store's timing on Google is wrong, and the taste of every dish is disappointing. The food is cold, and there is a lingering smell of old oil in the dishes. Some dishes are overly salty, while others lack salt. Additionally, the tandoori chicken has an excessive amount of artificial color. Overall, I wouldn't recommend this place at all. Veg pulao was the worst, 60-70% of the box was filled with half cooked unsalted cauliflower & the rice was dipped in oil Pulao completely bland. Such a waste of time & money. Someone here will definitely need cooking lessons.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hadley's Orient Hotel: I absolutely loved staying at Hadley’s on my first visit to Hobart - it won’t be my last. It’s perfectly located, within walking distance of just about everything, and very close to two Skybus stops in the city. Lots of excellent eating options within spitting distance, and the perfect base for exploring this unique destination. This historic hotel was a great choice for us. We went back-and-forth on different hotels, and we made the right choice.  Yes, the rooms are a bit small, but it ticked a lot of boxes for us. Very clean and comfortable, Great bathroom, really nice storage area for your luggage and clothes, beautiful quality, toiletries, Great location to walk to the seafront. Nice happy hour in the bar. And great friendly, helpful staff. The hotel itself is rich in history and the decor is what you would expect. The rooms were kept very tidy and clean, as was all areas of the hotel. My only gripe is the parking and the access to it. By the way, if you ask me (a customer) how was my stay and I give you feedback on the parking, I don't expect a lecture on how lucky I am to get parking for $5 a day. Let me be very clear here, the parking location is terrible. You have to walk down the street and around the corner of another street to find the entrance. There are 8 levels (including 4a, 5a, 6a, etc) to circumnavigate each time you enter or leave the building. It feels like a trek in it's own right and to be honest, put us off even wanting to use the car. Yes, it's $5 a day, however most, if not all hotels have their own carparks. I actually would've been happier to pay $20 a day for parking if it was more accessible. It should be more clear on your website on the parking situation. This would at least give people a choice on whether to rent a car or not. Otherwise, thank you for a lovely stay in the hotel. Cozy vintage Hotel, picturesque frames at its lounge telling its story and their guests, old style  furniture, the lounge and bar with the music of the period among with pieces from the hotel old times.  Great staff, gentle and friendly. 24 hour front desk reception. Variety of options for breakfast. Very clean and cozy room. My friend and I had a most wonderful experience at Hadley’s high tea this afternoon, made all the more special by the outstanding service provided by our most charming hostess, Chelsea. She was just so lovely and attentive. This one’s a keeper  - manager hold on to her!  Everything was delectable and delicious and I would highly recommend Hadley’s high tea for its elegant ambience and old world charm. Again, a special shout out to the lovely Chelsea who made us feel extra special. 10 out of 10!!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hatcher's Manor: We stayed at Hatcher's Manor 7th March 2024, there was 4 of us. We found our rooms to be clean and comfortable. We all had our Dinner at the restaurant & it was delicious. Our breakfast was also delicious & filling. We loved the location. We enjoyed talking to the owner, she was very friendly One of the worst places we have ever stay at. So close to Richmond that you can see it. Excellent location, a beautiful place and excellent service. The food is fresh and not mass produced. Every thing was delicious. Had the nicest apricot juice with tea. The service is friendly and they couldn’t do enough to help. Wish i could have rated this accomodation higher, the main buildings are beautiful, the surrounds and animals are a nice bonus. However the \"apartment\" was a big let down. Quiet run down and outdated place without a proper kitchen and the \"day beds\" were not comfortable. Owners are nice and try to accommodate but overall the Manor was a bit of a disappointment. The place needs a good clean and freshen up. Our room had beautiful antique furniture, but wasn’t maintained. Very dusty, the poster bed had cobweb and dust all around and the carpet hadn’t been vacumed properly , linen looked very tired and not fresh.  Glad it was only one night.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Shipwrights Arms Hotel: Great food in a wonderful location. Highly recommend the food here, and the kitchen handles a busy service very well. This restaurant is in the trendy part of Hobart. Had the most amazing dinner here tonight! Had the bread for entree, eye fillet steaks for mains & banoffee pie for dessert. Every meal was phenomenal; bread was fresh and warm (and was a very generous serving might we add). The steaks were cooked perfectly, probably the best steak I’ve ever had. And the pie was so yummy, gluten free as well (unfortunately I’m one of those people). The service was also great, as it was our honeymoon the staff gave us a glass of bubbles each on the house which just topped off such a perfect night. If you are visiting Hobart definitely go here for dinner! What a beautiful pub! Beautifully appointed with cosy interiors and lovely staff. Enjoyed a perfect steak with a glass of Milton rose in front of the fire whilst kids stayed entertained with colouring in activities they were given. Hubby raved about the lamb shoulder. Highly recommend. I do a pilgrimage once a year in June or July hoping Snow will be on Mount Wellington Tasmania.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Travelodge Hotel Hobart Airport: Great place to stay if you have a late flight arrival. Just a short distance from the airport.  Clean, basic rooms with pleasant staff. We have stayed here a couple of times with no problems & the  tariff is very good value I stayed to save my family the trouble of getting me to the airport before school drop off. It was a great decision. The room was spotless. The meal was absolutely the best salt and pepper squid I’ve ever had. It was so fresh and cooked to perfection. The staff were lovely. I can’t wait to stay again. Amazing experience. Rooms clean and comfortable. Staff are fantastic, in particular Sammy who checked us in and waited on us in the restaurant. We returned just for dinner on our last night in Tasmania and Sammy remembered us and once again provided the most amazing customer service. We felt like we had known her for years. Her ability to connect with our Autistic son was second to none Great location for airport, good room size, comfortable bed. The major problem was the design of the shower. In this new modern age of no shower doors or screens, the slope of the floor to the drain is vitally important. It was non existent in our room, so excessive towels had to be used to stop the water saturating the entire bathroom. Used this hotel as a stop over before picking up our rental car, which was the next morning.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Edinburgh Gallery Bed & Breakfast: Booked this accommodation to stay for 3 nights in April 2024. The owner, John is indeed very warm and courteous. He left our room keys in an envelope as we checked in quite late. Most importantly, he reserved a room for us very near to the car park area! So convenient, as we do not have to lug our bags upstairs 😊. Though the deco is very traditional, we just loved the room; clean and well kept. We especially love the kitchen which is opened to the house guests (any time of the day). Guests can make use of the pantry to prepare their own breakfast (fruits, biscuits, oats, instant noodles are easily available). There is also cheese, jam and varieties of spread in the fridge. This is by far the best accommodation in Hobart, Tasmania. A traditional old-fashioned B&B with plenty of beds in each family room (we were a group of 7 friends). Our host John was great to chat to and very attentive at breakfast. The location is central and perfect. Highly recommend. It's my go to place whenever we are in hobart. Perfect welcome for our first trip to Tasmania. John made sure we were well-accommodated, gave us clear directions to where we wanted to go, and made a few suggestions that made our trip more enjoyable. Ideal for a short stay and ease for visiting the city.  Rooms with a certain old-world charm without falling into superficial luxury.  Hearty breakfast.  The welcome by John is friendly.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Central Hotel - Bar, Bistro, Gaming & Accommodation: Can’t comment on the rooms here but I called in for a pint and a feed. Never again. Great position. Perfect for short stays if you want to be in the city. Lots of desperate punters parking out the front on loading and taxi zones to put their bets on at 9.00am in the morning. Like going here it's central to Hobart good atmosphere heaps of pokies hi Shazza , at the bar",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Foreshore Hotel: Very comfortable units, spacious and well furnished. Very efficient and quiet aircon. Staff were lovely. Hotel was easy to get to from the airport and a good location to use as a base for road trips. Loved having my own patio to enjoy a morning coffee as well as being able to park outside my door Great food for a great price ..very Family friendly and the staff are amazing. We can't wait to go back Didn't stay in the rooms. Had a meal with a friend. Told roast pork (with crackle) received ham covered in gravy & crackle was that hard you could have filled a pothole & the road around it would have worn out first. Bar staff were friendly & polite My experience at the Foreshore Hotel was nothing short of exceptional. From the moment I walked in, I was welcomed with warmth and hospitality that made me feel right at home.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Maldini: Food was great.  Just the right serving amount for lunch. Had the Penne Bolognaise.  Very flavourful.  My friends had the Chicken risotto.  Described as tasty and creamy. Another had the Spaghetti Marinara. It was full of seafood with NZ mussels, prawns, calamari and fish. Had lunch here yesterday (29/05/2024), the food was absolutely amazing. The service was prompt, friendly and made us feel valued and important. Just visited the restaurant and thought I'd share my experience. I'd recommend making a reservation in advance, as walk-ins aren't guaranteed. The truffle gnocchi was absolutely amazing, but I found the other dishes to be just average. Prices are slightly on the higher side compared to other spots in the neighborhood, but the portion sizes are generous. However, I was a bit disappointed that there wasn't anything special provided for our anniversary dinner, like a complimentary cake. Overall, it was a decent experience. We walked off the street and surprise, they found a table for four   us. A great experience.  Had the 2 course set menu with the eye fillet. Cook to perfection. Service was prompt and very accommodating. Atmosphere was good for a weekday, not busy but a good amount of customers.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Carlyle Hotel: They promised us a boxed breakfast, never got one. All the windows in the room were not working, and the closing latches were broken. The toilet window was also broken, leaving a cold breeze going through the room. The traffic outside was quite annoying, and the air con was right outside my husband's room, which made an annoying noise throughout the night. The door to one of the rooms was too big for the frame and didn't close. Some glass was missing from the windows. The beds were comfy. We only gave this review one star because we can't do zero. Chicken boscaiola and ribs were tasty! Good portion sizes and well presented. Staff are friendly and service was good. Nice lunch out! Our meals couldn't have been better. My Mum had been there for lunch with friends previously and remarked that the food was great! So I took my daughter when she came to visit with her little family and it was disappointing, the food was burnt. 8 ball tables and company is good for the outgoing person First time coming here with the family for a Friday night meal",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Drunken Admiral: Great place to eat. Can highly recommend the seafood here. In terms of value I would say it is ever so slightly pricy for what you receive. But I stress that this is a minor concern. Ultimately the food and service were incredible, the cocktails were great. Atmosphere is a little strange but it’s not a problem at all. Thoroughly enjoyed our dinner here. Chowder was delicious and the prawn linguine was really good! Generous sized portions too! Prawn spring rolls a bit oily and wouldn’t get again. Other two dishes were fabulous though. At Drunk Admiral Hobart, you step into a cool maritime world for SOME tasty meal. My recent visit was nice, but there are some spots where they can do better. Avg food, interesting but a bit cheesy decor, quick service. This ship themed restaurant was really amazing because it made you feel like you went to a completely different place for holiday. Brings a totally different mood.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Moonah: A good Subway (unlike the awful one I went to in Dublin). Great friendly service. Convenient location. Stood there for 5-10 minutes 2 people working not serving me, than out from the back someone not in uniform comes out and they serve her before me, trash customer service I will never be returning. I just went a got my usual 6in Italian Herb toasted cheese and bacon with lettuce tomato onion capsicum carrot and jalapeño usual price $5.50 no not tonight $8.00 was told we don’t do BLT now so the bacon is an extra cost of $2.00. As much as I like my selection I want be back this is just ripping of the customer. No wonder the restaurant was empty. Amazing n very attentive team Jack. Yeah, Subway®. I reeeeeally love sub.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Hobart: This girl yesterday made me the messiest sub ever, she wasn’t super friendly, customer service was lacking. Both girls actually, no smiles or nothing. Ordered 4 subs. 3 chicken and one pure veg. Requested them to change gloves before preparing the veg sub. They did however ended up cutting it with the same knife as all other subs. The worst subs we have had anywhere globally! rubbish service, i ordered 6 inch seafood with ham. With only 1 slice of ham,1 slice, they cost me 4.25 dollars extra. Seriously, only give one slice, then charge 4.25 dollar, the 6inch seafood only cost 5 5 dollars, so i paid $4.25 for 1 slice of ham. Never come again if those staff are still there. The service was terrible enough (on multiple occasions) to make me want to write a review. The older blonde lady is especially rude.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: BP is the best petroleum company and should have more sites in Tasmania. Poor service Very convenient, shop working during holidays On 09/07/2023 @ 11 am I experienced very bad customer service from one of the BP staff Great customer service and amazing coffee made by Sadaf. She is extremely good at making the coffee.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Good location, easy access and good for disabled. Not a great range of products but ok for midnight munches. Expensive though. Oh and if tge worker is allowed to wear his headgear due to culture or whatever then I can wear my beanie. Personally i think Bp petrol prices always cheaper than other petrol station. Thats why it become one of my favorite place to refuel petrol! They also do accept virgin frequent flyer membership to collect points of every single dollar you spent! Horrible said open for 24 hours so headed down shut and closed update your google internet !!,  waisted 45 minutes walking there and back to be extremely angry at the end of a fantastic evening way to destroy an evening for a few people   😡.   Its disgusting how you do that to people :-( .    Update your bloody hours Struth !! Best coffee 💪🏻💪🏻 i go everyday , staff is brilliant and best service always smile on face , KASHISH  is the best barista . A coffee artist 👌 Mehak makes very good coffee and his service is excellent.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway North Hobart: Not the most appealing meat fillings (the salad fillings look better and are super fresh), the restaurant is clean (almost clinical), the staff are friendly and efficient, the best option would be the cookies 🍪 nom nom cookies 🍪 🍪 🍪 Value for money is long forgotten. Gone downhill since it was given a makeover. This is what the Uber eats from brought me from your restaurant. I ordered two chicken sandwiches without vegetables and instead this is what I received. I also paid extra for my Italian BMT double meat, that was ignored and only one layer of meat. In that very same order there was a southern chicken sandwich which which we asked for for chipotle sauce..needless to say no sauce in site. Basically we ordered 5 items of which 4 was done to the point of absolute dissatisfaction. Lovely store, even when they get a order wrong. They was so nice and understanding about it.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: We got the bp day free gift, which is sweet Rudest staff I've ever met, not sure of her name but was wearing an apron so I'm guessing a Barrista, I'll never shop there again Great rest stop. Petrol, food and drinks, toilet. It has what you need to refresh half way to Hobart. This service station has had a serious glow up renovation. Looks great. Service is great too. GREAT TURNAROUND TIME GR8 STAFF &PRICES",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Since the new Wild Bean update, the shop is no longer 24/7... after 10pm the doors close, and u have to use a night box. So unless you know exactly what u want to munch after 10pm don't bother. If the shop was open to browse, I would of bought more then one item. I settled with a pie. If allowed to browse I would of bought a donut, some m&ms and may chips and an icecream. You lost $$ tonight. Update your advertising as only 24/7 fuel. Imagine on a Saturday night after the pub closes and people want a nice pie or coffee. One attended will be run off their feet grabbing items from around the store. Holding up customers to no end. Why??? Crazy busy entrance, but it's a really good store. They have lots of supplies for your road trip. I needed to put air on my tyres but there was a car parked just in front of it and when I asked the staff, he was so rude. He said anyone can park and leave their car there for no reason. Well I'm lost for words. I've never known what \"BP\" stands for, but i guess it stands for \"Brilliant Petrol\". I put some Unleaded 91 in my car and it was honestly faultless. My car moved forwards and backward with 0 issues after refuelling from BP Margate. Very nice staff always attend with smile and yummy coffee served by Amarjot",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Rosny Park: Use the app and see if there’re any available online deals! Came in the morning and it’s pretty quiet, very glad to see the staff cleaning up the place. (Lots and lots of cleaning!) very impressed After ordering online to save time I had to wait at the counter for 30 minutes before getting served to only get my order printed and had to wait for it to be made. And then managed to get the order all wrong when getting home. Very poor service, the owners and staff need some serious training. I'm not sure if it's common practice or not but was in there on 2nd Feb late afternoon & a young boy walked through the front entrance with a wheelie bin to the back of the store, then a few minutes later walked back through the store with it. I just didn't think that was very professional or sanitary. Also took a little bit to be served with only a couple in front of me, but the two girls serving were very polite. I think this is the best subway in Hobart. The lettuce is always fresh and they aren’t stingy with the ingredients. Also the renovations here look great! Lovely spot! Served by Patrick who was polite, efficient and 100% on top of his game.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway New Norfolk: Tonight my partner and I were served by such a kind girl (Beks)? her customer service was amazing. Previously before us a customer had ordered around 5 or so subs and she smashed them out by herself so quick and patiently, keeping in mind she was in the shop by herself no other colleague that I could see. I came in today to grab some lunch and the girl (Tash) who served me was awful. She was extremely rude. The manager witnessed this and cringed but didn't appear to have said anything to her. Such a shame, the rest of the team that work here are really nice but i won't be back if she's working. Its been long since I had a cheesy garlic toastie from subway that wasn't burnt and bread wasn’t stale. Loved the cheesy garlic toastie made by the lovely girl! Place stands open until 10 pm and is easy for those are traveling around late night and decide to eat something. It was providential having it around. Luck us! I like the salads here.  The salad I got was smaller than the salad I'd usually get in a Subway, but I guess they can't all be great.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Poor service, average food, hard to find the shop. Happened to be ordering as the big boss turned up. Rude, condescending, obviously more worried about money than serving good food. Felt like he was watching me the whole time. Horrible vibe in shop. I’ve been to many subways before but none of them are like this one! By far the best customer service I’ve received in a long time! Big thanks to Blair for making my experience great! I absolutely loved the service off jade while I was there, she is the hardest worker I have seen in a long time. She was very nice and quick with mine and my family’s order. Deserves a promotion! Finally went into subway Sorell I have been meaning to as I work next door I just went in on my lunch break and was served by a lady she was super lovely I ordered my regular order that I get at my closest subway and wow best sub I have had from any subway well done and thank you for such amazing service Very kind staff , and enjoyed a lovely chat with one of the workers 😄. Great food as well .",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Huonville: Poor customer service, no greetings even though I greeted first, didn't tell me anything but I figured out she was doing online oder. Sa*y** was her name, she didn't seem to be having a good day, got my oder wrong, but I did not say anything but it was at the point of sale when I had to ask why am I being charged extra to which she replies because you had 2 different cheese. Cost me $1.5 extra for few pinches of mozzarella!!!  I have always asked for 2 different cheese everywhere else when I get foot long sub but has never been charged extra but she was very rude so I just paid and walked away. But girl you need some customers skill for sure!! Won't go again and get served from you. Hope you take this review positively and improve your skill. Steer clear of Tuesday afternoons for ordering! Did have a footlong of malted rye. Bread was stale and at one side hard. It appeared to me that it was bread from the day before. I won't blame the girls, they are probably just working under instructions from their manager/boss. However in a business like this there is always waste. If the manager wants to reduce waste I suggest he/she eats the old stuff self. Overall very a disappointing experience Nice and friendly staff, five star for young fellow, great customer service and it was pleasure to eat, everything seems fun environment, food, service, perfect place to fresh out all the way around here, highly appreciate No ham and only old english cheese. They could walk two doors up to salamanca fresh and buy ham but that's obviously to much effort.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Da Angelo Ristorante: Enjoyed dinner here on our first night in Hobart and it was a great way to start the trip! Best garlic bread I’ve ever had! Also ordered a lasagne (1 size) and carbonara (mains size, felt it could feed 2 so stick with the entree size if you are getting other dishes). Also, the restaurant’s interior looked way better in person, the current pictures online don’t do it justice! I think the owners should update them. Special mention to Bonnie, who was our server, she was so lovely and made us feel so welcomed! Would love to visit again! And yes, reservations are a must. We booked a couple of weeks in advance for Thursday night at 5.45pm and every table on the ground floor was full! 4.5 stars (for fabulous pizza) So amazing. The pizza was so delicious and I love the prawn risotto. If I travel to Hobart some day in the future, I’ll definitely come here again…tho the spaghetti was a little bit hard for me ;) Food is just okay ! I would say it’s not a typical Italian restaurant as the pizza and pasta are not traditional Italian dishes. Great food and service.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Waterman's Hotel: We had such a great night there. The live music was just great. The singer / guitarist was amazing! Food was good and service friendly. Some people got up and danced and added to the fun. We wandered Salamanca Place trying to choose a place for dinner and the menu of this one, plus the ambience drifting out to us in the form of some good motown music, seduced us in. We are travelling from QLD and met a group of friends for dinner and drinks at Waterman’s. From the moment we walked in, the service we received from Lily was excellent. She was so friendly, welcoming and accommodating. As it was happy “hour” the drinks were well priced. My husband ordered a Wednesday night, steak special, which included a pint of beer 🍺 . He was very impressed with the meal (he’s hard to please), so 5 stars for me not having to listen to him whinge! As the night progressed, I ordered a few cocktails. All of these were amazing. My favourites were the Gin Cocktail and the Salted Butterscotch Cocktail - both delicious! Had a terrific evening with Paul and the team. Went for a Sunday afternoon wander looking for a pint and place to chill, heard some awesome jazz and followed my ears. Good range of beers, amazingly talented musos and the sole server (Tom) is such a friendly chatty bloke. Wish I lived locally as I would make this my regular. But also... beware the urinal 🤣",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Royal Hobart Golf Club: Another glorious day for golf in Tasmania. This time at the Royal Hobart Golf Club, 20 minutes from Hobart Central. My husband and I got married here on the 24/02/24. It was the perfect day. Laura guided us through everything alleviating a lot of stress. She was very easy to get in contact with for any questions we may have had and was more than happy to meet us multiple times, she is professional, reliable and easy to get along with. The golf course was a beautiful place to get married, the view from the reception space was amazing. Bar staff are very friendly also. I have had so many compliments on how beautiful our wedding was. Would definitely recommend. Thanks Laura and the Royal Hobart Golf team. Played a Thursday comp travelling in the area. Great clubhouse and facilities. The course has struggled in the wet weather and had a lot of water lying around. Beautiful course that was very well manicured. The fairways were well kept and the green were magnificent but very quickHad a great round of 9 holes. Will definitely come back the next time I am in Tasmania. Nice practice facilities and nice staff!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jean-Pascal Patisserie: Highly recommended. Ordered a custom cake for our wedding after talking to several vendors. Jean-Pascal's were very accommodating, and made the whole process from samples to delivery effortless despite being more affordable. Very friendly staff and a delicious cake that didn't survive the evening. Jean-Pascal Patisserie is a local cafe with a highly-rated reputation, but my experience left much to be desired. The small cafe has limited seating, both indoors and outdoors, and also boasts a shop at the end of the road. Unfortunately, the ambiance was marred by unwelcoming staff and poor presentation. I visited based on a friend's recommendation, I'm in Hobart for a one day business trip. I'm so glad that I managed to squeeze this place in, what an awesome place. I had a simple breakfast, a savoury croissant and coffee. But the quality, flavour and texture of the food is simply perfect. I wish I had the time or the capacity for dessert, I've bought cookies for my trip back to Sydney and would be sharing them with family and friends. Great service. Good range of pastries. Nice spot for coffee and cake or lunch Had the European hot chocolate and their french toast- was absolutely delicious! If visiting Hobart I feel this is a must stop to try.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Republic Bar & Cafe: We went for quiz night. Food was good , however I should have gone medium with my scotch fillet and not medium rare. The Jack Daniels sauce was amazing. Spacious haven for anyone looking for live music, chill vibes, and a bevvie or two. Indoor/outdoor seats, friendly staff, tasty bites. Perfect for post-work unwind or casual catch-ups. I haven't been here for quite some time so I thought I was about due to have a meal here. Love it. really upset with our experience at republic bar tonight. we entered the beer garden shortly after buying a drink. my partner had a drink spilled on him and tried to warm up by the COMMUNAL fire heaters, the group of customers near the fire we stood by decided we shouldn’t be standing there. we explained our story after staff were called over after being verbally assaulted by their customers, the young man i spoke to first was very kind and just tried to understand the situation at hand. however shortly after we were met with another staff member and security who allowed the other customers to swear and scream at us as we were being removed. i do not understand how you can allow security guards who do not remove the problem from your venue. i agreed that if anything was said again both groups would be removed from the venue. this did not happen. don’t come here if you don’t want disrespectful customers to be protected.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "New Sydney Hotel: I have never been here and it’s not teeming with people. The atmosphere here is always at a high level with fires going during winter it’s that really old homely feel. Beer is ok but the beef and Guinness pie is amazing. Well what a little gem was  this pub. We walked in and it was absolutely vibing. I ordered the leek pie and my partner the Parma. Both were absolutely delicious. The staff were friendly and service on point. Def will be back and recommend it to anyone else going to Tasmania. Great little pub on our short break to Hobart. The pub had a great atmosphere and the steaks we ordered were delicious too. Highly recommend anyone looking for a traditional pub with decent food and selection of chilled beverages without any big screens showing endless footage of sports. A quick phone call 15 minutes out and they were able to seat four of us. So glad we found a pub in Hobart that was open on a Tuesday… The beef cheeks were incredible, and a decent range of beers on tap. An authentically brilliant Irish pub. My partner and I fell upon this place on a walk about bar hop not knowing where we would end up and it was the best place we walked into! Chairs at the bar, awesome service, great local vibes, guiness on tap for me and 50% off 12yr old Belvenie whiskey Wednesday. It was like walking into pub heaven👌🍻 the open fireplace was a treat and the friendly locals really made it. Would recommend a visit to anyone who’s going through town for sure.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "MONA: By far the best art museum we have visited worldwide! We were absolutely amazed that we only had to travel to Tasmania to see it, as you would expect it to be located in Europe somewhere. We equally enchanted by the 3 course à la carte lunch that we enjoyed, complete with excellent entertainment at the Faro restaurant. We caught the Mona Roma to and from Mona, which was relaxing. Highly recommend! I. LOVE. LOVE. LOVE MONA. I feel like my visit there was not as long as I would have liked, as I was travelling with others. If you’re a fan of dark, depressive, vulgar and all things genitals art you’ll like it. I wish I could only get the ferry ride as the boat is nice and there are dolphins and seals all around. 25 minutes were more than enough to see the gallery. A portion of the art was enjoyable to me, and honestly that’s all you really need. Their app allows the people to leave their milquetoast opinions, which are remarkably similar to the low reviews here. Those who take issue with the alleged “downfall” of contemporary art should stay clear of the museum and revise their reactionary talking points. If you are such a prude maybe stay in the Tasmanian Museum and Art Gallery (which is great, no shame there). My only real issue is that it is incredibly expensive to get there, $60 for the ferry and admission is bonkers. Mona mucked us around a bit with our lunch reservation at faro, however the art is obviously amazing. It’s like questicon for adults. Shout out to BRETT who was working at the confession exhibition, he was lovely and hilarious. Museum goers and workers can come off as dry a lot of the time (I am definitely guilty of it). It was refreshing to bond over the art in a really relaxed way.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Cascade Brewery Bar: Delicious food in a beautiful venue. The prices were very reasonable, similar to many RSL prices. We both had the Wallaby burger with chips and thoroughly enjoyed our meals. The chips were crispy outside, fluffy inside and well salted. It was delightful sitting by the window with a view of the garden and resident rooster. Definitely recommend making the effort to check it out. The food was quite average overall. Amazing place. Great gardens and lots of history. The staff were friendly and welcoming. Obviously the beer it good. Great choice of other drinks for my wife (gin) and 2yr old (apple juice). The food was amazing. So many great choices. Seafood pot pie was beautiful! Sticky belly pork and garlic bread were really good too. My wife had the wallaby Burger, I tried some and was pretty jealous. Basically all food was amazing. Perfect arvo meal and drinks choice! Thanks! Went there for a office lunch a few times, had salmon, trout, taste platter and chocolate stout cake. Plenty of other drink options there apart from the obvious Cascade own products. You can sit indoor or in the beautiful garden. Close to city, easily accessible by public bus. Lots of parking space if you are driving. You can join the historic brewery tour or beer tasting. Definitely worthwhile visiting. They have a selection of local beers on tap and some whisky tasting (although it may only be for a limited time). The food here was typical bar food but decent and the ground surrounding the brewery are beautiful. There plenty of parking nearby also. Recommended.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Doctor Syntax Hotel: Incredible food and staff. Amazing service. Great prices and atmosphere. Cannot fault the place at all although I would recommend booking for meals as it fills up fast which is no shock. Cannot comment on the accommodation as I have not stayed with them. I have been going to Dr Syntax regularly for trivia/quizz night over the last few months. The staff are lovely and very personable. Great service always. The food has always been exceptional. Good size pub portions at great prices. However, the venue has sold recently and the quality and the size of the food has gone down considerably. For example, chicken wings used to be 6 full wings, for $10 now they are 6 part wings, for $12. Burgers were massive, they used to be a double patties, now they are 1/2 the size, for the same price. Came here last weekend with a group of friends. 5-6 steaks were over cooked. Other friends didn’t finish their meal because it didn’t taste nice. We have been coming to this place for years. But they have really dropped the ball and the food is shocking. It’s very sad that the best food they do is their onion rings. Plus also the bigger man in the bar had bad sweat all over his face. Which doesn’t really make sense because he moved and made drinks at snail pace. don’t waste your time or money. Becuase we won’t ever be back. We discovered this hotel almost by accident looking for somewhere for dinner. Walk through the front bar to the dining room at back. Very busy around dinner time, lots of families. Usual menu, but good, portion sizes generous and not too expensive. Staff were fast and friendly as well. I felt /still feel greatly discomforted & upset by the derision &guffaws of supporting laughter &open hostility shown by an obese loud-mouth meat guzzler directed towards vegans & vegetarians at their last Quiz night, as well as his group of meat guzzlers being awarded 1000points for best joke by the host, which also was supported with loud &supporting applause & guffaws from the audience &host!! Made/makes my skin crawl!! Feeling distress & disrespect!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Ball & Chain Grill: I must say, it was an exceptional experience from start to finish. We walked in on a packed Saturday night with no booking and the staff could not have been more helpful and welcoming.  They found us a table within a few minutes of ordering drinks at the bar and the food was superb!  Highly recommend the Scallops and Beef Cheek and a shout out to our waiter from the Gold Coast, great service!  Would happily come back here one day, thank-you. I have to say, my experience was a fantastic experience! The atmosphere was cozy and welcoming, perfect for a laid-back afternoon out. The staff were super friendly and attentive, making sure we had everything we needed. What a revelation… from the moment we walked in and received a warm greeting to the time we left was a great night.  Started with a lovely aperitif the. Straight into one of the best seafood platters for two ever..then followed by a sensational beef cheek and medium rare grilled Atlantic salmon … could not fault anything and we will travel to Hobart again and dine here for sure (the tomahawk steak is calling us next time) Highly recommend Walked into the first restaurant we saw on our first day in Tasmania. The atmosphere is great with an authentic Australian feel. The food here is excellent. We tried the seafood platter and the beef cheek, and both were fantastic.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Astor Grill: We were travelling in Tasmania and decided to have dinner at The Astor Grill on our last night. It was hands down the best dinner we had here! The food and service was perfect! The staff who served us gave great recommendations and we thoroughly enjoyed them. We will certainly return to try out more of their menu if we are back in Tasmania in future! One of the best restaurants in Hobart! Older style and feel, bringing back comforting solid service with old school white table cloth charm. My wife and I have a great 3 courses here over an unrushed 2 hours or so. Service was attentive yet almost invisible. Would highly recommend it if you are in the mood for a nice steak and sides. Astor Grill truly impressed us with its Australian contemporary design and the delightful ambience it offers. The staff's friendliness and attentiveness added to the overall experience, ensuring we never had to ask for anything. When it comes to the food, there's nothing to fault – the starters, including fresh oysters and a delectable truffle mushroom dish, set the tone perfectly. Our main courses, the perfectly cooked steak and the flavorful fish of the day, left us thoroughly satisfied. And, I must mention, the side of mashed potatoes was out of this world. Although the restaurant offers very few vegetarian options, the desserts more than made up for it; they were simply delicious. Highly recommend the Turkish icecream . Astor Grill certainly earns our hearty recommendation for its overall experience and food . Excellent restaurant with a fantastic atmosphere very wide selection of menu options and vast wine list with many of the local wineries and distilleries represented",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Metz Sandy Bay: The food was okay and service was quick and friendly but wish we had’ve known this place has more of a loud sports/uni bar vibe at 7pm on a Saturday. We usually go to Metz on Mondays or Tuesdays for their half price pizza deal in the evening. We loved the roasted potato & pulled lamb pizza and potato & artichoke pizza There are quite a few vegetarian option too. The pizza base is on the crispy side & cheese is limited. We also tried the jam amarettos, good with coffee. The seating area is very nice & well heated for those chilly evenings in Hobart. There are plenty of options in drink menu too. 😊 Don't miss the half price pizza night on Mon & Tue. Some say the crust is too large compared to the size of the pizza. But considering the half price, I think it's pretty fare enough. Have tried all of their regular pizzas and my favorite pick is the 'Prawn Pawn'. A little spicy kick of chili flavor goes along well in the pizza. All crusts are brushed with garlic oil and I liked it. I ordered pizza and wanted chilli flakes, but it was said to me that I needed to order first while ordering pizza, but they had chilli flakes on the other table. It’s simply stupid. They didn’t even serve us utensils, just a plate to have pizza on. Whereas the other tables were served with everything Our waitress Jess was so engaging and lovely. She is an asset to this place.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Solo Pasta and Pizza: Average food. But the service and atmosphere were excellent. Our company of five enjoyed the food, but somehow it didn't click as 100% Italian food. The staff were very attentive and friendly and helpful. The price is on high end.  Would recommend this place. Cozy and comfy Italian restaurant in Hobart, loving the vibes! The food was delicious, and the service is amazing. Went here during my stay in Hobart, and all I could say that this restaurant is exceeded my expectations:) a must try! Also the price is extremely reasonable for the taste!! A very busy Italian restaurant in Sandy Bay. I could say this Italian restaurant in Hobart made me so impressed!! Our group of 14 had a fantastic experience. All the servers were very friendly, and the food was delicious! Highly recommended!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sakura Sushi and Noodles: All the stir fries were oily, my char kway teow were salty. Food was average, all up costed $75 for 4 meals and 2 drinks. Not worth. THE best sushi in hobart. I've been going here for over 10 years purely for their delicious, fresh sushi and their amazing chili oil. Their friendly staff are lovely, prices are extremely fair and everything tastes fresh. I often drive into the city purely for the sushi - i wish they did the sushi on ubereats! This is my adult child's favourite place to get laksa in Hobart, so I had to try when I came to visit them. The chicken laksa isn't as great as my usual place but it was very nice and I enjoyed it. The staff were friendly and happy to package up my leftovers to take with me. The prices were great too! Delicious food at a very reasonable price ($35 total for two dishes). Staffs and owner is very nice. Sashimi and noodles were excellent and very fairly priced. I wish we were local!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Annapurna Salamanca Indian Restaurant: Popular Indian place in Salamanca. We loved the mixed tandoori platter with naan for dinner. Gulab jamuns were great for dessert. Annapurna at Salamanca holds a special place in the hearts of my family and friends. I have been a patron of this restaurant,  and it continues to draw me back thanks to its inviting ambience, exceptional culinary offerings, welcoming staff and efficient service. Great place for Indian foods. Interior looks modern with traditional touch. Like it. Not like other Indian restos with red and green LED lights. Staffs were friendly and attentive, look after customers’ experience with their foods. Price is fair for the foods’ size and experience. Taste was okay. Never been to India before. So no complaints on it. Prices for take away is 2$ less than dining in. An good indian restaurant in the rather buzzing salamanca place, definitely seems like one of popular places with lot of tables and ample seating space! We had the saag panner which we heard is very popular and it was really different and good! Walked away with a question unanswered in my mind as it's a very different business model - why is rice complimentary with every dish? Haha, overall a good dinner experience! The food arrived on time, customer service was really good, food was average I would say but the food quality was great. The environment was also pretty nice. We ordered for special thali and seafood thali with some starters, everything arrived on time without any delays. On the desert we ordered for mango kulfi, kulfi was really delicious. If you are in the city area and looking for a restaurant dinner with some drinks, this would be your place.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Domino's Pizza Glenorchy: I had the pleasure of being served by Bianca during my recent visit to Domino's, and I must say, she left a lasting impression. Despite the bustling atmosphere, Bianca handled everything with remarkable efficiency and grace. Not only was she managing the reception area solo, but she was also multitasking by preparing pizzas with precision. It’s unhygienic working place, and the staff just threw the pizza on the counter and straight away went behind the kitchen not saying a word. The garlic bread was missing and I needed to ask for it. When I reached home opened the garlic bread, it’s cold from inside.  Customer service and food quality has serious problems. The lady made me feel like I committed a crime by ordering Domino's at this store. I went to pick up my order on 30/4 at around 4:00 p.m, and the girl at the front treated me so badly, it ruined my entire evening. Everyone has problems, but that doesn’t mean you should reflect it onto the customer. I understand going through a bad time, but it still doesn’t give you the right to be rude. Also, the pizza quality was absolutely rubbish, with missing ingredients I paid extra for. Dear consumer It was very joyful and fun, lots of smiles and laughter, good workmenship environment too, breeanna and Elizabeth were very kind and helpful to me, luke was star in the work shop everyone was getting help from him and it was wonderful love it",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Peppermint Bay & Peppermint Bay Cruises: Do yourself a favour and book the lunch cruise. Some of the best food I’ve had in my life. The New York strip was outstanding, and that dessert (panna cotta) was to DIE for. We had a delicious lunch at the restaurant - yummy flavors and upscale atmosphere. Ingredients were fresh and everything was amazing. Lots of parking. Fantastic view and delicious food We had booked into a cottage in Oyster Cove - Kettering.  Decided to head out for a drink and dine and booked at Peppermint Bay.  What a fantastic venue. The wait staff are warm and welcoming.  Stunning views over the water and food top class and very reasonable priced.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Cugini Restaurant: We went to Cugini for my son's 12th birthday at his request. Sadly, despite us telling the staff this when making the booking and on arrival, it was not acknowledged in any way. The food was OK but because we couldn't get the earlier seating, we were too tired to eat it or enjoy it and we took most of it away. The service was OK but lacked warmth and friendliness. All in all, saddened by the experience. Had the nicest evening with our work team last night at Cugini. Absolutely fantastic service, food was amazing. Alfonzo and the wonderful staff couldn’t be more hospitable and welcoming. Bellerive, you deserve to be very proud of our eating-out choices. Cugini is the best! Atmosphere and service are spot on. One of the best Italian restaurants in Hobart! And most definitely the best pizza in town. The staff are welcoming, attentive and friendly. You cannot go wrong for any occasion at Cugini, family get together, birthday celebration or a romantic dinner for two. One of our fav's Recently experienced the most amazing dining - table of 8 - every meal was delicious, staff were friendly and service was great. Overall our dining was exceptional from start to finish. Thank you to Alfonso and his team - special thanks to chef Nathaniel. Great way to celebrate with family. Definitely be back again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "berta: Delicious food & delicious coffee. Staff were warm and welcoming - especially for an early Monday morning visit. This place is an absolute gem. Super cute little Cafe with a beautiful setting, very welcoming and cosy. Our waitress was a bit under the pump but she handle herself well and we understood the rush of getting in our order before menu change. So many incredible options, it was hard for us to decide. We were hungry too so naturally we over ordered. We ordered the Kimchi friend rice to share. This was hands down one of the best fried rices ever. 🤤 we also order 2 brekky mains as well, which was definitely too much but so worth it. We had the Mediterranean and the Turkish breakfast. Very very generous portions but the flavours were spot on. I'm not a huge fan of falafel but I was even impressed by those. The beautiful rich sauces and the accompaniments with each dish was incredible. Will definitely be back and highly recommend! 5 🌟 Low key vibey coffee shop with delicious breakfast options and warm coffee. The inconspicuous green door is easy to miss but you'd be sad if you did. Our visit to Berta Café today left us utterly impressed and grateful for the exceptional hospitality we experienced. Despite a minor mishap where my mom accidentally spilled her cup of coffee, Immediately upon the spill, the staff swiftly began preparing a fresh cup of coffee for my mom.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Went in yesterday with my younger sister who was in school uniform to meet my older brother who was ordering and my sister and i needed to use the toilet and as i go to walk in with her the girl working at the time yells out in the rudest tone “NO SMOKING, ILL BE CHECKING” with authority and as i was in there my brother told her we don’t smoke and that we are his sisters, and she apologised to him and said it was because i was in full black and wearing a duffle bag which is used to carry my school books and i was in full black because i was keeping warm. She had brown hair and was short and looked between 18-21ish. There was an incident with girls wearing full black and duffels smoking in there, I just needed to use the toilet and she was yelling at me as i’m minding my own business. Not an apology nothing, so unprofessional never going here again!!! How can someone go so wrong at a Subway Franchise. Utter disappointment at its best. Really bad service at Glenorchy Subway I am really disappointed. It’s just a wastage of money. Who’s gona come next time to saw the service like this. I ordered two foot longers online and it was clearly mentioned in my receipt that need to bes tosted but no one bothered. I mentioned that no tomatoes but they just filled it up with tomatoes. It was way to cold like I took something out from the fridge and straight away eaten it. Three staff were working, none seemed to know how to do their jobs. Seemed to be incapable of managing orders even when it was not busy.  Couldn’t redeem a simple offer for a free cookie and drink I had on my app. Straight up told me “you can’t use this code” when we clearly could. Very worst customer service, doesn’t understand order and racist.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Domino's Pizza Rosny: Pizza delivered hot and fresh, with absolute STAR customer service from the driver. After ringing the store to pass on my feedback, I can now publicly say, Billy, your service was 10/10 and we hope to see you again mate! 👍🏻 Went in today and was greeted by a friendly worker at the counter, when I received my food everything was perfect, I asked for extra pepperoni and it was spot on 👌 best pizza in a while, thanks to the kitchen staff Ordered spicy peppy paneer,  but they delivered  the pizza with chicken in it. And they just sprinkled the paneer on top of it, putting my gealth at risk as I am a pure vegetarian person. Pathetic service. Order was messed up and we were told we could get them replaced but then the manager repeatedly hung up the phone saying they’re not giving any free food away. Overall this place makes great pizza as I am ordering it for past 6 weeks and only once I felt they let me down but overall,  they make the beat pizza with consistency and on time. May be I should say they are not stingy and make it with love as it should be. Nowadays, people are cutting corners with the toppings but at least these people are giving what the standard is and with love. Overall great staff and good quality pizza ! Keep the good work going guys",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Finally decided to write something about the fuel station, Very Lovley staff allways good fuel and plenty of clearance items best hot drinks aswell only servo I'll be going to plus the BP rewards cards are awesome aswell A huge shout out to “Matthew” we went early this morning (1/12/23) at about 1:30 am after getting a late flight in from melbourne. Matthew was fantastic! Super helpful and friendly and did everything he could to assist us through the night window with some forgotten essentials (tooth brush etc). He also heated up a pie for my partner with no complaint at all. He did this all with a super friendly demeanour and smile. Really appreciate your service tonight/this morning mate. Not bad. Went for manual car wash. $2 for 2 mins We left our fuel cap there 5 days ago, finally realised, and they had kept it for us, too easy. Just so appreciated, and we always get excellent service from them. Cheers again guys :)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway Kingston: Usually don’t have an issue here but the last few times I’ve been (twice in a week) it’s been busy and understaffed. Tonight there was one worker on his own getting absolutely slammed as person after person and multiple groups came in, one lady (possibly Uber) was standing at the counter in the way holding her phone up as the staff member was trying to check out customers, one customer complaining loudly about the wait time. Felt really bad for the staff member trying his best to keep up! Maybe roster more staff on for peak times as it’s not pleasant for the staff or customers. Very polite service staff. Sandwich we had was fresh and filled. They even cut the footlong in half and seperatly wrapped both pieces as we were sharing the meal. Quite busy at lunch time however the queue moved freely. So consistent I love it, always have a good experience here. Staff are lovely and efficient and the food always delicious. Have been to Hobart subway a few times and am always disappointed, never at Kingston though, bloody love their work The Staff are too young to handle a busy shop. Please hire some mature people so that the kids don't panic and customers have a pleasant experience Went in today for a quick bite. Was greeted by a friendly young worker. Staff was happy and talkative, and the best part is the fact that she made a delicious sandwich! I've been to Subway a few times now, but today was the best sub I've ever had.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Obnoxious and unpleasant service from the blonde cashier mid afternoon 25/3. Asked politely if she could break a $50 for me and received no verbal response and she just huffed to the till. Slammed it close and abruptly says something like 'aint got it' - no explanation as to no small bills, maybe would you like to buy a drink, or anything like that. I was shocked and as I stood there she aggressively follows up with 'not happening pal' and basically stared me down. Completely unreasonable customer service. I was asked if I wanted two free chocolates with my fuel purchase. I declined so the cashier scanned two twix bars and replied “ I’ll have them then”… acceptable ??? I wouldn’t think so… Recently visted Bp Brighton to buy Connoisseur ice cream tub peanut butter crunchy 1 Ltr found that the staff was charging me $15 instead of $14.50. There was a ticket of the peanut butter crunchy but wrong filling line of products on the shelf. Informed the staff about the price he refused to give me for $14.50. Didn't expect such type of customer service and getting over charged. Helpful staff, fast service, Krispy Kreme doughnuts n cheap cigs... fabulous! I recently visited here and had the pleasure of meeting Simran. She provided me with exceptional customer service and made sure that my experience at the store was a great one. I had an issue with my card payment, but Simran handled it with professionalism and efficiency. She truly went above and beyond to look after her customers. The coffee was great as well! I highly recommend this place, and I hope that Simran's excellent work is recognized and rewarded by the management team. Thank you, Simran, for making my visit such a memorable one!\"",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: The guy who was working during 9 pm shift today (Thursday) at Kingston BP Tasmania was very rude. He didnot tell me anything about the door when I made my payment and when I pressed the button to open the door he got angry and was straight up rude. He doesn't know the basic etiquette of customer service. The way he was speaking, this was the worst person to ever serve me. That store clerk was super rude! They wouldn't let me in and even made inappropriate gestures because of where I parked. He followed up by refusing to let other patrons in the store because how I moved my car whilst looking online for the most appropriate way to complain Great modern station with friendly staff, premises is kept very clean and tidy . Trying to get served .... one staff trying to serve people on  her own while the others pretend they are doing work The lady that served us was one of the friendliest service station employees I’ve ever come across",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "bp: Convenient petrol station for those returning rental cars but it is more pricey. Great location for convenience for fuelling up hire car. Nice and close to airport and airport accommodation. Also a subway on site for a quick bite. At the time I was in Tas had very competitive prices and this is good when refilling your hire car. And easy to get to. Good station right before the airport. Not an abundance of pumps so may have to wait if it is busy. Lots of parking outside store, easy entry and exit. Well stocked store inside! Wow what a amazing place very friendly staff . Decorated in pink for McGrath day. Well done BP Hobart airport",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "KFC Derwent Park: Unfortunately I have to give one star to this KFC since it’s the bare minimum for Google Maps. Photos won't depict the quality of the food. Chips had 0 salt when we asked for extra and while we were collecting the food they asked again and they said if chicken salts fine and I said yes but still 0 salt took 20 minutes to get 3 three price meal and we got them all upgraded but 1 was a medium but we were charged for a large and don't get me started on the drink when I first grabbed it out their hand it felt like it was about to explode and the second I drove away from the drive through it popped and is all over my seat and me. Cheers KFC 👍 Disgraceful store with staff who do not care at all about customers.  Manager is just a disgrace as has no idea what he is doing.  A male dark staff member, forever wiping his nose wit the back of his hand.   11am, and still making people wait for food,as too lazy to cook on time.   These people,don't have a clue about customer relations or serivice. My partner and myself ordered a zinger box  and an original box for myself.... the Buns on both of ours were hard as a rock....chicken was not much better.....dry and not fresh at all.....we should have chosen better as this experience has been had before, buti never complained",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hejo's Chinese Restaurant: Don’t waste your money here! Wish I can do 0 ✨The worst Chinese food I’ve ever had in here! over price n slow service , only because I order some “ complicated “ dish which have to wait until cheif make easy dished for other table( after me ) first……. We went here  late night, everywhere was closed and also here was closed but the owner welcome us to seat and ordered. Very kind of him. The food's great and the staff are really nice. Only thing is, it gets pretty crowded, so you might want to book a table ahead of time. Arguably the best Chinese I've eaten in years, pork belly in chilli was amazing, there was also a duck in vermicelli that was so tender and flavourful, and the dumplings were clearly made in house. Service was a little less attentive than I'd expect, and the atmosphere was a little flat but that may well have been just because we were likely the first customers for the evening, but without question I will be back I came here quiet late at night. They where doing take away only. I ordered wonton and satay chicken spicy, and rice.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "KFC Northgate: Chicken are dry, not really good, but the staffs are nice, heplful and talkative. Wow the most horrifying experience, the service was atrocious had to wait and wait and wait and wait and wait and wait and wait and wait and wait and wait and the chicken ended up being god damn raw in the centre.if i had of thought before i left i should have taken a bite out of each piece to see how well it was cooked or not, personally i think they should put kfc,hungry jacks,McDonald's all in the same boat cause its all mcshit,you probably better off running your finger around the rim of Northgates toilets you probably get less sickness from them. Nailed the sliders - very enjoyable. Ordered with them through Uber. Took almost an hour for our order to be ready and the chicken was so burnt that it had obviously been cooking the entire time. Will never order from them again, it was disgusting🤮 Uber eats half the order missing, can’t reach the store as they say they are closed, but we know they are open, very disappointing NEVER AGAIN and I’ll spread the word",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Machine Laundry Cafe: This is a really eclectic place that is actually attached to a working laundromat. There is seating inside and out, and for those cooler days they even have blankets tou can use to keep warm. I enjoyed the hotcakes which can with a great berry sauce. My partner enjoyed the porridge which tasted sublime. The only criticism of the porridge was the size of the serving which was simply enormous. I guess that’s why it’s called 3 bears porridge because you could feed that many. Service was okay. Coffee was great. What can I say!  I had no idea of this place until my friend decided to take me for lunch.  I'm so glad he did. We have eaten here before and always look forward to coming back. Excellent menu, we had the 'Fat Boy's roti that had grilled chicken and vegetables with peanut sauce. Their coffee is always amazing and it's in a great area at Salamanca. If you are in town eat here...oh and you can do your washing here. Really. Raspberry Chocolate muffin was on offer the day I went in - what a treat! The texture was just perfect, crunchy top and perfectly moist throughout with tons of chocolate and raspberries! It came warm with a serve of fresh butter which was lovely. Best granola! Great food, fresh, healthy and big serves.",
        "Additional_Info": ""
    }
]