[
    {
        "Place_Reviews": "Best Western Melbourne City Hotel: The staff were exceptionally friendly & helpful. Nice clean hotel, rooms are small but comfortable and clean. The shower was super small and only just got in the shower door, some people just wouldn't be able to fit in through the shower screen door Staff were friendly enough and the location is good, one of the elevators was out of service, my room had leftovers in the fridge (pierced milk cartons) from the previous person still in the room. The bathroom was small with black mould, and I was locked out of my room multiple times because my key card stopped working, not very convenient and quite frustrating having to go down and get it replaced each time. My First Stay on my own was in Small rooms with even smaller bathrooms. But great location! In the free tram zone, few minutes from Southern Cross Station and Skybus.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Amora Hotel Riverwalk Melbourne: Fantastic stay, highly recommend!! Stayed on Saturday night. Room was ok - clean but extremely dated, TV was barely working. Shower in the bath - really needs renovation. Stunk of old cigarette smoke in the hallway to get to the room very off putting. The front desk staff could improve their welcoming and helpful attitude. Our business conference experience was marred by technical issues with the projector, causing us to lose valuable time and momentum. Unfortunately, no one seemed to take notice or address the situation with the water rifles. Wow.  Just wow.  Last minute booking for an event for 20 people.  The staff all did an absolute amazing job to pull this together and arrange a room, food and drinks with only an hour notice.  Will definitely be booking here in the future. Thank you, thank you and Thank you.  To anyone looking at booking an event, it’s a no brainer -book here!! I have been here a few times for meetings. They have a lot of event spaces as well as the rooms to stay with parking. They also have a great selection of drinks at the bar and decent food and service at the restaurant. An institution in bridge road!  The location is great as there are lots of nature and all that you need at the door front as well as the capital city trail next to the river for walking. Also Creswick reserve is not too far!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Donovans: My third time eating here and each time it just gets better. Food is exceptional and the atmosphere is cozy, rustic and inviting. Beautiful food served in a gorgeous setting, like a Ralph Lauren store if Ralph Lauren had a beach chic vibe. Sam our waiter was absolutely perfect. We ordered oysters, the T Bone. crispy skin barramundi, crab ravioli, wedge salad and asparagus. The ravioli was to die for. Perfect balance of the sweetness of the crab and the lemony tartness of the sauce. T Bone and the fish was cooked perfectly. The T Bone was charcoal grilled and served with crispy wedge potatoes and baby lettuce. All of this was against the backdrop of the beach and the sea. Excellent service, friendly staff, great atmosphere and a wonderful vibe. Extraordinary great food and it has a awesome view of the bay. love the vibe and very friendly staff and perfect location for a beach day. The food is good but with the price they charge I expect better presentation. Just be aware that a glass of sparkling water will be $12. Donovans is absolutely sensational. If I could give Donovans 6 stars I would. The whole meal was wonderful from start to finish. The food was outstanding and the wine was absolutely excellent. If you are having a special occasion dinner, Donovans should be the place to go! I cannot wait to go there again!!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Grand Hotel Melbourne: What wonderful, friendly, and helpful staff. What a great location. So convenient for Marvel Stadium, Southbank and much much more. The Grand Hotel is a 5 minute walk to the casino and Convention centre so ideally located for us on this trip. Tram stop not far away either. The rooms are large and very comfortable the double glazing keeps the city sounds at bay. The front desk staff are very knowledgeable about Melbourne and had lots of ideas if you care to ask. Overall we love this place for its strong heritage value and we will definitely be coming back next visit. Great staff, easy and fast check-in and check-out.  Beautiful old building with high ceilings and the world's longest corridors.  The place is very grand.  The rooms are huge compared to modern hotels and are well equipped.  This one had a full kitchen and even a large fridge.  Secondary windows have been installed behind the original ones so it's double glazed and very quiet but they open if you want which is nice.  A hand written welcome card from Denis along with some lindt chocolates was a lovely touch that made me smile.  Perfect location as a base, I'll stay here again and wouldn't hesitate to recommend it to others. Amazing service from the friendly staff. Nice old style rooms with plenty of amenities. Perfect location next to the train station with tons of food/shopping options nearby. Highly recommend! Beautiful old hotel, room was maybe 3.5 stars, lots of maintenance needed. Lots of space and bright and airy. We had a room on the southern side and the trains are pretty loud. They are really only noticeable in the day , but it’s definitely not calming or relaxing while they are grinding around the corner. For the price though, it was great. Maybe a room up the street would be perfect?",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "La Camera, Italian Restaurant: 5 of us for lunch.  Shared starters of cheesy, garlic and herbs pizza (note this is one of my favourite things to eat, and if it's on a menu I'm ordering it!), mixed olives and arancini.  Mains I had vegetarian penne, husband had seafood pasta while others had vegetarian risotto and steaks (one with dmsakad abd onw with chips).  Drinks - Proseccos, red wines, ber, cokes and coffees (decaf soy latte and flat whites). Also cannoli and vanilla gelati.  Hadn't been to La Camera in years so good to go back.  Really great position in Southgate so nice views.  Lots of seating too.  However husband was quite sick later and only thing he had different that could have possibly caused this was the seafood.  Didn't eat anything else after lunch so...... Good selection of food and drinks on the menu. Delicious food, nice view from the balcony. Great size restaurant with indoor & outdoor seating, we sat outside on the balcony with a nice view of the Yarra, was a shame the weather wasn’t great & the blinds were down. This has to be one of the worst restaurants on the southbank I have been to Firstly, the food was incredible. I think It's hard to have dinner at a place where you would rate every single course of the night 5 stars, but the pizza and lasagne were excellent, and the dessert, tiramasu  and gelati were perfect 👌🏻.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Brighton Savoy: Hotel Accommodation & Wedding Events Venue: Love watching live camera, reminds me of all the times I have been at this spot! Great views of the city as well, will be back one day to visit my city of birth Melbourne! Regards from Slovenia 🇸🇮💕🇦🇺🦘🪃🐨 The hotel is so well situated for this beach cam. Having this service allows us to see the up to date conditions before we decide to go to the beach and do wind surfing. It is also a great live weather check. Thank you for this community service. Michael is a genuine, lovely guy who went out of his way to accommodate us. Great communicator, kind and a great bloke. I never got to stay at the Savoy while it was still operating as a hotel but recently we spent some time there shooting scenes for an upcoming TV series. Owner managers Jenny and Michael were super helpful and accomodating for all our requests and I can really recommend the Savoy as an excellent filming location. Thankyou! We had our wedding at the Brighton Savoy in the Sea view room on 27/03/2021 and we had the most wonderful experience. The staff  went above and beyond to help us and the whole day/night went so well and the venue looked amazing!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Nomads St Kilda (Base): We had a great experience at Nomads St. Kilda! The location is perfect, just a twenty minute tram into the CBD. Our room was lovely, super clean and comfortable exactly what you need. Quentin on reception was a star, super friendly, welcoming and knowledgable on the area, he stole the show for us :) Bingo on a Monday was also super busy and the MC was brilliant! Hostel is very nice. Rooms get cleaned everyday, they are a bit messy but that’s more the people in the room. Kitchen is okay, not a lot of space but it was fine. You can also hear the music from downstairs on some nights but it is not too bad. It is more of a party hostel though so people can enter the room at several times throughout the night. Such a welcoming hostel with a friendly and social atmosphere! Staff are AMAZING and really made it home away from home during a long stay. Most importantly the best bingo in Australia😉 Kicked me out because I had a cat.discusting . Best western in the city a posh hotel welcomed us with open arms. Much better room. As well. Wouldn't budge and I offered to get the room cleaned. Plus they charged me for the night. Avoid at all costs Hey! I would like to thank this hostel and the people who welcomed me, a big thank you to you! I stayed there a few months ago, it was my first day in Melbourne, even in Australia, with very poor basics in English and Anna, whom I can never thank enough, really took the time to help me . Even when I had problems they gave me time to rest after 25 hours of traveling to resolve them afterwards! At the slightest problem they were there to meet my expectations, I hope Anna sees this message because I am super grateful for the help she gave me. I highly recommend this hostel, the people are kind and patient, it's clean and the breakfasts are good! The rooms, like the showers and the common areas are also clean, there is nothing to say, perfect! Without forgetting the atmosphere and the location! I would come back without hesitating !! Thanks you again :))",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Best Western Plus Buckingham International Hotel: Very friendly staff. We stayed for 4 nights. However, our 2 bedroom apartment was nothing like the pictures on the website.  Pictures showed a full kitchen with island bench but we had a minute galley kitchen which if 2 people were sitting at the kitchen side of the dining table, meant that you couldn't open the oven or dishwasher doors. Hotel location not bad for us. super noisy due roads and bulding work being carried out at the hotel. higher managment not that helpful as english was their second language and didn't fully understand what I was complaining about. cleaning of rooms terrible, stuff on the the floor for the full 2 weeks we were there. pillows rubbish and very hard, not able to get a great night sleep due all the circunstances, builders started at 0730 every morning. marks on the bed linen etc. absolutely not value for money, do not advise staying here. Attended event on a Saturday. Event catering is standard - fresh and tasty as you'd expect.  Facility is a little older, but everything works.  Function Room is L-shaped. Only constraint is that it is upstairs and there's no lift or ramp access should you need it. Ran a 2 day Evidential Mediumship workshop in their function room that was catered for with morning tea, lunch and afternoon tea. Our 30 delegates were very impressed with the service, attention to detail and care that was provided. Thank you Manju, the brilliant Harry and your team for helping make our workshop event a success. Surprisingly, homely with very accommodating and helpful staff.  A good business hotel. Everything works. Don't expect the Hyatt. The restaurant is outstanding.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jai Ho Indian Restaurant Richmond: So good!! A great authentic Indian spot on swan street. The staff are all wonderful and incredibly lovely, and the food was fantastic. Will be back! Visiting Jai Ho after a gap of few years, I was pleasantly surprised to experience the same exceptional taste and quality of food which we had enjoyed in the past. I have always loved the atmosphere around Richmond/CBD - this visit was definitely worth our while. Looking forward to more frequent visits here. I don't know why it took me so long to try eating here.  It was really good.  It's a big restaurant with quite an extensive menu and reasonably good, attentive service (other than when it took them forever to clear away the dishes after walking past us multiple times and never looking at us).  The food was delicious and I'd love to try it again.  Everything we ate was really good and we were all happy with our meals.  We will be back. Unfortunately quite disappointing. On one hand the gluten free roti was very good, the serving size of the rice was generous and the price is fair. As for the rest, not great. Ordering a small meal took quite a while to order and receive. When we did get our beef tikka masala it was terrible quality meat that felt like it had come straight out of a freezer. The waitress admitted it had been frozen so 2 stars for the honesty rather than 1. Heard a lot about this place and it was good to finally make it for dinner with a group of friends.. lot of options for both vegetarians and non vegetarians with a good mix of different drinks as well.. food was very good and tasty and well sized portions with decent pricing.. spacious place with ample dining capacity.. the vegetarian platter could have been a lot better with the choice of inclusions and wasn't as great as the non vegetarian platter... only area of improvement as such was the wait time to serve the food from the time of ordering, it took very long for our food to arrive and though it was worth the wait the wait time between our starters n main course killed our hunger! A good experience overall ...",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Best Western Plus The Tudor-Box Hill: Loved it, only problem we faced is that it looked like the email systems they had had an outage and apparently the staff weren't even informed of that? So, we didn't get any receipts or booking confirmation. Kind of strange. Room itself was absolutely lovely and I enjoyed the old style of the rooms. Definitely felt luxurious. I only stayed for one night but could have easily stayed longer. The rooms were clean and well serviced, with pleasant and helpful staff. The bed was comfortable and had 4 pillows in a variety of thicknesses. The over sized shower towels and non slip bath mat were a pleasant suprise, and the fusion garden was a lovely spot to have my morning coffee and prepare for the day ahead. If you just need a room for the night then it’s acceptable. The room I had was executive. It had a queen bed, a lounge to sit on and a single bed. The furnishing is old and marked. The bed was comfortable and for the price of $127 it was fine for the night. Unfortunately my experience here was horrible. The room stunk something chronic. The room and blinds were covered in dead bugs. Walls were marked and stained with liquid. Bed was not made and the sheets dirty. Carpet in front of kitchen had underlay cut out where there must have been  a flood but carpet pulled back over the concrete. Mould and dirt through the room. Bugs everywhere. Walls cracked so bad we were worried the roof was going to collapse. And for good measure we were told we were upgraded to this room and its a room they don't normally hire out to anyone. I can see why its not advertised. STAY AWAY FROM THIS PLACE FOR YOUR OWN HEALTH!! Sadly, we didn't have the best experience. My husband and I booked for a couple of nights stay in a queen bed suit. When we arrived, we were told we had not booked a room and had to pay a $100 security deposit (nowhere on the website, did it say you needed to pay a security deposit and we are still waiting on the deposit refund).",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Savoy Hotel on Little Collins Melbourne: We recently had the honour of working here for a customers wedding. The venue space is beyond stunning and the team is great to work with. Annie from the events department was lovely and went above and beyond to make sure everything was perfect for the couple. Highly recommend this gorgeous space to all couples. Thanks again! Very good location, design is kind of old fashioned, room is a small but enough comfortable, I slept very well here. I can make a coffee or tea  in the room. Easy check in. Ideally located about 100 metres to Sky bus. Staff were efficient and helpful. The Alexander bar had great ambience and service. We were lucky enough to attend the Thursday night acoustic, a great way to finish a full day sightseeing. Stayed in the Richardson Loft room and was allocated the corner. Huge area down stairs and good size area upstairs. Bed was super comfy. Close to rail, tram and sky bus. Considering a busy street outside and only on level 2 the room was surprisingly quiet. 👍🏻 · Check-in process was relatively simple, and the receptionist was very friendly. The room was spacious and unique, and the decor was classy and stylish. Being located right across Southern Cross Station, we could get to wherever we wanted to. Even Queen Victoria Market was within walking distance, which is a bonus! Breakfast was incredible, and the variety of food exceeded our expectations.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rendezvous Hotel Melbourne: My husband & I had a lovely night here last week. It is a beautiful heritage hotel with many original features. The breakfast is very nice & all service was excellent. Special shout out to kind, wonderful & very helpful Tony who not only took our luggage, but was a wealth of information too. Tony, with that soothing speaking voice you should be on the stage. Cheers & Best Wishes to you all.  ;-D Mother’s Day High Tea was lovely. Fresh, eloquent finger sandwiches were the highlight. $89 per person. Tables were spaced well around the room. Staff were friendly, well dressed and polite. Rose and chocolates on arrival were a lovely touch. My Nephew & his Wife had their wedding reception at Rendezvous and wow, what a night that was!!! Worth 6 stars just for that experience. The Rendezvous party room was brilliant, grand, eclectic and the staff and DJ were superb, happy and ever gracious and ready to help. Great place, great service and great atmosphere. Edit - The money has since been refunded which I greatly appreciate I’ve stayed here twice now and every time has been wonderful, the staff are polite and they make checking in and out easy. The rooms are clean and very fancy with updated lighting that you can change the dimness of. Overall one of the best hotels in Melbourne",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Lyall Hotel: Little jewel of a hotel in Melbourne. Thank you for such a lovely stay, we look forward to returning soon. Without a doubt, one of the best hotels/experience I’ve ever had! The hotel is high quality, stunning, and has very friendly welcoming staff. The rooms are cutely arranged and very nice, which makes sense since it was newly renovated. Our multi-day stay here went smoothly and we were treated with such positivity and warmth. I would absolutely return here again in the future! What a GEM! Highly recommend staying at the Lyall. Beautiful rooms, service and pricing was very reasonable. I would definitely stay again. I stayed at the 'old' Lyall several times and loved it, have been anticipating the reopening and was lucky enough to be able to check in on the first day it reopened. The renovation has made the hotel feel more open and light from the second you walk in, while retaining the quiet, relaxed feel from before.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lancemore Mansion Hotel Werribee Park: Had a great experience with the front receptionist this week. My mother and I had some issues with the adjoining restaurant, and the wonderful Frances promptly (and gracefully!) completely sorted it out 😊. Thank you so much! We appreciate the time and effort you took to make sure our stay was positive and memorable! This place is local to us.  Everything was amazing.    Food was top notch best steak I’ve ever had.  High tea was great.   Spa experience was something I’ve never heard if before, Haman steam room with exfoliating scrub and clay mask.   Felt so good.  Ver relaxing. Bed was atrocious, I had to turn the bed around so I would not sink into it. My daughter and I were totally spoilt by Zaina and Ash at the Lancemore spa. These beautiful ladies were professional, kind, experienced, friendly and totally exceeded our expectations in the best 2 hours of pampering I have ever experienced. I would highly recommend booking a massage and facial with Zaina and Ash. Disappointed with the room, bathroom was unclean, remote had to be fix and coffee machine didn’t work properly.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Middle Park Hotel: Stayed here on the weekend and had a We love coming here and enjoyed apartment room one level one which is spacious, cosy with a gas fire and charming. The food in the bar is just excellent and better than the 5 star hotels you find yourself in. I love this place for its relaxed suburban location, next to coffee shops, a tram stop, the ocean and st Kilda. Staff are friendly and helpful. We can’t wait to return. Upon visiting your establishment for a roast dinner, I had high expectations, having read favorable reviews. Initially, the bar staff were attentive, but upon the arrival of our roast, priced at $34, my anticipation waned. While the beef was satisfactory, the broccolini was served raw, the Yorkshire pudding was dense like a sponge, and the potatoes lacked the desired crispiness. As a purveyor of Sunday roasts, it's imperative that such staples are executed flawlessly. Upon expressing our dissatisfaction to the waitress, she acknowledged the shortcomings. After a brief wait, the manager approached us to inquire about our discontentment. It was expressed, in jest, that the individual responsible for the Yorkshire pudding's preparation should be dismissed. Regrettably, this lighthearted comment was misconstrued. As a British patron, I trust you can appreciate the intent behind such humor. In conclusion, I advise potential patrons seeking a quality Sunday roast to look elsewhere. This experience stands out as one of the least satisfactory in my seven years of residency here. Additionally, fostering an environment receptive to constructive feedback and displaying professionalism among staff members would greatly enhance customer satisfaction. Been here many times over the years. Always delivers great food and service. Place is well set out from the front bar, dining area or beer garden. Great for families or meeting up with mates to watch the footy. Food was really nice and the staff were very friendly and attentive. No problem there at all. It is pricey for what you get I think. $30 for a burger is steep!! It was a good burger but not outstanding. Also there was jugs of water at our table and I don't know if it's because the building is old but it tasted funky and smelled like it had been sitting in a public toilet for a really really long time. I have no idea what is happening with the water but I've never tasted or smelled anything like it. I think that needs to be sorted.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Aviary Hotel: We always drove pass this pub on Victoria Street after we went IKEA and never try it before. We found there's a deal on Groupon , therefore let's buy and try ! We made a booking tonight for both of us and our kid. Genuinely the best restaurant experience I’ve ever had. Flint was an absolute legend, super accommodating, Funny and kind. Flint went above and beyond for my mums birthday. He offered us a few cheeky delicious drinks on the house, gave us some sparklers for our cupcakes, kept us entertained the whole night. We had the best meal, the steak sandwich is so good & a definite star of the menu. Amazing place worth a visit. Trivia Tuesday was a fun coupled with the steak night. Beautiful and cozy pub, friendly staff. My photos don’t justify the place. Good food and drink deals for week nights. It just became one of my favorite pubs for sure.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Oriental Teahouse South Yarra: Enjoyed a delightful birthday dinner here! The atmosphere was perfect, and the free tea tasting was a lovely touch. The prawn dumplings were outstanding, and the staff were incredibly friendly, always with a smile. Can't wait to visit again! Had delightful time here as per usual. There’s nothing bad on the menu after dining here over 6 times. It stays true to Chinese but with a twist. The steamed buns and dumplings weren’t the best so don’t expect a full yumcha experience here, but dumplings are dumplings. The stir fry, fried rice and the noodles were great. Love the drink menu rotation especially the traditional festival inspired/limited drinks. The dessert wasn’t its strongest suit but the mains definitely make up for it. Will keep coming back for sure. We had a very good experience overall with the “Feast with Us $66” Buffett and very attentive service and although we had some nice dishes there a couple that were ok only. Lovely restaurant in South Yarra - newly renovated at the time we went. We ordered the legit special fried rice for $19 each. Absolutely incredible, ordered:",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Oriental Teahouse Melbourne CBD: Love there's a whole plant based section! Would love to see more vegan options, enjoyed the dumplings and what a wonderful mocktail 💕 dessert is nice as well! A bit sad the noodles used egg noodles wasn't offered an alternative for the noodles so went with the dumplings. Great vibe and attentive waiters:) Everything about this place is great, the food, the staff, the ambiance 💯 We had a company team meeting lunch here. As the group is bigger than 8+, we had to order a feed me menu which we were okay with at the start. The options on the menu are slightly limited and you can't choose whatever you want on the list. We opted to go with 8 dishes and the option we have to select 2 items from the stream section and the deep fry, 3 items from the main and one dessert. None of us eat Asian dessert so we asked to swap it with something else and you can only pick from the stream section to replace dessert. You can't just choose dumplings and Dim Sim for all 8 dishes. Great experiencne at the Melbourne CBD location for some tasty dishes from a diverse menu including seafood, meats and vegetarian and other requirement options. My partner and I had dinner here recently. The service was wonderful! We had a lovely waiter (can't remember his name) who really took care of us by being attentive and polite. Every dish we had was full of flavour and fresh!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mediterraneo Charcoal Restaurant: Here is a rewritten version of your feedback: Super generous meat platter cooked on a flame grill. Excellent staff, good value. Booking recommended on weekends but a small group should be able to walk in on weeknights except Friday. Great friendly service, and food was delicious. Had the 600g T-bone with garlic and mushroom sauces, was cooked perfectly. The sauces were top notch. Special for the day was scallops with chorizo, very nice. Nice private dining area out the back. Absolutely amazing service,  fine dining experience, warm, intimate, friendly and delicious. I have been a coeliac for 14 years and this is some of the best gluten free food in Melbourne. As a coeliac, I felt completely safe, the staff were so accommodating and knowledgeable. Excellent service, delicious food and a huge selection of drinks. I would highly recommended to anyone, especially coeliacs!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Stamford Plaza Melbourne: Loved our 4 night stay here. Couple issues but the staff sorted things out and service was top notch. Even though parking not on site it’s super close. I recommend booking direct as Stamford add on their cut if they book for you. Rooms are awesome for business or pleasure and gym / pool / sauna is the best!! Awesome location and can’t wait to go back Great location, near some really cool bars and an amazing brioche place. I nearly cancelled my booking after reading reviews. Thankfully I didn’t! Fantastic location - nice end of town, short walk to retail centre, botanic gardens. Tram stop less than 1 min walk away. Friendly and helpful staff - allowed us early access to both rooms. We booked a 1 bedroom suite, so tonnes of room. The kitchenette  was very handy. Yes the bathroom is dated but really who cares? As long as it is clean and in working order. The negatives - surrounded by other buildings so room is dark, we never opened the curtain. no walk in shower. I used the gym showers on top floor instead. The tv didn’t work properly but after the first day, we never turned it on again because too busy with exploring Melbourne! The microwave also didn’t work. Loved the heated  pool and the spa especially at dawn. For $190 per night, this hotel was good value.  Will def book again! Great location.Hotel is quite dated and the rooms need an upgrade, especially the bathrooms. The bed was comfy though and the room was a good size. It was quiet so we slept well which you don’t always get in central locations. Breakfast was ok as well Pity that we had to pay extra for coffee made freshly and free from the machine considering coffee is part of the breakfast. ****Terrible experience, I do not recommend coming here - poor negligence and communication****",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sandown Regency: Great location and friendly accommodating  staff. The room had everything I needed ..Android  tv , nice bathroom clean towels and sheets ..  had a super comfy bed and got a great nughts sleep. Is reasonably priced accommodation and has the convenience of the restaurant on-site which had delicious authentic South Asian cuisine. :)) The rooms looked nothing like advertised on website, only sheets and a blanket and 1 pillow each. Walls were filthy, holes in them, there was door in bedroom that connected to room next door. No phone in room, air conditioning was so old that we were scared to turn it on.  Bathroom was filthy  sink was covered in some sort of sealant, shower was so low that I had to bend over backwards just to rinse my hair, tiles were off, or missing, silicone holding shower glass on by a thread. Service was not great, they didn't even have our booking in computer.  Definitely would not recommend. My recent stay at Sandown Regency Motor Inn Hotel was nothing short of a nightmare. Upon entering the room, I was greeted by a nauseating odor that seemed to emanate from the stained blanket on the bed. The table was littered with remnants of curry, indicating a lack of cleanliness and attention to detail by the housekeeping staff. Adding to the discomfort, the fridge in the room was broken and contained someone else’s clothes, which only added to the feeling of unhygienic conditions. Despite bringing these issues to the attention of the staff, there was little effort made to rectify the situation. It’s clear this Hotel fails to meet even the most basic standards of cleanliness and hospitality, and I would strongly advise against booking a stay here. Between the party in the function room going past midnight, the group of people partying on their balcony and the dog barking in one of the rooms, getting a good sleep was not going to happen here. They played dance music in function room till 11pm on Friday, Saturday, and Sunday, they didn't have WiFi, and they ran out of car parks.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Steakhouse Grill 66: My husband took us here for our anniversary and it did not disappoint. From the moment we walked in we were greeted by owner very approachable. Staff were friendly and super helpful with questions we had regarding choices. We had the crispy pork, pork ribs and scotch fillet all cooked to perfection. Would recommend all the above. Definitely made our occasion feel special. Thanks guys can’t wait to try more dishes next time! Amazing food in front of a beautiful view. They serve very good steaks.  Just finished our share of Tenderlojn, Rump, Augus Porterhouse, Butter and Herbs Calamari and Bay Scallop.  The steaks are medium rare and are so delicious without the sauce.  This is one the best steaks I have tried for a while and I found it here in Melbourne, Australia.  Worth a visit and if possible, I will come back again. The food here was maaaaad, as my husband would say, oh and it truly was. We literally inhaled the starters. We didn't even take a breath. Everything was perfect and full of flavour from starters to main to dessert. This restaurant is a keeper. Big thanks to Ronny; he looked after us, and he was great. Excellent steaks and drinks. This is our second time dining here. Outstanding service and excellent steak which leave us very happy experience. Will come back again ~",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Ginza Teppanyaki: For those who likes food entertainment, this could be a place for you. In terms of a food taste and flavour, it’s fine. The prawn was juicy and flavourful. The same for the beef and chicken. But the portion was too small for me. I was still hungry after the session ended. Not worth it!!!! We had lunch here, food was outstanding, melt in your mouth, we had set menu, tasty and filling salmon was done to perfection and lamb/beef the most tender I've had in a long time we couldn't have eaten anymore, calamari was done to perfection. I gave 4 for the atmosphere as we were the only ones here for lunch but the service was attentive, and I didn't even have to move a plate. Was thankful we were able to enjoy our tasty food calmly without the usual food throwing surprises. We had a few games at the end, which were fun. We ate here for dinner which started at 530pm on a Sunday. The food was amazing. We chose set 4, which cost $128pp. When Entertainment Steals the Quality",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Georgian Court Bed and Breakfast: The worst experience ever. The dirtiest unkempt rooms.  The window wouldn’t close due to plumbing. It was absolutely freezing. The dodgy quilt didn’t even fit on the bed… couldn’t sleep as we thought the ceiling would fall down on us. Lovely host who cooks everyone breakfast in the morning and remembers the guests names. Very disgusting hotel. I walked in to see dirty dishes at the entrance and a filthy carpet. In the room, bed sheets were dirty with a makeup stain on one of the pillows and hair through the bed. The bed was also very uncomfortable. The room smelt mouldy and musky, it gave me a headache. The shower took a very long time to warm up. And to top it off, you could hear everything in the rooms on either side of me… I had to leave instantly. I received no refund. A little ordinary. Breakfast disappointing compared to last time. Guests kept coming into the dining room with nothing opened.  It seems reasonably clean. Towels old in room. The ethnic group running the Hotel are Asian. A little like China here. This place seemed similar to some of the accom when I visited China 20 years ago. Avoid this place like the plague if you can; otherwise risk catching something just as grim as the plague.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hume Villa Motor Inn: Thank you so much to our welcoming and lovely wonderful hosts with a \"nothing is too much trouble' kindness when we stayed last week. Baggage was carried up to our room for us. Our room was spotless, lovely crisp linen and soft towels, comfortable bed, wonderfully hot shower, tea and coffee facilities in the room and a laundry to use. A short 5 minute walk to the train station too. We'd certainly recommend travellers stay here! Jen and Wen Staff were lovely, room was clean and comfy. Rates very reasonable. I had the deluxe spa room which was wonderful. Close to many shops and a shopping centre. Not far from the train station if your not driving. Will definitely stay again. Once again Hume Villa was a great place to stay. Wonderful staff who assisted me with information and heavy luggage. Nothing was a problem. Highly recommended. Yes, the rooms are older but we all slept well and comfortable. Room was a bit dated but super clean and had everything we needed. I appreciated the extra tea bags and milk jiggers. The customer service was excellent, Mark is very friendly and helpful. We will be back when we have another function in the area. Great little place to stay for a quick overnighter, had everything our family of 5 needed and super friendly hosts, would definitely recommend!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Burvale Hotel: We enjoyed a nice meal there last week, wanted to comment on the welcoming and helpful customer service we received from Mia and Ollie (?). The entrees came out quickly and hot. Mains followed quick after, (but it was a quiet night). Food was good, fairly priced and good serving sizes. Thanks again. We stayed at The Burvale for 5 nights. Staff were very friendly, Hotel was quiet. House cleaning was always on time and did a great job. Went to the Burvale for a rock gig on a Saturday night and it was a great night out.  It was set up with a great stage and dance floor, there was lots of room so it didn’t get too crowded. There was also plenty of seating to rest your feet during the breaks. The drinks were super cheap and the staff were very professional and friendly. I am very disappointed with my stay at this hotel. Shortly after I arrived around 3:00 pm, someone knocked on my door and then opened it. I was shocked and frightened that anyone could just enter my room like that. I went to the front desk to complain, and the receptionist suggested it might have been someone checking the fire alarm. However, they should have informed the staff that the room was occupied. I was so disappointed that I asked for a refund and leave. I hope they improve their measures to ensure the security and privacy of their guests. Long hair and they don't care ,",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bistro Thierry: This is such a good restaurant.  As always, the food was exceptional.  The oysters today were as good as I’ve ever been served.  My onion soup was exceptional too.  And, the eye fillet was perfectly cooked and presented.  We chose a few lovely wines from the excellent wine list too.  The service was fabulous throughout and we tipped accordingly.  I’ve had so many good experiences here over the years.  It’s simply one of the best places to dine out in Melbourne Bistro Thierry offers an excellent introduction to French cuisine, making it a delightful experience for first-timers. The duck liver is a standout dish, rich and flavorful, providing a true taste of French culinary artistry. The elegant ambiance and attentive service enhance the dining experience, making it memorable. Dinner for the 4 of us. Spectacular experience. The wine list is amazing. Suggest you plan ahead if you are not that familiar with French wine. The list is extensive! My son & I had the Duck (see photo). Amazing! Atmosphere is very nice. I love French Onion Soup the most. It’s not easy to have soup in Melbourne… Great food and wine. We had French onion soup, special duck with salad au fromage as side and creme bruele for desert. Other than salad which wasn't  good, everything else was so delicious. Staff are friendly and helpful with  a sense of humour. Overall authentic experience took us back to Paris",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Japanese Teppanyaki Inn: We recently dined at this restaurant. The food and service were fine, nothing was outstanding. The Teppanyaki ambiance was the main selling point. As seasoned enthusiasts of Japanese cuisine, we frequented this restaurant along with other top-tier Japanese establishments in years past. This restaurant was very popular and always bustling. However, during our recent visit, it was half empty. The ownership was changed. There are lots of new restaurants in the city, more competition. I have been going to this restaurant since 1989 and it is still my favourite in all of Melbourne. It is a classy, sophisticated venue, making you feel special as soon as you step through their door. There is a lovely room off to the side where you can enjoy pre or post dinner drinks and/or dessert. I just love this place. Its a hidden gem so do yourself a favour. Great food with peaceful environment. Great customer service. Delicious food, cooked with perfection. Wagyu steak, seafood was cooked perfectly. Although we were already full we tried green tea mouse which was mouth watering. I think our chef name was sun, great young guy. Thanks mate for great food. Will return when I travel Melbourne next time. I had the seafood set. Food is pretty authentic. Sauces taste home made. What an experience! Nestled in between some shops on Collins Street. The entire evening was very plush.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Beaumaris Bay Motel: Best shower I have ever had. Hot and amazing power. I didn't want to get out. Really comfy bed. Breakfast to your door  and on time exactly. An old motel but very cozy and clean rooms. Comfortable beds, quiet area and very close to beach and shops.  Anything you need is around. Affordable price and very good place to stay if you need to save on accommodation. What a cosy lovely motel. Yes, it isn't the ritz, it is old and out dated, but it was lovely and clean. My bed was very comfortable. All the staff I came across my stay, were all very helpful, kind, welcoming and very friendly. My son and I were made to feel very welcomed. We stayed in the family room abd had plenty of space. We felt safe and the location was great. Bus right outside the motel, close to beach, shops and train station. Would I stay here again, my word I would. Thank you Ange and Staff, for making my son and my holiday, a wonderful experience. We had an excellent experience here - very helpful and personable staff, breakfast was delicious and coffee was great. Thanks for a lovely stay. Stayed for 2 nights and I couldn't fault it, staff  are very easy layed back and kind, very old fashion which is missed.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Royce Hotel: We had a great dinner with our team here and the food was absolutely amazing. I was in contact with Laura as our event coordinator. She was very helpful and supportive to provide all the details and make the planning much smoother. Thanks for such a great service 👍 We stayed at The Royce in March for our wedding accomodation. We opted for The Loft suite and it was absolutely perfect to get ready the morning of the wedding, and my husband and I stayed for 2 nights after. The room was beautiful with gorgeous natural lighting and a very comfortable bed. We received the best service from the team at The Royce, especially Nate who went above and beyond to accomodate us and made our stay smooth and easy. We really loved staying at The Royce and hopefully will be able to stay again! Thanks to the team and to the wonderful Nate. Now this hotel is quality at every angle, from the moment you arrive, the fragrance is refreshing and the decor is flawless. The staff are so friendly and knowledgeable on their product. We live in walking distance from this hotel, so haven’t stayed in the rooms. If the quality of the bar and restaurant is the example, then staying here would be the ultimate choice. We sat in the lounge area along the windows and enjoyed a few drinks. The cocktails are excellent and the menu selection is superb. Such a relaxing vibe and well worth a visit. James & Miquel at the front desk showed outstanding service, from the moment we arrived to the moment we left. We took advantage of the valet parking and our car was ready when requested, we were offered free water, and an umbrella when it was raining. James even helped me with our invoice at the end to ensure all charges were correct. We loved our stay at this beautifully refurbished hotel. The room was very comfortable and overlooked the Shrine. Dinner in the Showroom Bar was delicious. Overall a delightful stay to commence our retirement.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Glenferrie Hotel: We had our sons 21st birthday at the Glenferrie Hotel and could not have asked for more. Drayson and the team were awesome. Great service and professionalism. Food was amazing and the beer garden was the perfect spot for our celebrations. Definitely recommend. The Glenferrie hotel was a pleasure to stay at. The rooms, restaurant and bar were very clean and well kept. The check in was very easy and the lady who checked us in was lovely. The beds were comfortable and they provided extra blankets for warmth, though the room was well heated which was fantastic so we didn’t really need them anyways! The shower pressure was very good (a must), however there were no supportive bars around the bath so it may not be ideal for older people. Overall, a fantastic stay, we would recommend it to others in a heartbeat. Just enjoyed a great squid and chips meal in the main bar at the Glenferrie Hotel. Best Seafood Marinara we’ve had for miles, lovely food and able to accommodate meal variations. Lovely atmosphere for families or unbothered couples. Great young and attentive staff. Love the keep of the original hotel style. 100% coming here again. Just wish I lived closer to this gorgeous and elegant old hotel. Huge mirrors, Chesterfield couches, antique vibe but also with a comfortably contemporary feel. A large hotel offering several spaces that would cater for anything from a romantic date, families with children, or large groups. The menu had a good number of tempting options, and the barramundi salad was delicious. Atmosphere is perfect for romantic dates or larger groups. Staff were friendly and efficient. One of Hawthorn's - and Melbourne's -  beautiful watering holes. Absolutely recommend a visit.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Club Laverton: Very lovely staff, first time in Melbourne so needed some help getting to places and the staff at the front was very helpful. Rooms very spacious and clean aswell as comfy beds, near a main road but noise was not an issue. Had a delicious meal in the bistro  Would definitely come back here. Just off the highway. Good location. Rooms are very clean and well presented. Staff is friendly. Nice clean room, no ventilation in bathrooms. Love this place allways stay here when in melbourne quick hop onto the freeway if you want to drive anywhere other wise 15 min walk to train station and the foods not bad either Food good and decent portions and at reasonable price. Location handy as just off freeway and good location",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Flower Drum Restaurant Melbourne: What an amazing restaurant. I've been wanting to go there for years and it didn't let me down. Food was good but everything is over priced. You can get similar quality in another restaurant in Chinatown and cheaper.  Most of the dishes are very small so you need to order double serve. The customer service was fantastic, especially Louis , he’s very friendly, caring and helpful. The chefs might need to try not to yell as customers can hear from the dining area 😅 A beautiful venue for the most delicious food! Never had dumplings that perfect & melt in your mouth! Peking duck skin so crispy and pancakes made table side. Service was impeccable. Couldn’t fault it, have told everyone it’s a Melbourne must! There is a very good reason why Flower Drum is a Melbourne institution. Treated myself to an 'Out of This World' dining experience last night at Melbourne’s ‘Flower Drum’ – This is a high end traditional Cantonese restaurant that has stood the test of time. Why? Consistently meticulously prepped Cantonese food that’s wheeled out on trolleys, and my Peking duck was prepared at the table with a few quick manoeuvres by the expert waiter. It’s practically performance art as you dine - not bad. Food was full of flavour and tasty, and a work of art. The Flower Drum’s mantra is a dedicated service that combines great food, fine wine, impeccable service for a unique dining experience each and every time – and it delivers in spades. This is not your everyday restaurant, but a special occasion spot to impress the family or out-of-town guests or simply treat yourself. Very highly recommended 👏👍😊",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Loud Mouth: Came today for a bit of a Sunday sesh ! The drinks were cold and cheap , the staff were friendly , the music fun - but the food subpar at best . We got the calamari and the polenta chips . The calamari was cold but tasted ok , but the polenta chips were the saddest polenta chips I’ve ever had , they were dry, skinny  and flavourless. Usually they’re fluffy on the inside and crunchy on the outside . The sauce needs some work too . Great venue for a catch up, upstairs has informal seating where you can  have lunch on a couch with a group of friends in your own little corner! Great flavours and prepare to get your fingers sticky with their yummy buffalo wings! Best place to party in st kilda, best Guinness I’ve seen so far in the country, good prices and unbelievable music. English guy behind the bar called Ash was odd but welcoming. Great bar! The vibe is always great. The food is bangin and they recently installed Guinness... How good! Love what they've done to improve on the ol Big Mouth. Best place for a Sunday sesh and a perfect pint of Guinness. Love that the bottom floor has a Dj and the top has live music - can choose one or the other or float between depending on the vibe you’re after.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bedi's Indian Restaurant: Our experience at the restaurant was great. It looked like a cricket museum with all the souvenirs collected over the years. Went there to taste best butter chicken with my favourite man in a cozy restaurant met a warm restaurant owner Sunset is coming ... it was very vibrant once ... there's a bit of remnant left, but now, everything is just \"it was once\" Cheap and cheerful, the friendly owner was too happy to stop for a chat. Colleagues introduced me to this place as part of the Friday lunch ritual. From the small menu, most of us chose the butter chicken with rice and roti. The meals arrived shortly after we placed the order. Best garlic naan i have had in Melbourne.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Matthew Flinders Hotel: Checked into the room and it was nice and clean. Service was good until my final night. Was running late and wanted to get something for dinner. All around the hotel there are signs stating meals  from 11am until 9pm. Went to the restaurant to see them cleaning up and asked if they still open as there were no menus around and was told no we are closed………as I am from country Victoria and come to Melbourne for business often, I thought I found a hreat place to stay until this. A fantastic spot for celebrating birthdays or simply enjoying regular days, boasting delicious food and a delightful atmosphere. Additionally, it features an arcade suitable for both children and adults, and ample parking space, making it highly recommended. 💖😍😍 I came here on a Thursday at lunchtime with the kids for a quick lunch while in the area. I love a pub/hotel meal (nothing fancy just simple) and having driven past a few times I figured today’s the day to give it a go. It's clear that an Endeavour pub is a great place to get a good feed at good prices with friendly people. Got a toddler who likes chippies? An extra scoop from the chef. Having a share plate? No worries, you have clean plates each. And the Buffalo wings are superb! We came to the Matthew Flinders Hotel to watch a Muay Thai Australia kickboxing competition.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Firehouse: I enjoyed my experience here. Interesting setting, great beer garden out back and tasty, well presented Anna generous food. Great service. Recommend! The smell of smoked brisket hits you as soon as you open the door! It feels like you're having dinner at a friends house with all the little rooms. The food is absolutely divine! They cater from veg to carnivore! Great cocktail & wine selection. We have come here a few times now and we love that it's the only one pub in the area that gives us the \"London pub feel\", where we are from. Drinks are great, atmosphere is good, staff are also very very good. But food is not reasonable at all I'm afraid. They charge you $30 for chicken drumstick and 2 thin pieces of briskets (photo does not do justice of what was on the plate).I don't think it's ok at all. It's a child's plate. I was in awe when I saw it. Also avocado has been in the open for way too long  and has completely lost its freshness, colour and tasted like it was two days old. Won't risk it again unfortunately. Great place which caters for everyone! Order delivery food came fresh and hot. Had the double cheese burger which was very tasty. Fries were just fries the popcorn chicken bites were a little bit salty but still good. Would defs try more of their menu another time.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Curry Leaf Cafe - Indian Restaurant: This place definitely is a gem in the neighbourhood that offers excellent Indian dishes without any doubt. Malai prawns - succulent prawns slow cooked in a cashew & coconut cream sauce. Alu gobhi mutter - cauliflower, potato & peas in tomato curry. Bengali jalfrezie - tomatoes, red & green bell peppers, onion & fresh green chilly tossed in a seductively delicious curry. it's been quite a few weeks since we dined at Curry Leaf, and the lovely interaction/conversation we had with the owners are still lingering in my mind, along with the yummy food we had.  There were 4 of us and each ordered a different menu item.  All the dishes were tasty and yes, I would come back again for another taste of their eclectic menu. Reservations are a must as the place is small with beautiful ambience further enhanced by the graciousness of the warm conversations had with the owners! Confirmed booking ( both online and by phone) for 6 people at 6pm. Turned up at 6pm to find the restaurant closed with “Closed for Maintenance “ sign on door! No phone call. No text. No email. No communication. Total lack of courtesy and consideration for customers. Such arrogance. Get yourself the one of the best Indian food from Curry Leaf Cafe located in Elwood ‼️ Curry leaf cafe is a hidden gem! Great service and chilled atmosphere, the food is sublime, succulent crispy paneer, there is so many rice options and the mango lassi is to die for! I tried the Lycheetini and loved it. Please support small business, high quality innovative indian cuisine!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Mill Restaurant: The service and hospitality at the restaurant was great. The food was really tasty. I had the Lamb Ragu pasta. Highly recommended. We celebrated a few birthdays when we were there, and the team at the Mill gave the birthday each birthday girl/boy a shot. Will go back there next time we’re at Hardware lane. Took 45 minutes to bring 4 margheritas. They arrived completly burnt, tasteless. You should never come here expecting to eat even mediocre food. My wife and I came for dinner, great wine and great seafood pasta. It would be better if the distance between tables could be larger. After all, I weigh 100KG. After I fully enjoyed the food, I found it a little difficult to move. Super rustic, intimate, and dramatic interior with a great range of beers and wines on offer for a quiet 3pm bevey. Rustic Ambiance with an eclectic mix of 1920s stencils.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Fedele's - Glen Waverley, Vic: Been here numerous times and the quality and service has always been consistently good. Really enjoyed my seared salmon. Would highly recommend! Excellent atmosphere, service and food. We were pleased with the quality of the antipasto entree along with the hand made gnocchi and ravioli all of which were delicious About 10 tables only due to covid + function room. Food took some time to be served. Eye fillet steak was cooked well. Latte was good. Happy to come back again. A slightly up market Italian restaurant. Food was excellent and ambiance was very pleasant. Good service without being intrusive. BYO wine but they also have an extensive wine list. I had the Tortellini which was excellent, a good sized serving at reasonable price.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Marmara: Marmara was a really unique experience compared to some other restaurants we have been too, service was lovely. The young man and woman that served us were very sweet. The food tasted very nice, I’m kind of shocked by reviews saying it doesn’t taste good because it does and this is coming from Turks. After dinner we also were offered Turkish tea. The only thing I would pick on is portion sizes are much smaller then usual, so make sure to ordered multiple things. but taste really makes up for it. If you come here make sure to order entrees before your main to ensure you’re totally full. First time dining at Marmara, and we had a great experience. The food was amazing, the service was up to the mark and loved the outdoor seating arrangements. The staff was courteous as they turned on the heater when they saw the weather cooling down. The service was quick and efficient. we went for the valentine's banquet. food is quite impressive, but need a pretty long waiting period. some dishes were little bit too salty. My friend and I decided to try Marmara’s Special Banquet ($65pp), which we booked through EatClub, offering a great discount of 40%.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Aangan Footscray: I recently had the pleasure of dining at Aangan, and it was an exceptional experience from start to finish. The food was absolutely divine, with each dish prepared to perfection. The menu offers a delightful variety of options, ensuring that there's something for everyone. I particularly enjoyed the [specific dish], which was bursting with flavor and beautifully presented. First night landing in Melbourne and was craving some heartwarming Indian food. Aangan hit the spot in every way. The food was absolutely delicious! Food was great. We ordered too much 😭 Okay ! I like their gajar halwa top item. We had the mix grill platter which was amazingly delicious. Tikka and tandoori was the star attraction in the platter along with their two wonderful dips, fish and seek kebab was okey not the best. But tikka and tandoori chicken was top notch. Highly recommend the those two items also the bread was good (garlic naan)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "One Thai Restaurant: Food is ok,  but not authentic thai. I requested for prik nam pla, which is a standard sauce for authentic restaurants. The staff member had no idea what I was talking about and I had to explain to her what it was. She eventually gave me crushed chilis, which is different. The pad ga pow also had ingredients you wouldn’t normally find in a traditional one. Nice service. Their entree menus are especially good. I could taste them made from scratch. Curry's good too. my kids love them and devoured with vegetables and all without complaint. It is very hard to make them eat any kind of vegs. So it is huge for us. Definitely  come again. Bottom right is the fish from One Thai. Definitely the highlight of Chinese new year dinner. Appreciated the service from the staff for packing the fish with my own plate! Ok Australian-style Thai food. Great service and welcoming atmosphere. The staff are friendly and attentive. The food here is very sweet and mild. Not authentic thai food, but more friendly to western palates. The price is not cheap but reasonable to the food quality. This place is fantastic!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Wot A Kebab Mooroolbark: Just ordered HSP x 2. They were busy and must have been short staffed, but i sat in my car for 10 minutes and then went back inside only to see 1 of my orders sitting open on the bench getting cold whilst the other was waiting for the meat to be fried on the hot plate, the heat in the chips slowly dissipating into the shop. After what felt like an eternity they closed the container because clearly there was no more heat to save from the chips...and placed the container into a brown bag. Everything was cold and they had left out 1 of the 2 sauces my son ordered .  Originally my son asked me why I didn't want to go there, and I said it was because they have stuffed up my last 3 orders out of 5. Once upon a time this place was fast and efficient. I wont go back again. Even when I called the previous time to complain about the order that was stuffed up yet again, the chap I was speaking with had the same level of care and empathy as a dead ant hanging onto the sole of a mud encrusted shoe. Great tasting kebabs and their chips are honestly 10/10. Shame that their service doesnt match the food ... So disappointed, so expensive. I ordered off the menu and couldn’t figure out why it was so expensive, the receipt is confusing then I realised that I was over charged, went to the counter and was told prices have gone up, I need to look online at the prices. This is not good enough I ordered from the instore menu and I should be charged as per advertised prices, but they refused to give me a refund. Never ever coming back again. The kebabs are an extremely low quality. bread was stale too. This has happened a few times now. Called up to get a refund. Spoke with Hadyn the manager. He seemed like a really nice guy and did what he could to help but couldn’t do or process any refunds due his owners not being there and also not speaking English. Absolutely rubbish!! Disgusting service and even worse food!!!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Copacabana International: The food and drinks are good. There were 8 meats, 1. chicken wings Good amount of shenanigans, the floor show is quite the spectacle. Alot more saucy and flavourful than the meats circulating on the sticks. The salad bar's not half bad... One of my favourite places for a night out in Melbourne This place is so much fun!! I came here on a saturday night, had dinner with my partner. Meat was really good, from the Lamb to pork and more and more! Buffet was ok, simple choices but Still good. After dinner we have enjoyed the show!! Wait staff was amazing as well! Thank you! Lovely food and good entertainment. The dance instructor was very funny. Please renew his visa.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Indochine Vietnamese Restaurant: There were lots of comments saying the place is too busy and packed, we came in a weekend at 12pm and it was half empty, didn’t need to go through the queues which was great. Worst customer service I have ever seen. My favourite Vietnamese restaurant in Melbourne and in Australia. 😋👌 Went here yesterday, crowded, so took ages for the waiter to just take our order, but the food came relatively fast. Tom yum pho was good, the beef pho according to my daughter is not beefy so she doesn’t quite like it, the prawn spring roll was delicious! The drinks lemon soda very bubbly! The 3 color drink was good They have good Vietnamese noodle soup and the portion is really big! Had tried their signature rare beef noodle and beef brisket noodles- the beef is nice and tender even good for kids.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Encore Pizza Footscray: A bit salty, didnt like the base much. Prefer pizzas that have some sauce on top. Chips taste fine though I was passing by this corner, only because I got closer I could see that it was pizza, excellent product, recommended for pizza lovers to visit. **Dissapoonted** Pleasantly surprised by encore pizza. They offer all the usual favourites when it comes to pizza topping combinations as well as some unique offerings (refer to picture of menu). I tried a large supreme pizza which was loaded full of toppings and had more than your standard amount of cheese, as well as a serve of spaghetti bolognese, pasta was average although the bolognese sauce was quite good in my opinion, though the serving size was on the small side for the price( serving size good for 1 person only, too small to split between 2 people) They are open till late( 1am) even during the week, good for those late night cravings. Not wholly authentic Italian cuisine but worth a try nonetheless... So good! Best loaded fries I’ve ever had, and the pizzas were amazing!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "India House Restaurant: If your looking for that authentic tandoori taste with your Indian, this is the place for you. This restaurant was a culinary marvel that I had the pleasure of dining at. The tastes of the chicken curry and butter chicken were simply unmatched, exceeding all expectations. Excellent service and a warm atmosphere enhanced the entire eating experience in addition to the delicious meal. The personnel added a personal touch to the already enjoyable atmosphere by going above and beyond to make sure that the stay was unforgettable. It is a must-visit if you're in Melbourne and in the mood for some real Indian food. It has definitely raised the bar for my eating experiences in the city, and I can't wait to go back for more of the chef's delectable creations. Seriously the worst Indian food. The butter chicken was awfully sweet! The rice was microwaved and all other dishes tasted like they’d come out of a mass produced factory process. Amazing food and service, made us feel so welcome! The fish curry was spiced to perfection! Great atmosphere and vibes. Great atmosphere and tremendous service staff. Kind and extremely accommodating, and the food was UNREAL - especially the butter chicken! Will definitely be coming back!!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sun Wah: This place reminded us of Aja at Albert Park (which is now closed). Really great Asian fusion food. Solid but limited drinks list , very good service....and the food is fantastic!! Great pan fried dumplings, spring rolls and some of the best wagyu beef fillet asian style we have ever had....my only slight disappointment was my peking duck didnt have crispy skin....but the flavours were fantastic  and we will definitely be coming back. We went for our wedding anniversary and had the 8 courses. I have to say the service was impeccable, very attentive and friendly. The food was yummy, some courses better than others bit that's personal preference. We really enjoyed our night, everything was amazing. Thank you Gorgeous food. We had a red ballon voucher which was the Asian fusion tapas and cocktails (which were divine).  Great service, yummy food and would defo go back Overall this is a great Asian fusion restaurant. Service was fantastic, accidentally booked the incorrect night and they managed to squeeze us in during peak hour. Lovely atmosphere, although when ordering drinks the staff member kept stating he was stressed due to lack of staff but have to say the wait staff were excellent. Paid $20 each for our cocktails and they were awful, food was good, overall an enjoyable experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Crest on Barkly: We stayed 2 nights to celebrate my birthday. Arrived in the evening and the staff member was very helpful at finding us a room that we liked. The room was spacious and clean. Any problems we had were sorted out straight away. We felt safe, comfortable and the hotel has secure undercover parking. A staff member was very helpful when we needed to heat some food. Would definitely come back again. Close to public transport. Thank you! :) ⭐☆☆☆☆ Myself and my partner stayed here for one night and unfortunately we had a terrible experience. On check in we were informed that we had been upgraded to an alternative room. At 01.15am a man walked into our bedroom and gave us both an awful fright. It was a traumatic experience to find out that another gentleman had been checked into our room at this hour. The room itself was very basic and the place needs an upgrade. At 7.20 the same person whom checked us in then came knocking on our door to find out who was in the room even though he checked us into that room. We were advised he would speak to the manger about that this and see what he could. On check out he openly apologised and admitted it was his fault as he did not update the system yesterday on our arrival for the night staff. All we were offered was a cold breakfast which we kindly refused while his colleague behind the desk sniggered and laughed at the situation. Absolutely disgraceful behaviour and completely unprofessional. I would not return here and would like to reach out to the manager for a formal complaint We stayed our night in a room with queen bed and 2 single bed. When I book I simply told them what I need for my children as they have allergic reactions. Though there is no microwave we still find our stay comfortable plus we had complimentary parking. Thank you to staff… I had an extremely disappointing experience, i booked to stay at their other location - Crest on Park in St Kilda. When I arrived, there was a sign directing me to this location instead for check-in—a 20-minute walk each way with luggage. This crucial detail was not advertised anywhere, which was incredibly frustrating.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Araliya Restaurant: Biggest gripe is portion sizes. We were a party of 3 and most dishes were probably enough for 2 but the person taking our order did encourage us to order an extra hopper as there were only 2. That was really nice with the duck it was served with. Tamarind fish was fresh and tasty although I personally found the sauce too peppery for my liking. We had dinner at this Sri Lankan restaurant tonight and tried the black pork curry, lamb curry, and deviled prawns with steamed white basmati rice. For dessert, we had Wattilappam, which was amazing. The food was good, and the prawns were particularly juicy. However, it didn't quite taste like authentic Sri Lankan cuisine. The twist they added to the traditional dishes works well to cater to a broader audience. The service was alright, but we found the cost to be on the expensive side, especially considering the small portion sizes. The ambiance was good too, adding to the overall dining experience. Absolutely fantastic food. Had the 8 course banquet and just about rolled out the door, everything tasted fantastic! I would eat an egg hopper every day of my life if I could. Cocktails were excellent (Bees Knees No. 2 is a winner), staff were lovely and attentive. My son wanted to write his review. Beautiful meal, fresh curry leaves, couldn’t have asked for more. Overall great value for a gourmet meal. Would recommend to any fun friend.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sopranos on Southbank: After a long & tedious day, 2 hr drive in terrible weather, was really craving Thai, but staying directly next door to Sopranos opted to just \"get a pizza\". First some facts - all menu items have gone up between 25-33% since the same time last year. The pizzas were once great , but the quality has noticeably declined over the past year or two to just very average. Additionally, the last two times I've picked up my pizza order, the staff forgot about me, leaving my food to go cold. When I brought this to a staff member's attention, instead of apologising, they simply said they were busy. Terrible experience and food. Just awful pizza!! I don’t usually like to write negative reviews but I feel the need to warn others.  The “Hawaiian” pizza is literally a pile of ham slices and a couple pineapple with barely any cheese. We couldn’t even eat it, it was that gross. The last time I checked, pizza is supposed to have cheese on it? I ordered a Hawaiian not “just a pile of ham please, hold the cheese.” Lol Really disappointed with our meal - ordered 2 x pasta meals and it tasted nowhere near like a pasta would from the first bite we took. The flavour, pasta and texture was just off. Normally don’t leave reviews, however won’t be coming back here.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tsindos: An absolute pleasure to dine here with friends on a Thursday evening. Place was packed, so recommend you make a booking. We were seated downstairs and it seemed like there was a private function going on upstairs. We chose the banquet priced at $70 per person, and we were not disappointed. We even took home two containers of leftovers! Food was delicious, from the hot, salty saganaki, to the dips, bread, olives, octopus and the amazing meat and seafood platter. I thought I had died and gone to heaven. One of the best places I have ever had in Melbourne even though next door there is a another Greek restaurant this gives a very grounded and homie vibe just looking from the entrance, and it did not disappoint at the end of the meal. I would recommend a grilled chicken and octopus best stuffed vegetables with rice. Potatoes are just amazing as well. Will come back for sure! Sensational Greek restaurant with authentic Greek food, Greek staff and a wonderful ambience. We have been a few times and recently had the banquet. Well worth $70 per head. The seafood and meat platter were heaps plus saganaki, dips, salad, octopus and yummy loukamades. Can’t wait to go back! What a  great Greek restaurant,  very very busy,  so you have to book or your maybe missed a good meal. The menu has all the traditional Greek dishes and more.  Very  generous portions and super friendly and helpful staff. Definitely coming back next time when we in Melbourne. We came here twice during our stay in Melbourne and both times were fabulous. On the first night we had the dips then the feta in a pan followed by Moussaka- great service from Georgina. The lemon potatoes were unbelievable. Last night we were late at the tennis but arrived just before 9. No problem - we shared the giros with a Greek Salad and Cypriot potatoes which were again delicious. First night we had the Greek red and last night Mythos. Both great evenings. Great place which brings back happy memories of Greece.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tandoori Times: Authentic Indian feast in Melbourne @tandooritimesyarraville is where you can find the most tastiest Indian food over desi cocktails and irresistible Indian desserts/sweets. Love the goat masala, and the tandoori chicken is tasty too. Ordered Kashmiri naan and add another butter garlic naan, both are highly recommended. Also ordered Kulfi, the pistachio is great and paan flavour is refreshing and very special. This is a very good place to eat at. Food is very authentic with just the right amount of heat in each dish. Service was good and timely. if you are going early in the evening probably no need to book but when we left (group of 7) the place was full, and that was on a Tuesday night and take aways where regularly heading out the door as well. if your in the area and enjoy Indian this place wont disappoint. This is mine and my family's favourite Indian restaurant in Melbourne's west. This place needs a 6th star for service. The staff here are always lovely.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Meadow Inn Hotel-Motel: We recently hosted our daughter's 6th birthday party at the Meadow Inn Hotel-Motel, and it was an absolutely delightful experience from start to finish. The hotel's staff went above and beyond to make our celebration special and memorable. I recently had the pleasure of dining at the Meadow Inn bistro that exceeded all expectations in both service and quality. From the moment I walked in, Shay greeted me warmly, creating a welcoming atmosphere. Throughout the meal, their attentiveness and friendliness made the experience truly enjoyable. Had dinner on Mother’s Day and tonight’s kids animal party. Both time were great! We enjoyed the food and the atmosphere. Kid loves the art works activities. Staffs were friendly and helpful. (Thank you Josephine). Recommended to everyone! Thank you to the lovely team on  Monday night 17.06.24. Your staff member Josephine is amazing. Josephine in the bistro is very caring, helpful and has wonderful customer service. Jo is the reason that we have been coming  here every Wednesday night for many years due to her constant courtesy, welcoming smile and attention. Thank you Jo",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Presto Pizza: Great service by the young lady up front who was pleasant and helpful. Then, the pizza chef is a genius, finally found a place that cooks the food with love not chopsticks! the ingredients all clearly high quality and fresh with the ratios perfect ... seriously my pizza tonight is a masterpiece 😍 🙌  red devil with rocket = get on it! Disappointed with the inedible pizzas from this place. The bases were undercooked, and there was still stretchy raw dough under the toppings which is not pleasant. The pizza sauce, cheese and meats ALL lacked flavour probably due to cheap/bad quality toppings. Would definitely not recommend to anyone. I am leaving a review  in the hope that it saves  someone from an anaphylactic reaction. And to educate  those who handle food the importance of knowing  the ingredients. Tried Presto for the first time tonight after being disappointed with other local pizza shops. A good pizza place. Very hospitable and the price is great. Generous amount of toppings.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Desi Dhaba: We recently visited Desi Dhaba in Melbourne, and it was an exceptional experience that transported us straight to the heart of India. This restaurant truly stands out for its authenticity, with dishes that are bursting with traditional flavors and spices. Yummy and affordable Indian food in Melbourne, @desidhaba_melbourne on Flinders is a great spot to indulge in tasty curries, rice, naan and even cocktails too. 😋🥙 Wow !!! Authentic Punjabi food. Loved it. Love the flavours, the variety and the service too. The ambience is very warm and desi. It’s sure to remind you back to Punjab tradition foods. We booked the place for 20-25 people for an office dinner party. The host was not ready and made arrangements after we asked about it. The food was fine, staff was fine. Ambience wise nothing too fancy just a basic setup. I haven’t heard great reviews about it but food was not that bad. I liked the snacks more than the main course.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Piyada Thai Macleod: I booked for 15 people ten days out. We arrived and 9 of us ordered Banquet B. 1 hour and 42 minutes after we ordered, the first of the soups arrived. Not all of them. 2 hours and 22 minutes after we ordered the entrees turned up for some of us and again not for all of us. Other diners arrived, ordered, ate and left. 5 Banquet Bs turned out to be five soups and two mains with enough rice for two people. Really? Even an inexperienced waitress would question the lack of food for five people. Waitress then said we didn’t order Banquets but when we complained about the service the excuse was that they were too busy and that we ordered a lot of Banquets. Over three hours in, table after table that arrived after us were fed and left with us still waiting. Never ever going back. One job to do and that’s feed customers and they couldn’t even do that. A possible $600 - $700 table sitting turned out to be a lot less because we didn’t get food. Lots of excuses were given, no responsibility taken. Great food.Great customer service with very reasonable prices. Would definitely go again. Good ambiance and service. My original choice was closed for the public holiday so I ended up phoning Piyada Thai and I heard such a ruckus at the other end of the line I thought this place must be good as it’s clearly packed to the rafters. The best Thai food & value for money in Melbourne. You can have Aussie Thai or if you want authentic Thai (70% less sugar) but a little more spicy that’s also excellent. Fantastic service & many dishes are minimum 9 plus out of 10 👍👍",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pelican Sands Bed & Breakfast: What a lovely place to stay. Thank you to the lovely couple who run the place. the breakfast was fabulous. Eventhough it is designed for couples who are having a romantic getaway I managed to stay in this place with my three little daughters as you can see in the pic. They were very welcoming n their service  was top notch. The room was nice and Clean With comfy beds. Girls wanna say thank you again for your lovely service too. And Thank you to Suzanne and Mick. Hope your places will be succeful. Cheers Quaint B&B, with very attentive and helpful owners. Booked this place for my parents, was looking forward to them having a nice weekend away together. It was unfortunate hearing back that the house was unbearably cold..and the hospitality could have been a bit better. My parents remarks were \" felt like we were renting a room in a house\" they did mention the house and great location, butba little disappointing. I bought a visit as a gift to my parents, they decided to leave the B&B. The hosts would not allow them to adjust temperature on the air con unit, and the bed was squeaky and uncomfortable. In any case they had to leave and go elsewhere they didnt feel comfortable staying there. What a beautiful location, the views are unreal, and you can see the sunset over the bay from the balcony upstairs. Modern rooms, uncluttered and clean, and the owners are very friendly. Photos on the website don't do it justice, it's quite nice.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Little Thai Cafe: Usually good tasty food, today they cheaped out though and only gave a half portion. I ask for meals with no cabbage and no onion so maybe they didn't bother adding to make up for it. Really disappointing as it would be obvious to whoever put it in the containers that something is wrong, they just didn't care. Have been going to this restaurant for takeaway for years. Best Thai in the area..hadn't been for a little while ...but ordered tonight. I could not believe how small the serving was. Ordered Red Curry Chicken. Literally only 5 pieces of chicken in the serve. The serve was 30% the size of what I had always received....? Love the food here!  Love the prawn Penang curry with coconut rice. We come every Thursday. Friendly ladies. Just the music is a bit sus. 😳 We have used this restaurant many times in the past and has been a favourite place to order a treat at the weekend . Unfortunately tonight’s meal fell way short of our expectations. The chicken dish though tasty was incredibly small. The Pad Thai was flavourless. The pork belly and broccolini was tasty. Such a shame as  we probably won’t order from here again. Tasty authentic Thai food. Great service, friendly staff. Discount with cash. Open until 10pm which is later than most restaurants in the area.",
        "Additional_Info": ""
    }
]