[
    {
        "Place_Reviews": "Adina Apartment Hotel Perth Barrack Plaza: Staff and location excellent. The apartments were good. There were a few concerns. There were 2 lifts. They made a loud clanging noise. I wondered if there was a safety issue. ? It was worrying. In the apartment some carpet was frayed in 2 places especially in entry to the bathroom. Could be a tripping hazard. The other matter was the tiles in the bathroom were very dirty/mouldy at floor level and around the bottom of the shower. Everything else was excellent. We booked a premium 2 bedroom apartment. Book a 2 bedroom apartment and it was quite spacious. Staff particularly Ivy was very friendly and helpful upon check-in. The location is good, the room was decent but the lounge is incredibly uncomfortable and on the last night that I was there the air conditioner stopped turning on.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tradewinds Hotel and Suites: The hotel was a great location for our needs, very central and the staff were very helpful and friendly. The room was comfortable however we had issues with the television remote not working on several occasions and the staff reset the TV, replaced batteries but we still couldn't turn down the volume. There is only one mirror which was an issue with two females sharing the room. We booked a table for nine people for a family gathering and even though I selected an inside table, when we arrived at 7pm on a chilly evening our table had been organised to be outside. The staff were very obliging and quickly reorganised an inside table. The meal was very nice although had quite a wait for it to arrive. Fantastic hotel. Great location, delicious food, super friendly and helpful staff.  Room was spacious and very comfortable with a great kitchen area. Everything was spotlessly clean. We loved the pool, roof deck and gym area too. Thanks for a fantastic stay. We had an amazing stay at Tradewinds. The room was comfortable and clean. The staff were super friendly and helpful. We went for drinks at the bar, we had great recommendations and cocktails were made with style. Awesome location with views of the Swan River.  Who ever cooks the steaks and burgers is killing it.  It's the first time I've never had a complaint about the food lol. Dined in your restaurant during the week. With the lovely grace and subash hosting us. They went the extra mile looking after us , and recommended the rib eye steak and also paired a beautiful glass of red wine . We were  very happy with their choice for us we really enjoyed it. They were very professional and knowledgeable and made our night a right giggle . Thanks very much we will definitely be back to enjoy more of your specials. Many thanks mark.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bluewater Bistro: Went out for a cheeky Wednesday treat... this place is very classy, we got there just before the sun set. 🥂 We had chicken with tarragon and mushroom sauce and steak all of it was cooked to perfection 👌 the side dish of 🥕 and 🎃 was also delicious.... We stopped in after visiting the makers market that was on and were not disappointed. Food was very tasty and well presented. We ordered a few dishes to share. The view was amazing and service was very attentive. The food was good and the venue is excellent. Good value and nice place for a day out with lots of convenient parking. Only downside was that one of the staff took away the broccoli before I had finished, I wish they had asked first. I guess they were just in a rush to clear up. Great food, very relaxing atmosphere out on the patio area for lunch. Friendly staff and also nice view of the water. The roast lamb rump and grilled  broccoli were perfect! BWG Steakhouse is easily one of our go-to favourite restaurants. We love their breakfasts, we love their lunch, and we love their dinner. They have some of the best steaks in Perth, which is good news as they are a steak house. The head chef is on top of his game, and we have always been impressed with his menu. We have also attended several functions and events at BWG, in beautiful rooms with character, and a stunning view of the river. We could not recommend this place more!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Quality Resort Sorrento Beach: Currently staying here Great spot, had a beach view Spa room and could not have wanted more. Great swimming beach right across the road, short walk to Hillarys. Very helpful staff. We also used the airport shuttle and would recommend, as well as took the staff advice and did a day trip to Rottnest Island, which turned out to be the highlight of our holiday. When we booked directly through them we got a free continental breakfast included with our stay. The Knights family thoroughly enjoyed our 1st anniversary here. Breakfast was wonderful and the service was friendly and memorable. We loved having a bbq in the pool area as the sun set and the room was lovely and clean. We’ll be back next year❣️ Beautiful lunch. Generous portions and even a congratulatory champagne for our anniversary. Nice place to stay, great location, beach across the road and only 20mins from city.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Terrace Hotel: This review is about The Terrace Hotel as a food and drinks location rather than a hotel, and the summary is, it's fantastic! Run don’t walk to this amazing and dedicated bottomless brunch. Zac and Simon the owner where beyond exceptional being accomodating to specific drink requirements and being friendly. The most amazing people to be around for a bottomless brunch, don’t waste your time with any other bottomless brunch, this one will take care of your wants and needs as well as ensuring everyone is enjoying themselves, what more could you ask for, ended up tipping them as myself and my groups of friends where blown away by the care from the staff and the customer service, this is Perth’s best and only bottomless brunch. These people truly care about service and your happiness. Zach was awesome at our bottomless brunch! He kept our drinks filled, gave great menu tips, and made sure we had everything we needed without us even asking. His friendly vibe and great service really made our brunch special. Jack service was amazing, the bottomless brunch was to die for. But jack stole the show he was polite and helpful and really made it one to remember. Don’t waste your time on other bottomless brunches. Jack was the most amazing barman we have ever experienced.  He was so friendly and lovely, and had such a bubbly personality xxx 🥂🍷",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Port Mill B&B: Can be noisy with Tapas bar downstairs (Friday night)  and noise carries when the airbnb room next door is let then you will hear heavy footsteps, walking and running, the bath being filled toilet flushing, etc but the location is sensational for food, bars, cafes etc., and our room was good despite the noise at times. Great place to stay, very local and handy for Fremantle's many attractions. The morning of our stay, we received a phone call to say the room had been double booked which was extremely disappointing. I was told this has never happened, but reading other reviews, it’s not the first time. The solution to this was that the owner had an Air BnB and said we could stay there for the first night and then move to a hotel down the road for the second night. When arriving at the Air BnB, we turned up to the owner’s personal house and her bedroom was ‘our’ room. There were personal belongings all throughout the room and it was dirty. The bathroom was a shared bathroom at the back of the house with all of the owners personal toiletries, throughout. The booking was for a private stay with our own apartment so to then be presented with this, was disgraceful. Great place for a couple to stay. Is a little tricky to find but once you are here you can enjoy Fremantle at your leisure. The breakfast is very good and we enjoyed it very much. The only criticism I have is that the fan above the end of the bed is in bad need of a clean. I would suggest to anyone booking a room that you carry an overnight bag as the stairs are a little tight for large suitcases. Otherwise everything as far as we were concerned was great. The ladies that do the cleaning and prepare the breakfast tray are very friendly and helpful nothing is a problem for them. I was so disappointed on arrival to find out that the room I had booked had been double booked even though I had booked months in advance. Instead of a room with a lovely balcony overlooking the garden courtyard I was designated the least desirable room in the hotel with a balcony looking at a brick wall. Not even sky view. The room was small with only space for a bed and 2 dining chairs at the foot of the bed so I felt quite claustrophobic without a window to look outside. The courtyard garden whilst it is lovely is not available for guests to use for sitting and relaxing as there are private residences within the complex. There is no parking available for guests. There was no opportunity for me to negotiate with the property manager. He wasn't interested and behaved as if he held no responsibility for ensuring that my stay was a pleasant one. He made no offers to investigate or find a solution to the problem. It's a shame that my experience of exploring Fremantle was not as positive as it could have been. Whilst Fremantle was great, I really didn't enjoy staying in the tiny  hotel room with a window and a balcony faciing a brick wall. I will stay home and catch the train to Fremantle next time. I will save over $500 and still enjoy the sights of Fremantle.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adina Apartment Hotel Perth: We often stay at the Adina's in Perth. First time at Mounts Bay. Service is wonderful. Friendly and prompt. Location is great. Good access to convention centre, Elizabeth Quay and city. This was our very first time visiting Perth.   The Adina Hotel was a very good choice to stay in.  Very clean and the atmosphere, staff and service was great.   The only negative we have is that the cook top had a greasy film on top of it, and the range hood didn't sit flush like it was supposed to.   On closer inspection, there was a broken piece that had broken off onto the cook top. The lady that checked us in and checked us out 10-16 June was very lovely and definitely helped make our experience more enjoyable. The rooms are a little bit dated, the main frustration was actually using the elevators and outer doors because the key slots don't read that card properly so it takes a few attempts. The rooms are cleaned daily which was quite nice to have and the location is very convenient, not far from the action of the CBD at all, majority of the city can be reached in 15-20 minute walk. It was our first time visiting Perth, and the hotel did help provide a memorable experience. I have alsp stayed with Adina previously in Sydney and would be happy to do so again. Great location. Close to the station, shopping and food. Staff were helpful. AC was very loud in one of the bedrooms in the apartment. A great bar next to the apartments. Nice central location Absolutely disappointed.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rendezvous Hotel Perth Scarborough: My sister and I had a wonderful stay at Rendezvous Hotel. The hotel was beautiful, rooms were clean and the buffet breakfast was AMAZING (I recommend including this to your booking 100%). The pool and spa facilities were closed for renovations, which was slightly disappointing, but understandable. Location is amazing, however, there is a very loud night club just below that did keep me up on the weekend. If you are a light sleeper, this may affect your experience on the weekends. Overall, I had an excellent stay and I will be booking with Rendezvous again for my next trip to Perth. Very dated rooms and very poorly soundproofed glazing (so you'll hear each of the many V8 engines and motorbikes pulling away from the major road junction right outside the hotel). This hotel is in such a nice area, and has so much potential if they improve a couple of things. The first would be a refurbishment of- pretty much everything. Painting on outside, carpets/bed/tv/pain in room/furniture in room as most of it was damaged or just old (bathroom was nice though) and the pool area (such a big space yet barely any shade and seating). There was no staff member by the pool and even with all the ‘no climbing’ and ‘no diving’ signs there was kids jumping from those marked areas and splashing water everywhere. Two kids fell in the short time I was there. It also doesn’t smell like chlorine at all and the water was quite dirty (especially the spa was like yellow), and a few kids were spitting into the water as well which was disappointing. Quite a unique pool though with the waterfall. Wow, what a great hotel. I Love that it has balconies. We had room 1704 2 double and my brother who was celebrating his wife’s birthday was 1804 King with ocean view, park and pool. A bit run down, needs a good revamp. Wardrobe sliding doors don’t really slide anymore.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Duxton Hotel Perth: I recently stayed at the Duxton Hotel in Perth and had an amazing time! The highlight of my stay was the bottomless brunch with my friends and family - it was an absolute blast! The food was delicious, and the drinks kept flowing. The staff were friendly and attentive, making sure we had everything we needed. The hotel's atmosphere was vibrant and lively, making it the perfect spot for a celebratory gathering. Our room was comfortable and stylish, with all the amenities we needed. Overall, I highly recommend the Duxton Hotel for its excellent service, delicious food, and fantastic atmosphere. 5/5 stars We loved our stay here. Got a good deal at time with breakfast included, complimentary bottle wine in room plus complimentary 2 drinks at bar. Room large, comfortable, close to centre city. Loved the Duxton and the staff were amazing. My only complaint is the walls are too thin and the doors bang when people leave. Great little bars in the area. Well worth staying. First time we have stayed, we will be back! Service was amazing, cleanliness amazing, inclusions excellent! Buffet breakfast was unreal with great options for dietary requirements. RECOMMEND!! Loved staying here. Lovely service and flexibility with late check out. Great location and close to Swan River which is beautiful to walk along. Easy walk to public transport. Hotel menu is great. Would highly recommend.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pagoda Resort & Spa: Great location, rooms were nice and quiet. The spa bath in the room was excellent and very quick to fill. The buffet breakfast had a wide variety of food options to choose from. Wow... $58 for Mothers Day breakfast. I had to ask for our empty plates to be removed. We were the last session, and it was as if they had given up. Not replenishing items, no service. Had to pay extra for proper coffee... come on..its $58, no one can eat $58 of breakfast of that quality. Any service would've made it more worthwhile. The poached eggs were like bullets. My neice said it was like camp food .  Not worth it!!!! Oh dear where do i start.... I literally can't find anything positive to say about my stay here. My children and I stayed here on the 13th March 2024, I cannot fault this resort. We will definitely be back again for future stays. The staff are incredible, helpful and super kind! My kids loved the pool and spa baths in the two bedroom apartment!! Cannot wait to come back again 😁 We were hoping for a luxury stay at this hotel however the reality was far from this. The hotel was dirty.  I don’t think the buttons for the lift have ever been cleaned. The furniture throughout the hotel was dated, dirty and neglected. The bedroom had furniture with doors that would not shut and held together by duct tape. The bed was extremely uncomfortable with pillows lumpy and hard with a doona that was a size too small for the bed. This hotel is certainly not a 4 star hotel, nowhere near.  Definitely will not be going back.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "88 Noodle Bar: This is a good value place to come for Asian cuisine. It’s not specifically a Chinese restaurant as the menu offers a range of Asian cuisines. Food use to be good here a while back. Definitely have new chefs. Food not very good.  I had  lamb massamam .sauce was way to thick (like gravy) rice was dry and some peaces hard. Very poor. Sorry won't be back. This is where I normally go for food before I hit the roulette table. It’s just convenient as 88 Noodle Bar is nested inside the Perth Crown Casino. You can see people in the casino from this place and likewise. We attended 88 noodle bar on the night of the football derby. We were at Crown to see the show Grease. Both the kway  teow and sweet and sour is too sweet, it could be considered a desert. Would not recommend. No asian person would eat here willingly",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "European Restaurant: Very nice, clean, quiet hotel would definitely recommend it. But was a bit disappointed with dinner does look lovely on the pictures, in reality  the selection was much less than in the pictures. Breakfast on the other hand was great, bacon, eggs, fresh fruit, juices cereal and much more. EDITED. This is an old review. I need to revisit now that it is been rebranded into European Restaurant. We dined here as part of the Miss Maud Hotel room package deal. Buffet dinner was superb. Staff were friendly and worked quickly and efficiently. The selections of food from seafood, salads, hot dishes and desserts were delicious. In particular the beef brisket which was melt in your mouth and deserved 5 stars of its own  - and I'm not a huge fan of beef! All the desserts were so yum, many are sold in Miss Maud cafes. Our only \"gripe\": the chocolate mousse is overly sweet. It was like the chef sneezed while adding the sugar and accidentally put in 200% sugar. The birthday balloons were a lovely surprise as was the musician who came to our table with a slice of chocolate \"birthday\" cake aka Queen Silvia. Breakfast was a laid back relaxing affair with equally efficient and friendly staff. The crepes are very addictive and so mouth watering. Everything else was standard breakfast buffet fare all well cooked and nicely presented.  Of note: the two male staff members who manned the restaurant reception at dinner and breakfast (sorry don't know their names) were so lovely and welcoming. They are a great choice to be the \"face\" of the restaurant. Would definitely recommend dining here. Firstly: any individual over the age of 10 yrs that uses the word \"yummy\" in a written review, deserves to be drowned in a warm bucket of milk! WOW...!!  I'm sorry but I've had to change my review regarding the ICONIC MISS MAUD RESTAURANT & HOTEL...",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pancho's Mexican Villa Restaurant: Great place to meet with anyone over food. No age restrictions and is very entertaining with alot of decorations on roof and walls Staff was good but we received mains after long wait ~1hr. It wasn’t that busy too. We order all food mild to medium spice but veg fajitas were too spicy lots of whole black paper. It's rare these days to go out for a meal that ticks all the boxes, Pancho's however did for us and we'll definitely be coming back! The meals were delicious, reasonably priced and very decent portions. The service was wonderful and the waitress we had (I am sorry I didn't get her name so I can give her credit) was so attentive; a rarity these days when the fashion these days is to look around but see nothing 🙈 and we walked out without needing to refinance our mortgage so five stars from us! gorgeous GORGEOUS vibes and aesthetic; literally felt like i was in mexico for the day of the dead. unassuming on the outside but absolutely INTOXICATING inside. First off, let's talk food. They've got all the classics you're craving, from sizzling fajitas to cheesy enchiladas and killer tacos. And don't even get me started on their carne asada—it's grilled to perfection and basically melts in your mouth. Oh, and did I mention their margaritas? Trust me, you'll want to try one (or three).The vibe at Pancho's is cozy and welcoming, with colorful decor that screams ¡Viva México! It's the kind of place where you can kick back with friends or bring the whole fam for a fiesta.And the service? A+. The staff here is super friendly and always down to chat about their favorite dishes or mix up a custom salsa just for you.So, next time you're in the mood for some Mexican goodness, do yourself a favor and hit up Pancho's Mexican Villa. Your taste buds will thank you. ¡Buen provecho!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Saowanee's Place Thai Restaurant: We went here for lunch for the first time. Very nice meals, great service and very comfortable seatings and atmosphere. We really enjoyed the Triple Flavors Fish, the Drunken Noodles and Sweet Sour Stir Fry Chicken. They are very tasty with reasonable price, for the quality of food we had. For sure would come back again. After nearly four years, we returned and had dinner at Saowanee's Place tonight. New owners, new decor but same tasty food and excellent service. Love the new look! Thank you for a very delicious meal and a lovely experience tonight. We will return. We recommend the beef massaman curry which is a must have. Came here for my aunts birthday and everything was amazing! The flavours in the food were exceptional, especially the Goong Chae Nam Pla (4 prawns) appetiser/starter. It was sensational! Highly recommend this restaurant to everyone who loves Thai food. New decor but the food and service are the same. I have been coming here for years and it is still the best Thai food in Perth. We ordered a takeaway Pork soft bone soup.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Turban: EDIT: This place is the gift that keeps on giving! Had the buffet with my brothers and wife, while watching a beautiful sunset. Great food and amazing staff. Food was delicious, and the servers were very friendly and attentive. The Lamb Masala, butter chicken, and goat curry are highly recommended. Hey The Turban team, From the moment me and my family went into the restaurant everything was top level very welcoming stuff and friendly , food was great for flavors and the quality. The lady over there I think her name is Tina was very friendly and welcoming and kept checking on us if we need anything else. Felt the warmth of the place and comfortable environment . Will come back to this place for sure.highly recommend. The best authentic Indian restaurant in town. The service is next level and the chef / owner is amazing! We love coming here and the food never disappoints.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Spinifex North Beach: The location is great, food was good but certainly not good value!!  We had smashed avo for breakfast, which on the menu states ‘eggs’ but we only got 1 and only 1 piece of toast, surely for $24 you would expect to receive 2 pieces of toast, it would make a big difference! Photos on their site and social media are deceiving!!  They are still using photos from North Beach Deli’s menu! Came to see if it's worthwhile coming back for lunch or dinner, Popped in for a quick lunch on a Sunday. There are three bays at the front, a car park at the rear and another beach side car park just over the road Food was good. Enjoyed the steak sandwhich special, great sized meal. The venue could do with a revamp and at the very least, an aircon unit placed inside as it was too hot / stuffy to enjoy anything. The doors to the outside area should be closed as there were flies buzzing around inside and landing on food. Opportunity for the venue to be great, given the view, but it’s definitely not there yet. First time as locals and we were there for Parmy night. What a great experience. Food was amazing and Ciro (the Manager) was so personable and attentive. Cocktails on point and the Parmy was next level. There are about 6 to choose from and the prawn version was sensational. Well done Spinifex you’ve nailed it we will be coming back every Friday at this rate. Do yourself a favour and visit this local gem",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Monty's: We had the opportunity to try the buffet breakfast at Monty’s on the ground floor during our stay at Pan Pac Perth during the weekend. Disappointed!!!! I went for a Sunday lunch buffet and the price listed was $45. The buffet starts at 12pm and it gradually became crowded by 1pm. We had a worst mother's day lunch ever at Pan pacific Monty restaurant. Thought service would be better as it was rated 4 star. But very disappointing, service was very poor even after a couple of request to top up our coffee still no follow up. We have to asked every each time we need coffee. And waited long time for milk , coffee gone cold.  As the name suggests, high tea shouldn't there be a waitress going around checking through and asked if we need more coffee or tea? It is not worth the price we pay for $75 p.p. Not the best buffet in Perth, but I did dine with a Groupon. For the price I paid I got what was expected. There was not a huge variety of food, the best bit was the dessert table. They did not serve cheese with crackers, which I found really odd. Service was not very good, I had to go up to the bar to order drinks and ask for water a couple of times.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Arcadian Bed & Breakfast: Jeffrey was an amazing host, cooked lovely breakfasts and made us feel very welcome. Stopped here for 10 nites while visiting family  the hosts were 2 lovely people Lovely room and very friendly and attentive hosts. Helpful with things to do, places to visit and events in the surrounding area and in the city. Wonderful stay. We will be coming back in the future 🙂 What a find. Excellent value. I stayed in a double room with ensuite. Clean, comfortable. I wanted for nothing. The hosts are charming and friendly and respectful of personal space. Very quiet yet close to a rail station and shirt walk to buses. Highly recommended. Absolutely the sweetest place I've ever stayed and enjoyed the most. Good location very closed to the harbour if you going to rottnest Island.( 15 mins drive).  located at the very quiet neighbourhood,  good privacy that you have your own entrance so you wouldn't worry to bother the owner too much. They're very generous to share a lot of infos if you're a tourist. The room isnt huge but very tidy and its provided cool drinking water, and good room service.Will come back again for sure. Thank you Jeff!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rose & Crown Hotel: We have been a few times now. The food, service and ambience have always been fantastic. A charming restaurant aiming high but in need of minor touches. The Rose & Crown is a great pub with a great atmosphere. We ate at the restaurant today, the service was great and it was lovely and warm. Great location and great accommodation. The Pub next door is great, food and drink service brilliant. Good location if you are doing vineyard trips. Coming back again without a doubt. Went for dinner by the fire on a cold Perth night. The atmosphere, fire, food and service were outstanding. Our waitress Lilly was fantastic attentive but in a very subtle way. Highly recommended.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "My Place Bar & Restaurant: It was my first African meal, and it was amazing at My Place bar & restaurant! Very tasty food, highly recommended! I ordered here today as I’m a visitor in town and was craving authentic Nigerian food. The food didn’t disappoint. I ordered the Jollof rice, plantain and tilapia combo and asked for extra spicy sauce. I was pleasantly surprised to see some extra snacks in my takeaway pack upon arriving at my hotel. I loved the place... the food portions are great, the food tatsed awesome. No complaints. It was our first time there and we were well served at lunch time. I would recommend for African food especially because that's what we all had, different African dishes. Always a great atmosphere, awesome food and friendly service. A great place to relax and have a drink or two and mingle, listen and dance to great music.  They have a private room for parties of you want to close off from the main bar so very versatile. Last time l went here the standard has gone down a lot from how it was.Service was super slow we waited a longtime for food and then the soup l had was too spicy and meat was hard.Overall standard has gone down l used to like this place.Management should hire more employees and do better in service.To add l visited last month in June and was there for lunch on a Monday.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "La Vela Restaurant: This is the best Italian I have had in Australia it is so authentic and feels like home. Staring with the food it is so fresh and is amazing.The service remarkable had a 20 minute chat with the owner talking about Italy and how he came to buy the restaurant. I highly recommend coming and having a nice meal here: A real family style restaurant.  Staff were very pleasant and the service was fast. Delicious food and great attention. We had the ravioli and it was so yummy! We will go back soon! Grazie! Experienced a great meal out.Exceptional service..very fast even though they were super busy.The owner is hands on which is rare to see now days. Hosted a birthday for around 30 family members and Alex was very accommodating. The food was absolutely fantastic and service from all the wait staff was of a very high standard. I asked if everyone enjoyed their meals and it was unanimously enjoyed by all. The garlic bread is fantastic, and that's only the start!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bada Bing Cafe: Across the road from the park and lake so it's popular. Plenty of seating.  It can get busy so we waited quite a while for our coffee. Too slow given all the staff on hand I was part of a group booking for breakfast. Our reservation requested an inside table,  but we were put on a long table outside with half the table looking directly into the sun.it was very uncomfortable. Food was nice enough. Delicious food, good service and friendly staff. 👍 We had a great experience here. Booked a table for Sunday brunch for 12 and the vibe was calm and welcoming. The menu looked good and everyone was happy with their food, esp the corn and hallomi fritters. I especially appreciated that the servers actually came to the table to take your order. Would recommend and would go again. Beautiful service and food today. Anzac Day so was quiet. Beautiful atmosphere with a great outdoor sitting area. Lake views. Service was great from all workers. Food really nice and reasonable priced. Will definitely be back. Highly recommend trying if in the area. Perhaps book if it’s a nice day and you’re looking @ late breakfast early lunch times.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Joy Kitchen: Joy Kitchen is an absolute delight! The corn soup is a must-try; it's a burst of flavor that leaves you wanting more. The overall dining experience is fantastic, with delicious food that truly stands out. Be sure to make a reservation, as this popular spot gets quite busy. Our evening was made memorable by the exceptional service and delightful atmosphere. Highly recommended! 33 years in WA and can only count on one hand how many nights I have dined out in Freo. Ok, the service was a stand out. Very aware! The food was delicious and generous as well as good value. The atmosphere was relaxed with an amazing vista of sunset. Excellent. 🙏🏻 I've never left a 5 star review before but the food was incredible and the service was amazing at Joy's Kitchen. Our dishes came out lightning-fast and were to die for. The restaurant was also calm and quiet even though it was quite full (everyone was too busy eating to talk much!) I'll definitely be coming back very soon! Great place for a nice sunset watch with friends and family.  Great food and great ambience. Love the staff working here,  very attentive and accommodating.  Ordered the black pepper fried rice,  with Sze Chuan chicken breast strips,   mixed seafood (fish,  scallops,  prawns) and mixed vegetables. Highly recommended for sunset watchers and Chinese food lovers.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rosebridge House Bed & Breakfast Adult Retreat: Have just returned from a 2 night stay at Rosebridge and highly recommend. Lovely location, the rooms are well equipped, very clean and lots of little personal touches making it a lovely stay. Beautiful cheese platter waiting for us in our room, well worth paying for. We enjoyed our 3- night stay at Rosebridge very much. The gardens are beautiful and provide a tranquil setting. It was great to see the wildlife - parrots, kookaburra and quendas. Breakfast was delicious and cooked to order. We had a wonderful stay at Rosebridge House.  Pete & Julia were most welcoming & happy to help.  The breakfast was delicious and our stay was highlighted with the Julia's feeding of the tame bandicoots .  The bed was excellent & the decor was lovely.  Such a beautiful garden as well. We wouldn't hesitate in staying again.  Our thanks to Pete & Julia. This is a true hidden gem of a B&B. The helpful check in, a real person picking up the phone.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Belvidere Pizza: I ordered a meat lover but it was all ham and no other meat at all, and it was salty. Pizzas had a generous amount of toppings and they looked good (see photos). They were prepared quickly and delivered on time by Menulog. Unfortunately they lacked taste. I’m not sure why but there’s really room for taste improvements (may be add some sauces?). Ordered a Jumbo Meatlovers last night via Uber Eats, First time customer and was the best Pizza I have had in years, found my new local Pizza Place. Had a side of Garlic Bread as well which was nice. Delicious pizzas and garlic bread 🍞 🍕👌 Awesome Pizza. Friendly staff. Walked in and had two hot pizzas within 15 minutes. Great flavor with lots of toppings. Prices are reasonable and good value for money. Definitely recommend.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Cottesloe Beach Hotel: Great spot for lunch on a fine sunny day. Covered balcony looks out across the water. Prices were reasonable and whilst it was busy, we didn't wait long for food and got a table immediately. Food was great and reasonably priced. Staff were friendly and looked after us without any hesitation. Will definitely be back. I was not a guest at the hotel but a bar patron. Antony, the bartender, did an excellent job taking care of a massive group of people and being kind and professional the whole time. There was a long line to order and he managed it calmly and treated everyone really well and respectfully even though he was in a stressful situation. Also, the food was really good. The steaks and pizzas are fantastic! Such a great spot for our weekly quiz night with DuxNuts! The food options are spectacular and often changing, same with the wine and beer selection! Always a great place to visit and grab a cold beer, whilst watching the ocean.   Make sure you pick your time,  as it can get very busy-especially on weekends.   Great service,  friendly atmosphere & most importantly cold beer on tap.  The pub food looks tasty enough from a distance but by far the best part is location. We celebrated our annual People Services Award in this beautiful setting with delicious food and excellent service. The staff were very attentive, professional and friendly. Thank you to Antony especially for looking after our table. Will definitely recommend CBH for any event or celebration!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Fremantle Bed & Breakfast: A comfortable stay in the heart of Fremantle. Cute rooms and very clean and presentable. Shared bathroom. Easy self check in and the host is easily contactable by mobile if needed. Breakfast was lovely and served at 8am. It's a good place to stay if you want to be close to the port. The little house was charming and very well done and maintained. The bathroom in the Jocelyn suite was probably my favourite due to the styling and fixtures. Everything in the room was thoughtfully done including the tea service and fridge. Thank you Susanne for a lovely stay and the continental breakfast was really good. The location is also perfect as its right near everything. Beautiful place, would recommend the top floor room, nice bathrooms. Excellent breakfast and overall service. I appreciated the easy check-in, beautiful heritage building, proximity to restaurants and the train station, overall comfort of my one week stay and Susanne’s warmth and helpfulness.  Highly recommend Fremantle B&B. Excellent place to stay which is close to everything. The Manager, Susanne communicated with us when we booked, and before we arrived,  with check in details. Breakfast was fantastic with many dietary needs catered for. The Down Under room, where we stayed had a kitchenette with microwave, kettle and refrigerator. Beds have good quality linen and are comfortable. High standard of cleanliness and tastefully furnished. An IGA supermarket is walking distance from the B & B. Beautiful historic buildings line the surrounding streets.  One evening we ate at Cage Roads Brewery, on the Fremantle waterfront; at sunset, which was very good. The train station is walking distance, and is on the direct line to Perth Station. Thoroughly recommend staying at Fremantle B & B.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Himali Gurkha Nepalese Restaurant: Food pretty good. Small and large serving options available for most dishes. Didn't see any pork on the menu. Small cosy restaurant. Good idea to book a table. Simple decor. Indoor and outdoor seating available. There is credit card surcharge. Pay parking behind restaurant. We eat here with friends every couple of months. The food is delicious, the service is perfect and the atmosphere welcoming. It never changes, just perfect every time. It's also very reasonably priced. Oh and one more thing, the Nepalese beer is delightful. If you've never been, your missing out. Authentic nepalese food in a cozy ambience.I highly recommend this place. Great Nepali food in an established neighbourhood. The Thali was very filling with unlimited top ups! Service was friendly and we ended coming back a few times after! The place is overpriced for the food they serve. Decent service. Have been to better Nepalese restaurants in Perth with much better food and comparatively better price. Owner was rude saying he won’t refill the thali if it’s been shared when that was not even thought about and everyone in the table ordered their own meals.  The place has a board that says BYO wine only and the owner and his mates brought in whiskey.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Melbourne Hotel: Fantastic! The customer service was amazing and the hotel is so beautiful. Renovated to be modern and comfortable whilst maintaining the buildings old charm and uniqueness. This was my favourite hotel in Perth. Having been to Perth many times I decided to do something different and try the Melbourne hotel.  It was amazing! The staff were so friendly. The beds extra comfy. Rooms very tastefully done. I love the decor and ambience. Restaurants were 5 star quality.  I can’t wait to go back again.  Thank you for a great experience. This was our third visit to this well located hotel. Highly recommend staying here if you're in Perth. It's convenient for retail shopping, the CBD and rail links. The staff go out of their way to assist you and the hotel is relatively inexpensive. Another great stay at The Melbourne Hotel. Spacious room, very clean. Comfortable bed. Loved the pub for a drink and snack and breakfast was amazing! Will definitely be back because the location is excellent with parking on site. We loved our stay at The Melbourne Hotel. The front desk server was very welcoming and helpful, making the beginning of our couples date night, relaxing and enjoyable. The location is in the perfect spot for any potential concerts at the stadium as well as walking distance to restaurants.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Topolinis Caffe: We had a work dinner here. We were seated but no one checked on us we had to keep asking for service . Most of our food was delicious but my colleague had the worst risotto it was mush and she was embarrassed to complain . I did mention it to the waitress but nothing was done about it so she never got to eat her entire meal . And she ordered a dessert that they  charged to the bill but they had run out of it.  But was sorted out . There is no music so atmosphere is dead . Such a pity . Definitely a let down . And we all love Italian food . Service was amazing! Everyone was so welcoming and attentive! They were wonderful with my 3 year old as well and she said it's her new favourite restaurant. Had dinner with my partner at Topolini's. A quaint little restaurant,  hidden gem. Great food , never had a bad experience  yet. Friendly staff. Great service.🪻.Add some music it would be great.Not sure if I heard music  or not. Pizza was gross just a frozen base from the shops with some toppings. We were put in a corner and forgotten about so we had to ask for someone to take our order twice! The pasta is alright but we won't be coming back. Kids ordered a spaghetti bolognese and a fettuccine gamberi. I had the scallopini.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Siena's: After a day of shopping, we drove to this italian restaurant along the freeway. At 7pm, it was packed full. Grateful to the staff who squeezed my hungry and tired family of 6 into the restaurant. Within 10 min of taking out order, our food arrived. I recently celebrated my birthday at my favorite restaurant. The food is consistently delicious and filling, the prices are reasonable, and the staff are friendly and attentive. I have been visiting this restaurant once a year since 2019, and it continues to exceed my expectations. Excellent food, ordered the Veal Schnitzel with salad and veggies. Finished off , absolutely delicious and large portion. Great place to take the family for a meal, pizzas were large and nice and crunchy, pasta dishes were decent size and perfect ratio of sauce with pasta and there is a children's play ground inside to keep the kids occupied. Very accommodating, full on and friendly staffs.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Pizza Lounge: Unique and tasty flavours. Definitely up there with some of my favourite pizza places. Gluten free bases are thin & crispy (wouldn't even know). Also offer great deals depending on the night. Recommend giving them a go! Nice little pizza shop, with friendly staff and a great atmosphere. The satay chicken was a little lacking in flavour but it was quite late when we came so maybe the ingredients were low. Either way, overall a positive experience. Anyone can make a pizza, but not anyone can do it well! The pizzas we had were full of flavour and just the right amount 🤤😋. Great value and quality for the price. The staff are also very friendly ❤️. Best pizza in this side of the country. Six of us dined at The Pizza Lounge for dinner tonight. The garlic bread with Tabasco sauce was delicious and the pizzas and pasta meals we each ordered were also delicious. Definitely worth visiting if you're in the area. I had the smoked salmon pizza and it was amazing. Honestly just like pizza I had in Italy (and I think the owners here are Italian). Will definitely be back to try more! So glad I walked past this place… service was super quick too. Update: I went back again and ordered the ‘Rockin sheep’ pizza. Delicious! The dough is made fresh on site which I love. The flavours are innovative. Can’t wait to come back again",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Lapa Brazilian Barbecue Subiaco: Celebrated my birthday here. They will give you a balloon for your table. 🎈 I've been to coming to Lapa for quite some years and I have to say this visit stood out as the best. The food has always been consistently delicious and flowing and the service friendly, but we went the other night for a birthday and the service far exceeded any expectations. We were checked on to make sure we had everything we needed and asked if we wanted to request any specific dishes to come around. When we requested rump cap, it was there within minutes. Fantastic service, fantastic food and fantastic atmosphere. Thank you Lapa! :) Great food, great service, easy going atmosphere. We didn't have to ask for food it just kept coming. A decent selection of meats, vegetables and salads. Wines spirits or beers if required as well( we didn't drink that lunch).  I have tried a lot of different places and this would have to earn a place in my top 5. Parking was not best so we parked out on the main street, they have both if you have a few people attending. Children are welcome there and there will be lots the kids will love. Quite a special place and legendary in Perth. Incredible selection of food and drinks. Then the customer service was top notch!! The best meats for me were the honey lamb and beef ribs. I love the staff as much as the food. Our kids regularly demand Lapa for their birthdays or other special occasions. The food is great, but the wonderful treatment of their guests is better. We would give more stars if we could.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Wattle Grove Motel: We got a lovely welcome at reception and with all the help you could need. We opened the door to our room and was so impressed, the room and bathroom was so clean. Not one water mark on the shower screen, my husband almost walk into it ! Very basic but that's all we needed for one night. Room had a strong stale/stagnant smell. Luckily we didn't need the sofa bed but we opened it just in case one of the kids wanted more space. The sheets hadn't been changed on it and were disgusting. Thank God we didn't need the extra beds as it was late and would have been a hassle to sort out. Really convenient and well priced accommodation in a no-aircon at home emergency!  Room was clean and comfortable, parking was directly outside the room, it was quiet and well maintained property.  Service was great.  My only gripe was an excessive $500 bond that seems to be taking awhile to be refunded. Stayed in Feb 2024. Absolutely loved our stay here. The area was nice, rooms were perfect for what we needed (comfy bed, tv, sitting area, microwave, coffee/tea/kettle, ensuite) and it had a pool and a playground. The staff were great to deal with and were so efficient when I emailed them to ask them if I could book an adjoining room for one of the nights. We were driving to Perth at this time and were out of service but they just sorted it so easily. Nothing felt like it was hard or too much of an ask. Rooms are good value but the food at the pub at the front is the real winner.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Ogdens Bar & Grill: I wanted to take a moment to express my appreciation for the exceptional service we received at Ogden's Bar and Grill! Franz was an absolute delight - so friendly and accommodating. The boys at the bar were also top-notch. Unfortunately, one lady (who might have been having a tough day) wasn't as welcoming and directed us to the side of the hotel instead of the pathway. Thank you for a wonderful time! (And maybe a gentle reminder to the lady that a smile can go a long way) Food was great and server was very friendly! Highly recommended if ur looking for a restaurant/bar with vintage or retro atmosphere. :3 Fantastic,  friendly staff good range of dishes. Not too pricey Been a couple of times, mid week and early dinner, so not been busy in the restaurant yet. Bar was busy with after work crowd. Staff have been cheerful each time.  Big meals and reasonable price. Friend said is the best fish and chips he's had. I've had the pork belly and the parmi.  I can't remember what else friends have ordered. But the meals have been tasty and perfectly cooked and presented each time. I will need to go when it is busy, but so far the quality has been amazing. Love the atmosphere inside as well. Haven't tried anything else there yet, but keen. It was a great place to have a meal and a bear.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Alcove: We had dinner last Friday night & were blown away by the delicious food that was beautifully presented. The service was excellent too, very friendly wait staff. Suffice to say, we'll be back for more It was my partners birthday.  They had a little birthday sign on the table when we arrived which was so nice of them to do.  The staff were amazing,  the food was amazing, for dessert they made another cute birthday message.  They went above and beyond to make my partner feel super special. We loved every minute of it.  Will 💯 definitely will be returning. Came for dinner lovely meals. Steak was cooked to perfection.  Service wasn't that good. Very slow. Going to other tables first. Needs to be more attentive when there was lots of staff on. Went to dinner with a table of 6. All meals were very well presented and menu is seasonal. Staff on the night had limited knowledge of the menu and drinks and needed to ask questions and come back. I also felt like I needed to shout my order due to restaurant noise. However I was still happy with my food and would recommend Alcove. The food was amazing, cocktails good too!!  The staff were very friendly and attentive.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Swan River Hotel: The hotel is generally good, but it could benefit from additional staff. Massive hotel with big function rooms, but very quiet midweek on a business trip.  Has a Chinese feel to it, with lots of chrome and polished marble.  Food was ok, but not very special.  Rooms are good with huge comfortable beds. The alarm suddenly peeping during midnight for half hour without reason, not just my room but also others in that building, customers comes out with angry . And no stuff come to check until I have to take off the alarm and put on the desk. After checking out I got theor stuff to ring and complain I did not tell them I touched the alarm system... What a ridiculous request, I did not get sorry for their system screw my sleeping but have to say sorry to them ? Such bad service What a lovely view and beautiful hotel.  We went for an early dinner.  Fish and chips was delicious.  My freind had the pan fried fish and wasn't overly impressed.   Still a lovely venue. Far from a 4 star hotel. Rooms are large but lacking in extras,  no water in fridge, no milk for tea or coffee, no room service menu or compendium. Attended a work conference, food below average for both lunch and dinner. Group dinner lacked service, most in our group had finished entrees and mains whilst our table was still waiting for our entrees. The quality of the meals below average",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Windsor Hotel: The food was ok. Basically Self service. You go older by the counter bring your own drink to the table the waitress will bring you food only. Honestly I love the atmosphere outside Can't fault this place. The courtyard is so enchanting, the service (we get the same lady who has been there 30 years) is impeccable, great wine selection, and honestly, the food is so well executed. Beef Wellington was enormous and cooked to perfection...house made (pepper) sauce, duck fat roasted potatoes...I had the red emperor with a stunning house made white sauce, truffle mash and sautéed greens. Larger than average serving of fish. The Creme caramel was next level, as was the apple crumble. Do yourself a favour and support this iconic old pub. 10/10. A great venue with a fantastic atmosphere and menu choice. Food and drinks served accurately and prompt. I could not fault the service and hospitality provided Just like Alexander Volkanovski before he ran into Makhachev, this place is a safe bet. You know you're gonna have a good time when you're coming, the beer's gonna be cold and the food is gonna be decent. I've gotten the steak here a couple of times. Not the best in town, but still good if you ask me. One of our favourite places! We have never had a bad experience in anything. The food is fantastic, the cocktails are delish! Our waitress Tracey is amazing and very tentative. The setting is just stunning and the music is relaxing and not loud and obnoxious.  Very highly recommended.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mahogany Inn and Distillery: Came here fairly last minute on a Sunday with a big group from work. Nothing was too much trouble for the staff and management. We ended up staying late and they graciously stayed open and we never felt pressured to take off. Brilliant. Wonderful service, friendly and helpful. Food was delicious and plentiful. Drinks were perfectly served and their coffee was very decent. Well priced. Definitely visit if you want a nice relaxed venue. Very average experience tonight, had to seat ourselves in the restaurant after waiting for nearly ten minutes for someone to seat us (so did the table in front of us), ditto getting our own water and then after 20 minutes finally got some service, no acknowledgement of the wait. Food came fairly quickly but was very average, my summer beet salad was 90% lettuce, 2 tiny dots of feta and cut up canned beetroot, the others were okay, dessert menu was limited, only vanilla ice cream for the kids ice cream cup and my son waited for 10 minutes after our desserts were served to get his. We then stood at the till for another 10 minutes to pay. Staff were polite but completely uninterested, and not at all welcoming. Won’t be going back. Cannot recommend Mahogany Inn & Distillery highly enough. The service was exceptional. Every staff member I had the pleasure of meeting were friendly, professional and warm. Love the room just checked in went to bar really lovely staff and really nice front of house. The food was amazing they catered to my allergies amazingly. Thankyou Vincent (Chef) Belle(waitress) and Jai (barman) and the proprietor Jim for making a good night into a great memorable night. Highly recommended for a meal or overnight getaway it is so worth the time.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sentinel Bar & Grill: We went here for lunch, the service was excellent. We were looked after very well and water got refilled regularly. The food unfortunately wasn’t as good as expected. The steak sandwich could have more chips and more ingredients on the sandwich for the price you pay. I had the vegan ravioli which was the only vegan option (the menu doesn’t display it, you have to ask for it) which was very salty. The atmosphere was okay, sometimes a little too noisy for my taste. Overall okay and good for a quick lunch with your friends or work colleagues. The food was gorgeous - my steak cooked perfectly (for me) and so so so tasty. Our waiter was so helpful and funny - he really made it a special lunch for myself and my staff. This is a great bar and grill which gets the classics right. We ordered the scotch fillet, the eye fillet and the local market fish which was a barramundi on this night. We had an early breakfast meeting at 0730 this month at Sentinel Bar & Grill. The venue is lovely with a chic ambience, and we found the breakfast menu sufficient to cater to most. Went to Sentinel for the 2nd time recently. I ordered a starter of tiger prawn and sides of cauliflower and spicy hummus. The atmosphere is great and location is perfect. Service was also great. Our waiter was friendly and accommodating. However, I wish that my tiger prawn with Lemongrass-kafir lime-green\tchili\tbutter had more 'flavour' and seasoning; and the Cauliflower\tFlorets with spicy hummus was spicier.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tony Roma's: Service at Tony Roma's is fantastic, with very attentive staff. Enjoyed the potato skins a lot but portion was on the small side. Onion loaf had an incredible spicy BBQ Mayo but the leaf was pretty greasy. The rib sampler is a delicious spread, with a tasty coleslaw but too much sweet BBQ sauce across the 3 ribs. Would be great to have a dry rub or less sweet style rib option. The beef ribs are an absolute treat. The customer service was amazing. They are super friendly and pay attention to customer needs. If you're craving some of the best baby back ribs in Perth, look no further than Tony Roma's. This family-friendly restaurant has become our go-to spot for satisfying our rib cravings. Delicious Ribs and Steaks. Visting today bought a lot of amazing memories from back when i had Tony Roma's in the States and the Middle East.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Royal Perth: This was our first time visiting The Royal Perth Mint.   The tour was amazing, and the tour guide was very informative and knowledgeable.   We could've spent an absolute fortune here. The various jewellery/coins/items were amazing!!!  We purchased a birthday gift for our daughter, who was celebrating her birthday while we were away in Perth.  My hubby purchased a lovely gift for myself.   We enjoyed our time here and would highly recommend visiting this amazing place!! Known as a fun bar to catch after work drinks with colleagues and friends. The bar gets really busy on a Friday evening but the vibes are immaculate if you get a seat by the balcony and with the yagan square as the view in the evening while the city is bustling for once! A fun spot for drinks We had a mum's night out at the Royal Private Dining room. Everyone had a great time and we especially loved the food, atmosphere and service! Highly recommend. Came here for the pub. Didn’t stay here. A quaint older pub in Perth with well maintained last century decor..",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Trigg Retreat Bed and Breakfast: Well presented b&b located in a quiet suburban street. The rooms are nicely furnished and are a good size. There is a relaxing common area upstairs and breakfast is served down stairs. The breakfast was delicious. Sue was wonderful host. Such a wonderful stay. While down in Perth for work it felt like a home away from home. The breakfast and the service really stood out for me as being one of the best I've had the pleasure of enjoying. The chocolates were the icing on the cake. Beautiful place Lovely room, spotless,  nothing too much trouble Were there for the third time in a row.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "COAST Port Beach: Such a stunning location. Absolutely perfectly designed restraunt right on the waterfront. Sit and enjoy the beautiful sunsets that WA has to offer. Fantastic choices of food and amazing drink menu. Perfect for couples, groups, and families or functions if needed. Thank you for an amazing evening, and prices were very reasonable 😊 will be back next visit to WA. This restaurant has a most beautiful view of the ocean from south of rotness to way north of rotness. Given that there were storms this afternoon and evening the view was outstanding The atmosphere is superb! Loved the steak panini I had here. And their chips are great as well. A good place for a nice lazy arvo at the beach. The atmosphere is immaculate. Great spot just outside Fremantle, right on a white sandy beach. The view for sunset is great, unbroken view of the whole thing. Be sure to stay for 20 mins or so after the sun disappears, it's worth the wait for the extra show, especially if there are one or two clouds.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Jaws Sushi Takeaway East Perth: 3.5 stars It was already my favorite sushi place in Perth but now they started this limited edition poke ball salmon and avocado and it’s the absolute best for a quick lunch! Hoping they will make it a staples and I will have to come every day! I used to LOVE going here, especially this store in EAST PERTH. Back in 2018-19 my parents used to take me here all the time. Its very traditional nice environment and delicious food and beverages. It's sad to see them not open their FULL restaurant with the sushi train and dinner hours. I also made a frieind back then called Nao. Sadly he got layed down due to covid and has started a NEW BUISNESS!!!! I hope jaws can come back up:) RASHAMASE Looks good and tastes good too. Lots of variety to choose from as it circles around. Great variety of sushi on a train. Very open kitchen so you can see everything being made right in front of you. The tuna sushi was the best I've ever had. The grilled salmon was also amazing. Matcha cheesecake also very pleasant. A small place, but well worth visiting.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Broken Hill Hotel: We love it here, our favourite spot to go to for special occasions, a causal drink or even just dinner after a long day. Food is amazing, please don’t ever get rid of the fried pork belly bites (BEST INVENTION EVER), definitely recommend getting the scotch fillet, always cooked amazingly 👌👌 Definitely will be back, great atmosphere, even better customer service and great food, drinks and company. What more can you for, so I had a Steak Sandwich with Fries and dip sauce. Absolutely recommend 😋 My family had a lovely lunch there a few weeks ago. The food was very nice, with quite large portions and well made. We had the nachos and a couple of burgers, which overall, was reasonably priced, we thought. Hadn't been here for about 30+ years. The Hotel has been nicely done up with a modern look but without taking away the old character of the building.  Had an oyster entree and steak main. The oysters were fresh and well chilled and the steak was cooked perfectly to order. Cold beer topped off a great lunch. Be more like 30 days than 30 years between visits now. Had a meal here today with 13 guys - Was nice , Food was good and atmosphere was ok. The beer was cold 🥶, steak 🥩 was 8/10 and other guys who had food said was nice , my salad 🥗 was average very dry! Probably spent about $600-$900 for all the lads!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Astoria Bed and Breakfast: That was an absolute slay of a stay, had the best time, Natalie and her husband were so accommodating and lovely throughout! Wish Covid wasn’t such an issue as we know meeting them in person would have been lovely. Don’t double think just book Astoria was plesant, and I stayed there Saturday to Tursday so that last negative review was certainly unwarranted. Clearly says no alcohol in rooms so suspect they were on the bottle. Bed was comfy, security tight and digital, continental brekkie every morning,  kitchen is a shared and ample space for what you pay, clean towels daily, and close to Kingsway sports complex and drive to shopping spots which we targeted. Natalie and Michael were responsive always. I shall surely return. Natalie & Michael made the check in process very easy, the bedrooms and en suites are immaculate and beautifully presented. I particularly liked the security arrangements being in my late seventies and coming back late in the evening. Everything you need is at hand and the delightful Natalie is always at hand to help if needed. We will definitely stay again. Avoid this place. The owners are very rude and very unhelpful. Shouting and arguing with you when your trying to follow their instructions to enter the property. It is literally an ensuite bedroom with a very small bathroom. Breakfast is a lunchbox with cereal and bread which you have to make in the very small kitchen where you can't find anything. Steer clear. I booked a room for a week here (breakfast excluded) which ended up at $80 a night ($560 for the week) I ended up leaving after 3 days. For 2 nights the wifi was not working on my side of the accommodation area, I had to keep buying credit on my phone and using hot spot which ended up being more expensive. I contacted the host and she informed me the internet inside was working fine and they are doing NBN maintenance, I usually stream movies/tv shows on my laptop so after a while I got bored and asked if I could have a refund and check out early, I was not issued a refund and ended up checking out early, if a place advertises “free wifi” and it is not working I believe you should get a refund if you leave because the service being payed for is not being received, will definitely not stay again, the room was okay and clean, it was a private entrance but yeah I’d rather go to a hotel for that amount of money.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Fraser's Restaurant: I dined at Frazer Restaurant in King's Park and had an excellent experience. The steak was cooked to perfection, full of flavor and incredibly tender. The cheesecake was very tasty, a delightful end to the meal. I was impressed by the extensive selection of wines, catering to all tastes. The atmosphere was wonderful, making it a perfect spot for a relaxing evening. Totally recommend this place! Amazing! We’ve nearly come here several times and been put off by some of the reviews. Sorry we haven’t come. Some years ago I used to come regularly for corporate lunches and dinners. So glad we came. Loved the service. Loved the food (ordered too much due to those who said the servings were small - they’re not!) Loved the view and the ambience out on the terrace for a leisurely lunch. Will definitely be back. Very good value taking into account the upmarket experience! We thoroughly enjoyed our dinner at Fraser's on Saturday to celebrate my husband's birthday. The portions were well sized and the main came out piping hot - just how we like it. My husband said it was an excellent steak, and the dessert that came with icecream and a birthday sparkler was a lovely surprise. Nice ambient lighting and attentive service. We will be back! We went for dinner for my partner’s birthday, and it was amazing. The place is beautiful with stunning views and great atmosphere. The food was incredible. I had the best risotto ever! And the vanilla cheesecake? Absolutely delicious. Highly recommend! After visiting Lightscape it seemed like a great time to revisit Fraser’s after quite a long hiatus.  So glad we did.  Honestly one of the best meals and accompanying service we’ve had in Perth. And the wine list - simply amazing.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Restaurant 1903: pretty good sushi, everything was tasty. definitely a good choice for japanese, chinese and western cuisine although a bit on the pricier end The staff are very nice and the food is divine, some of the best sushi I have ever had, and I eat a LOT of sushi ❤️👌 Restaurant hidden off main Street and can be found with The Great Southern Hotel on Robinson street. Christina was such a gracious hostess with her and Anthony's restaurant with many wonderful cuisines on offer being Singaporean. The atmosphere was beautiful, the food was delicious and the service was impeccable. Thank you again for having us. We will definitely be back! Really amazing food, staff members are really kind and welcoming. This is a great place to eat! What a hidden gem! A restaurant located in the Great Southern Hotel at Northbridge at William St.  The atmosphere of the restaurant is clean, quiet and cosy. The customer service is awesome as all staff are very friendly. We ordered the Singapore style fried Kuay Teow and Japanese Teriyaki Salmon Bento set. The salmon is of very high sashimi quality, cooked to the perfect taste and value for money. The fried Kuay Teow is average as it could have been more smoky and savoury. Will definitely be back to try on other foods.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sorrento Beach Bed and Breakfast: I wish I could give this place 6 stars. The rooms are on the 2nd floor of the property. It is clean, tidy and has huge bath room + bath tube. Welcoming hostess, lovely rooms. Spa bath was the best, allowing for a relaxing atmosphere. Bed was comfortable for me and mine. Our hostess made a  breakfast that considered gluten- and dairy free needs and was plentiful, beyond standard fare and expectations. Home is well-kept and situated close to the ocean. Thank you for helping us feel welcomed. Sorrento B&B is a private upstairs area with a substantial living space and balcony access. The king room is suitable for couples and has the option for an additional twin room for families. The bedrooms are extremely comfortable and are nice and cool.  The amazing breakfast options are served in a downstairs leafy courtyard. Suitable for short or long stay, the hosts will make your stay a memorable one. This B&B stay was a present for my wife and I had read all the reviews being very positive but the moment we came to this place we felt like unwanted guests the introduction was extremely brief and dismissive. This rudeness extended to our surprise the next morning at breakfast where we received minimal food and service this was especially disappointing given the menu and pictures on the websites and we didn't get offered beforehand what we would like for breakfast as there was suppose to be quite a few options. It felt like anything she had to do for us was a huge effort and we felt really upset and unwanted. We are not competitors we are legitimate customers who have been to quite a few B&Bs and usually love the experience and we always give credit where credit is due. The rooms are very clean and the bed was comfortable however you don't want to risk your hard earned money on staying at this place.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "C Blu: Lovely dining experience with my family. The menu is quite interesting and we ordered such delicious meals. All of us enjoyed your meals.  Good value for money, serves were large and full table service. Had a good time here. Great venue. Super chilled. Waitresses and staff all very friendly and polite. The chefs salmon special was an absolute treat. Walk in service available without a booking , but I do recommend booking if you want a window table. Amazing food and great atmosphere I’ll be definitely be back Poke bowl awesome. Burgers average. Fish n chips excellent as were Moroccan meatballs special. Manager had it together but most of the young girls working as waitresses were happy to walk past a table full of empty plates or try hard not to take an order. Please train em up to clear tables and when a customer looks at you they probably want to order something. Overall pretty good though and the view is beautiful.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The George Perth: Came here for breakfast with daughter Went to the George for a work Christmas get together. Place was open and inviting, lovely atmosphere. We did have some issues regarding the food and some miss communication regarding kitchen closing time. I ordered a ceaser salad that came later the stakes? And it was quite salty.enough so that I couldn't finish it. We had planned on getting desert but apparently the kitchen close at 8pm which we were not advised of. I think the wait staff went on break which I have no issue with but it wasn't advertised. Manager was able to organise a few chocolate fondants and icecream which was really lovely. Few issues of the online menu being different then the actual menu that they given you in the restaurant also. Okay price for value. Would still return was despite these small issues We purchased a red balloon voucher for the 3 course meal with a glass of wine. High Tea with my wife at this beautiful little gem. The food was beautifully presented and tasty. Lovely spot in Perth City for a romantic afternoon! We ordered the $50 set which included a glass of bubbles. The savory bites were delicious as were the sweets however the high tea lacked in table presentation and table service. We were not informed of the morsels served.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Leisure Inn: Friendly staff, really good food and well priced drinks. The beer garden area is well looked after and a really nice spot to have a beer and a bite. It’s not fancy but it’s damn good. Well worth a visit. Great experience. Jess at the front desk was very helpful. The restaurant next door was nice. Location was good. A bit of noise at night, but that was manageable. Great place great food great service not quite 5 star but very very close, definitely a great place for lunch and dinner plenty of beautiful food to choose from, reasonably priced and family friendly.. Nice enough staff, I love the old English pub vibe of the place and it's fairly quiet even on a Saturday night. The food is pretty standard as pub food goes. Christmas lunch was amazing. Staff were very polite and bubbly (considering they were missing Christmas with their own families).",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Woolworths Murray Street: Woolworths Murray street is definitely a vibe on its own. Two security guards at the front can only mean it has a high level of shop lifting incidents. It is a smaller version of a metropolitan Woolworths but has fresh fruit and veg, bakery,deli and the sushi bar was one of the best I’ve seen. Plenty of self serve checkouts though so you won’t ever have to wait. Product prices are almost similar to Korea.  Especially with fruits, I can hardly feel the difference.  It's like looking at a Korean E-Mart.  The shopping bag costs about 2 AUD.  I really recommend the sushi corner right in front of the checkout counter.  Very fresh and flavourful.  The price is almost similar to Korea.  9.9 AUD.  I think I'll go often while I'm staying in Australia. Woolworths in the Murray Street Mall close to Barrack Street, has it all, even has BWS liquor Outlet right next to it so you can grab you're whole grocery basket for the next week right there in the City. Woolworths itself is abit cave like walking in but I can assure you it has everything with great service to boot. Fish, Deli, Bakery, Self-service, it has the lot. It's not over busy but I went in the morning, today and it was easy, go check it out grab some yummy bakery items or some Deli goodies, well done Woolies! Usually the staffs are friendly, but today one of the staffs was rude to me. I understood how the casher systems go slow down sometime and when my payment didn’t go through I was not angry or anything but Alicia(?) told me to wait. She said to me ‘wait’ again and again with gesture and asked me if I could understand English. She didn’t explain to me properly. When I checked with her, she said ‘yes’ when I asked her if I had to wait to remove the card even though the machine says remove. She should have explained to  me to wait until she let me use the machine. I had to wait for quite a while. How she talked to me was not professional. I don’t know why she was so pissed off at me. I wished she was more calm and friendly. Oh she was talking to someone friendly though. Maybe I was treated differently because how I look.:( I was browsing the supplement section at my local Woolworths and was shocked to find krill oil supplements on the shelves. Supporting products that contribute to the destruction of the Antarctic ecosystem is unacceptable. Woolworths should immediately remove these products from their stores. As a concerned customer, I will reconsider my shopping choices until this issue is addressed.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: i had the most lovely girl serve me tonight! she was welcoming and helpful in my choices, and truly made me excited to eat my sandwich. Sophie and Anais, the two best subway employees in Subway in Perth, incredibly friendly, and they make Subway feel like a trip to see your lovely Grandmother who has baked fresh cookies. I would come back to this Subway every day if I could. Sophie and Anais are truly the best. The other night I went into the subway located at Claremont because I was very unsatisfied the way the hungry Jacks across the road treated me. There were a couple girls working st subway that were very kind, quick workers and very positive. I told my little son in since it was his birthday and I wanted to treat him with something nice and he was very satisfied with what he got. The girls wished him a happy birthday and made sure that he was happy, they wrote happy birthday on his sub to make sure he was happy. Excellent QUICK service with two young workers perfectly presented and lovely conversation  starters!!! Made dinner for my whole family off 6, and didn’t complain once when i asked them to change a couple things. These girls should definitely get a raise or promotion!!! never seen better service!🇦🇺👍😜 Finished work late thinking I could get a sandwich on the way home. It was 7.45pm and the shop was closed. The sign and google says 8pm but the girl was rude and said we’re closed no eye contact made. I’m vegetarian but I’d rather get a meat patty from hungry jacks next door then go to this subway again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Royal on the Waterfront: Went for a family lunch. Been awhile forgotten there were stairs to walk down  to the restaurant  and bar area. Also there is a lift. Otherwise  you can go down the side of the building. We had great service the food was good. One steak wasn't  cooked as requested,  they quickly return it to the kitchen  and came they way it was asked for. The view  was lovely . Car parking wasn't  an issue as we all did undercover  parking.  Everybody  walked away happy 😊 I’m a regular nowadays. The food is on point. Seafood is fresh. Absolutely loved this place, the oysters were phenomenal and the servers were very nice and attentive. I recommend this place to anyone who wants awesome views and delicious food! Had a lovely lunch here today, really nice spot on the water , tables with plenty of shade. Staff super friendly, we booked to celebrate my dads birthday , they had balloons and a card at the table and offered a drink on the house. Food was lovely, definitley recommend👌 Fantastic view, very good service and delicious food. Enjoyed our visit and we’ll visit again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Cookies at subway is always good. I've gotten bowls from other stores before and they always slice the tomatoes, cheese etc into smaller bits but the worker didnt cut them so it was a bit tricky to mix otherwise it was a good bowl I don’t usually get subway on a thursday night for me and my kids, but i wanted to treat the kids for some nice dinner. I came in and got greeted warmly by a young lady who had such enthusiastic mannerisms! Never seen someone work so happily. It was such a pleasure seeing the young lady enjoying her work. Thanks subway 😁 I ordered today at 1:50pm 27/12/23. The service i received was extremely rude from the girl making the subs. I don’t have an issue with certain bread being out of stock. But to receive dirty looks and an attitude from her after something that clearly isn’t my problem is different. She seriously needs to be taught basic manners! The bread that i ended up getting was undersized and rock hard. Not joking. This subway felt like a stone. Never again :( Tuna tasted good, good amount of each salad type and the bread tasted fresh. Your employee Layla served me quickly and efficiently, providing an exceptional dining experience. Her communication knowledge and also her experience meant that I was easily served with a smile and got very yummy food. Thank you for that, I WILL be coming back.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Subway: Subway on Hay St was unbelievably bad. They had only two staff members working during a weekday lunch period, moving like snails and seemingly indifferent to the long line. The food was terrible—the bread was stale, the meatballs were burnt yet cold in some sections, and the cookies were stale. On top of that, the prices were higher than at other Subways. Definitely pick somewhere else for food. I was surprised that the same item( footlong bacon and egg) was 30 % dearer than Melbourne city. I was comparing the Melbourne price on a public holiday $9.50- Perth price $12.50 Customer was horrible and the worker was very rude with the customers. I found this subway branch using Google maps walk mode very handy if you're nearby and after a quick snack, servive here is pretty quick, aircon and radio music. #GoogleMaps #LocalGuides classic subway atmosphere, great staff quickly making my subway for lunch. bit overpriced.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Kalamunda Hotel: Light lunch on a steaming hot day, misting sprays in garden. Great selection of beers on tap. History of being a haunted hotel - must come back to find out! Great service, food presentation & delicious food. We attended a wedding at the Kalamunda hotel and cannot praise them highly enough. If I could give more stars I would. The staff are so friendly and couldn’t do enough for us. The food was incredible (especially the baileys cheesecake) and the atmosphere was magical. Would definitely recommend to check it out! You won’t be disappointed. After a decent hike over the last two days, to be able to enjoy good music and great food  visiting here was fantastic. We haven't been for a while but we had a weeknight family dinner here recently and really enjoyed it. Food was good and very generous serves. Staff (especially Luke) were very friendly and attentive. What can I say. Beautiful place,  always a pleasure to visit. Great food, family orientated. Great staff.  Always welcoming.  First name basics is great.  Thanks to Luke and Aaron, great conversation  and  service.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "C Restaurant in the Sky: I recently dined at C Restaurant and was thoroughly impressed. The panoramic city views created a stunning ambiance, perfect for a special occasion to make it memorable. The service was top-notch; our waiter was attentive and knowledgeable. My partner surprised me by taking me here for my birthday. Staff were friendly & very professional. The atmosphere was very romantic, we were given a window seat to take in the views. Beautiful high tea! The food was delicious! Beautiful views! Staff were very friendly and attentive. A wonderful celebratory lunch today with 2 friends. Booked a guaranteed window seat to ensure the best views. Caught the train in so we didn’t need to worry about sampling the excellent wine menu with our delicious food. Decided to have a main each with extra roasted vegetables, then 3 different desserts to share using fresh plates.  Awesome! Could not fault anything. Some might find the main meal servings slightly on the small size but they were perfect for us. Thoroughly recommend this venue and well worth the expense for a special occasion. Enjoyed a high tea here with my wife.",
        "Additional_Info": ""
    }
]