[
    {
        "Place_Reviews": "QT Sydney: Loved this hotel! Quirky and stylish. Great service. Arrived early and the team were helpful, storing our bags all day and having them ready in the room on arrival. The room was larger than any other ‘standard’ room I’ve had which was nice. Amenities great and bed super comfortable. Love that the toilet is separate from the rest of the bathroom but the gap in the door meant you could hear and smell… well… everything. Heard plumbing sounds constantly, too so suggest ear plugs. Would definitely stay here again despite these few things. QT Sydney - you have my heart! Trick, tick, tick. Loved our stay at QT. Stunning hotel. Our room was beautiful. Bed was very comfortable. Dyson hairdryer a bonus. Only negatives (small ones), nowhere to hang a hand towel or anything else in the bathroom, and the sound of toilet filling or other plumbing sounds most of the night. Perfect location, quirky art deco style of decor but unfortunately my two week stay was let down by the basics. What an absolutely terrific hotel. To start off the hotel is very hidden but it’s like a platform 9 and 3 quarters sort of vibe and the whole feel from the reception to the rooms illustrates a hogwarts/out of the ordinary vibe. Loved everything about this hotel.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sir Stamford at Circular Quay: We booked one of the two rooms o. The 9th floor with a large balcony looking directly into the Harbour Bridge and Opera House. A pleasant stay in a well licated hotel for access to the Ooera House, Circular Quay and selected sights. Great service, lovely historic looking hotel. Room was good though bed was a little uncomfortable. The breakfast was nothing fancy and your typical buffet. Location was great. This is indeed an iconic venue, only minutes from train, bus, and ferry services plus its superb proximity to Sydney's Botanical Gardens and Opera house. The staff are terrific. The breakfast selections equally so. I can not speak highly enough of my joyfull stay, and much of my enjoyment is attributed to the hotel, its location, and what it's got to offer here. Not worth the price paid. Definitely needs an update. Furniture are old & extremely used. Paint peeling off walls & doors. Poor service. Room wasn’t serviced during the stay & staff made up excuses as to why it wasn’t done. And even after the service, they left rubbish on the bedside table & floor. Hugely disappointing. Safe to say, won’t be staying there again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Stamford Plaza Sydney Airport Hotel & Conference Centre: The hotel is like walking back into the 90s, so it's got that novelty feeling to it. A nice stay very close to the airport. The hotel was generally good, quite clean and well maintained. The beds definitely need to be replaced as they were super bouncy and not the greatest, and the breakfast was mediocre, however for a quick stay to/from the airport, it was good. The regular airport shuttle service was a bonus as it meant we didn't have to worry about making our own arrangements. Last min booking after my flight was cancelled, great price and the room was excellent. Had a very tasty steak in the restaurant and a good value buffet breakfast. Cheap shuttle back to the Airport top of a great stay. 100% recommended. This is a place I won’t be in a hurry to go back to, invited by a friend to visit the Stamford at Mascot for a few beverages and lite entertainment Saturday night. Enter in a quite pleasant comfortable  English decor bar ordered two beverages reasonably prices paid in cash, consumed them and proceeded to order another round, to my amazement the price had increased question the bar staff on pricing and was advised that due to the unavailability of the house spirit we were given premium. I question and advised the staff member  who served us  a so called supervisor in a jacket that perhaps in the future he should advise guests of the situation rather than take upon himself to mark up and serve a premium product without guest consent. After our encounter I went to pay with cash to my amazement advised that no cash transaction were able due to lack  off change in the float and asked with sheer arrogance to tap not bothering to ask for other forms of payment but forced to tap. Taped away consumed our beverages and  Uber to another venue which I might add made our night. I was very happy with the lighting in the room. They use warm white globes which gives the rooms a warm, cosy feel.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Amora Hotel Jamison Sydney: Very classy foyer and building. Great service and friendly staff. I didn't pay for the room so can't comment on the price but if I can afford to stay here again I surely will. Room was a standard size (nothing special). Great comfortable bed and bathroom. Standard city views. I love the total blackout blinds and curtains. Gym was too small to be of any use. Pool looked nice but I don't like swimming. Just book it! Our group of 3 searched for a last minute stay in the area (on Vivid weekend) and we were quickly assisted by Jasmine over the phone and at the front desk on arrival. Our stay was top notch from booking to check out. The rooms are spacious, CLEAN. Robes, slippers provided. Daily housekeeping. Breakfast buffet was solid with several options. The entire staff is professional, friendly with good work ethic. The location of the hotel is ideal with close proximity to The Rocks and several train + ferry stops. We enjoyed our stay so much, we decided to stay at the Amora in Brisbane later during our trip. Nice hotel in a good location at a good price point. Not as nice as others I’ve stayed at in Sydney CBD but the price point reflects this well I guess, hence the 4 stars. We stayed for two nights as a getaway for two. The room was clean and spacious with a lovely view over the city. It was easy to change and maintain the temperature and the double doors to the bathroom made me smile every time I had to swan through them! The hotel is a short walk from Wynyard Station and we had no issues walking to food and entertainment venues. Staff we interacted with were lovely and the pool, hot tub and saunas were an amazing end to days of walking. My partner used the gym and said the machines were usable but have not been maintained. All staff were very polite. Great pool/spa area!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Swissôtel Sydney: An absolute  GEMA of a hotel in Sydney.  Don't let the street entrance  lobby fool you. The high class refurbishment  in this hotel has to be seen to be  believed.  Elegant,  contemporary  decor  with a not to art deco era here and there. Gorgeous 😍 My weekend stay at Swissotel Sydney was truly exceptional! From the moment we arrived, the staff were incredibly welcoming and attentive. The highlight of our stay was the amazing buffet breakfast each morning. The variety and quality of the food were outstanding, catering to all tastes with a delightful selection of fresh fruits, pastries, hot dishes, and more. The hotel's central location is amazing, making it easy to explore the city. Our room was spacious, clean, and very comfortable, providing a perfect retreat after a day of sightseeing. I highly recommend Swissotel Sydney for anyone looking for a luxurious and enjoyable stay in the heart of the city. We'll definitely be back! My husband and I stayed here in November 2023. This place is absolutely amazing to stay. The customer service is outstanding. Everyone was accommodating and was upgraded for our stay. Me and my partner just checked out this morning and had a mixed experience. My family and I stayed here in June 2024. Location is great. Close to good shopping and the park etc. The arrival space is underwhelming at best. The front door is a hole in the wall. When you go up to reception it's nice but I wouldn't say it's anything special. Small. Very small. The service the whole weekend was HORRENDOUS! From the bar staff making the wrong drinks to 2 out of 3 lifts being broken to the waiter taking an hour to ask for our order at dinner then the food came out all mixed up. We stupidly decided to charge our drinks to our room and when we went to check out there were a dozen drinks on our account my husband didn't order! I was checking out while my husband was with the kids so I could only guess how many drinks he had. Now a WEEK LATER they've sent us an email with a bill to pay another $140 for drinks which were not added to our account at the time! They're just a mess. Its too hard. Will not bother staying here again. It's a good location but there are so many other places to choose from for sure. Save your pennies!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Little Snail Restaurant: Bought the Groupon voucher and booked a Saturday night for dinner. Can't fault the service or food. The food is fantastic, although the portions are pretty small. Service was extremely quick and efficient. We finished our 3 course meal in half an hour and was out of there. It's definitely worth the value for French dining. Food is decent for what you pay. My partner got the duck pate and he said it tasted off compared to the other pate’s we’ve tried at fine dining restaurants. Presentation of dishes was nice, dessert was definitely the highlight! I have always wanted to dine in at this restaurant, but I don’t why for some reason I never had the chance. Finally, had the chance to visit the place for our anniversary. It was definitely a great deal for a 3 course meal, getting the value of the price from the huge servings and desserts arrived with a “Happy Anniversary” written. Would love to celebrate more special occasions at The Little Snail Haven't been back to Australia since February 2023, I took my mother, misus and daughter for a walk to Darking Harbour. Stumbled pass this place and I just wanted to have a look at the menu, saw Kangaroo which I really want to try while in Australia, but the ladies wanted to go for a walk, after crossing the bridge and the restaurants there did not seem that interesting to us at that time, I just that Kangaroo dish on my mind, so we decided to walk back. Just WOW!!! We went as my son really wanted to try escargot. When we saw the $45 lunch we thought great not to expensive…. The food is AMAZING!!! I’ve paid more at fancier restaurants for less food and lower quality. The service is great too. Happy to eat here again.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adina Apartment Hotel Sydney Surry Hills: Highly recommend Adina Apartment Surrey Hills to stay. It is easy to be a great place to stay when everything goes well but the real test is when it doesn’t. On our recent stay 3 out of 4 of our Adults became  very ill. The staff were amazing, any hour of the night we could call Reception for help and whatever we needed they provided. The care and service we got from the staff was exceptional. Thank you Adina Stayed a Monday night in a 2 bed apartment. They’re tidy and the beds are fantastic. They are very dark, the hotel is very dark and the detail cleaning isn’t there. The basic cleaning is done and it looks good, but move the foot stool or look at the skirting boards and there’s dirt and dust. The pool the unit i stay in is clean and spacious, its a 2 bedroom apartment with 2 bathroom which is a plus and full functional kitchen and laundry machine. the interior is a little outdated but it is fine for me. Adina Surry Hills was perfect for my family - location was ideal as we were able to walk to the SCG for the footy, walk to the Art gallery and to lots of cool coffee shops, gelato store, deli etc, as well as being an easy walk for my 4and 6 year olds to the light rail, bus and train into the city and Circular Quay. The pool was a hit with the kids and the staff were great - especially the reception desk lady (wish I caught her name!) working each morning we were there who chatted with the kids, helped with directions, always had a smile and allowed us to leave luggage and use the pool both before check in and after check out. Rooms were very spacious with TVs in each bedroom, great view and really comfy and clean beds. We appreciated having the beds made for us each day and fresh towels delivered! Only downsides were a few kitchen items that would have been good such as peeler and chopping boards, as well as the outdated bathrooms - these need attention as ours had a broken shower head, a toilet that ran, some cracked tiles etc. For the price and the location though, we will definitely be back! I have been staying here for work regularly for about 15 years. The location is unbeatable, and the actual design of the place is very good.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Castlereagh Boutique Hotel: A comfortable and affordable hotel in the CBD. My room was small but well laid out. Housekeeping was very friendly, and the room well-supplied with towels, extra pillows, blankets, etc. The windows are old and a bit drafty, which made the room chilly during my stay (winter—July); there is AC but no heat. The wifi is very dodgy, disconnecting regularly and so weak that I couldn't use it at times. There is a restaurant on premises but I did not visit it; there are good coffee options in the street immediately outside the hotel. The lifts are perhaps the slowest I've experienced. Overall, an older but comfortable and reasonably-priced hotel in the heart of Sydney. Lovely hotel right in the heart of the CBD with easy access to everything. Staff are very friendly and welcoming. The room itself was nice and clean, a little small, but for the price and location pretty great. Our room was switched after the first night due to the ceiling panel falling down. Luckily we were not in the room at the time.  Reception area is very nice but the rooms are way too small for two people and so are the attached bathrooms.  The rooms are well furnished, perhaps causing them to be cramped. Room service was good. Location is ideal and walking distance to most places. When my partner suggested we stay here, I was a little let down(I know better than to judge a book by its cover)However I can assure you, this is truly one of the most understated hotels,i have stayed at. I had a terrible experience at this hotel. When I arrived at 3:30 p.m., the receptionist, Cindy, who was not fluent in English, was extremely rude and had a noticeable attitude. Despite having a confirmed booking through their website, she told me I would have to wait up to two hours for it to be processed and didn’t offer any alternatives. She told me to wait and then answered the phone without acknowledging me.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hotel Steyne: We had a dog and a child so the Hotel Steyne was a great place to sit outside, soak up the sun, people watch, have a drink and grab some food. Great location right by the beach. Food wise I would highly recommend the steak sandwich but for a healthier option the sashimi bowl was really good too. Our pizza was disappointing - lots of cheese and not much else. Serves were generous. Great location, location/views great, food was good… heater way too hot/unpleasant inside staff said they couldn’t fix it. Bar staff used her dirty fingers to squeeze lime into my drink (so unhygienic!), our drinks and food were made wrong but they fixed it without any issues. Stunk like sewer in outside beer garden. Stayed a few months ago. Awesome pub/Hotel. Rooms are airy, good light, brekky is good. Such a great location and really helpful staff. It has become my go to place now in Manly. See you next week NOISY! Our room was above the night club . Thumping , so loud until 3am. Our room was shaking from the music. Couldn’t sleep until then. Lucky 11am checkout so we could sleep in at least. Mixed feelings about this one, service was on point! The rooms were clean, spacey and cozy, but very noisy, if you're a person who cannot sleep through noise, wouldn't recommend it. The location is great as the beach is across from the hotel, the pub is connected and all the shops and restaurants are walking distance but there is no carpark for hotel customers so you're looking at 80+ overnight plus the extra hours.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Vibe Hotel Sydney: Really well located. Convenient Wilson carpal next door with $15 per day weekend parking. Hotel itself was good but rooms on the older side. Bathrooms in particular used shower+baths which I don’t live. Water pressure not great. But comfy bed and spacious rooms. Stayed in the city with a group of girlfriends after seeing Chicago at the Capitol Theatre and the Vibe Hotel was in the perfect location; walking distance from both the theatre and Central Station, as well as a number of great restaurants. The room was setup for old people who needed assistance, the toilet had guards on which did not alow you to sit on properly. The shower had that many hand rails on, not very good at all. We asked for another room which we got and were promised our bags would be delivered. Got back that night our bags were not there. Service and management were rubbish for a 4 star. Don't know how they get 4 stars My partner and I arrived by the overnight train from Melbourne which was a saga in itself, and the first taxi we asked to take us to this hotel said it was too close for him to drive to... so we shlepped ourselves and our luggage up the hill to the Vibe Hotel - but it was worth it. We stayed in 5 hotels in 5 cities and this was by far my favorite. The bed was the most comfortable bed I have ever slept on.  The room had a tub which was nice to have after climbing the Harbor Bridge in the wind and rain.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Nick's Seafood Restaurant: Excellent view of the wharf!   Very tasty dishes.   We made reservations for a Friday evening and was not disappointed with the table choice and foods.   Fresh mussels were fresh and sweet came in a pot with our choice of butter and white wine sauces.   Clam chowder had more fish than clams!   Ribeye steak was tender and flavorful.    Fisherman’s basket served with soft shelled crab along with other usual shrimps, calamari and fish. Fresh and good quality seafood! The garlic bread is heavenly and the salad also very good. Recommended place to eat. Fresh lobster🦞 was wonderful. We did half half on flavors and they both tasted good, but I would say I loved the creamy one more (forgot its name). Oysters were okay. Garlic breads were great. Definitely coming back! Plan to try their chowder next time I thoroughly enjoyed my dinner here great atmosphere and excellent service coupled with the brilliant food options made for a very enjoyable evening. The Moreton Bay Bug starter was incredibly delicious and the Kangaroo fillet steak was very tasty, quite literately a taste of Australia! I took a friend from overseas because the scenery is so beautiful.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Metro Aspire Hotel Sydney: We booked a deluxe bedroom with 4 beds, and lived there for 3 nights. Everything is perfect except for the very low signal tv with lots of mosaic. The water saving flush was broken. Very convenient location. Very quiet and safe. Highly Recommend. I will rebook in future next time in Sydney👍. This is a good, affordable place to stay in Sydney. My room was spacious, clean, quiet and had good airflow (nice that you can open the windows and have fresh air coming in). The reception staff was helpful and friendly and the area around the hotel is great for walks and exploring. Highly recommend it! I stayed at the Metro Aspire Hotel Sydney for 3 nights. The room was large and quiet, which was a big plus. The bathtub was a lovely bonus as well. Stayed here for four nights, and loved it. Firstly I must congratulate the staffs, every time they were quick to respond to requests and were warm and friendly. I had booked the  cheapest room but it was much bigger than I expected and was great place to come back after a long day of exploring Sydney. The room was serviced every day and the bed was made fresh which I loved. Location is convenient with a quick walk to restaurants and a supermarket. I am glad I found this place and can’t wait to stay here again. Overall it was a good experience - spacious room, good location, and there is an option to top up for breakfast. I booked for 3 pax, so an additional single bed (4 - 4.5 foot width) was provided. It was comfortable enough in my opinion. The bathroom also comes with a bath tub, perfect for fall/winter to warm you up before sleep. Cleanliness was alright. Breakfast was definitely of good value for the price of 20 dollars/pax.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Metro Hotel Marlow Sydney Central: Employer booked and paid for room the week before. On my arrival was told the room booking had only been held by work and I had to pay for it personally would not accept the work card which I had the details of. Staff didn’t really care. Great central location but the beds and pillows are very hard. Hotel is nice and the room was clean and comfortable. This hotel has taken a month to refund our deposit which they informed would only be held for a week maximum. It will be better if the hotel improves their housekeeping services. Good value for money and great location near Chinatown and the tram line. Service was ok but the rooms are dated, wall is too close in front of the toilet and shower head is too low, would be fine for someone no more than 160cm tall. Had a room on a lower floor and traffic noise could be heard. One day I even had a staffer show up to my room unexpectedly at 4.30pm for housekeeping, which felt like an unusual time of the day.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rendezvous Hotel Sydney The Rocks: The hotel is perfectly located in the heart of The Rocks. Staff were terrific, setting us up with a great room with views to Opera House and Bridge. Like others, I'd say the rooms are clean & comfortable but a little dated. Room did have a small kitchenette, and was of generous size. Whilst not 5 ☆ the price was reflective of that, and given the location, perfectly acceptable. Parking is available underneath for $50 day (validated at reception). Worth considering. Amazing AMAZING location! So central to the rocks and circular quay. Super close to restaurants and public transport. Bed was big and comfy, room was clean and the kitchen came in handy! Some things are a little outdated such as the lifts and amenities but overall great value for money and a fantastic location. We stayed two nights in one of the historic Terrace suites. It was not clean. They didn't take away our rubbish. Bed was not made and the pile of fresh towels was left on the toilet seat. Great location,  but grubby room. Very convenient location. Our room was clean with a comfortable bed and rather well warn, a fresh carpet, refitting the ensuite and lick of paint would do the job. Location location….. a short walk to cruise terminal to walk and take luggage. Maybe 5-10 mins walk  We are in our 60s and average-ordinary fitness. Easy walk to circular quay without luggage.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Steersons Steakhouse: Avoid the T-bone! Really enjoyed trying the Tomahawk steak! It was super tender, and the recommendation to cook it medium was superb, we appreciate the guidance! The sauces that came with it were delicious as well, mushroom was my fave. The steak were very nice, especially it was nice to try the kangaroo steak. Locate on the Darling Harbour, nice atmosphere. Good service. Best beef steak in Sydney, and cooked exactly how you order it (order blue)! Worth the money, great location, outside balcony and by the water. just gets very loud in there. This was my first time in Australia, and I definitely wanted to taste an Australian steak. So I was eager to experience it firsthand. I ordered the aged steak. The steak lacked the flavor that I was expecting. I can prepare a better steak at home. The mashed potatoes were overwhipped, bland, and greasy. The bread was a bit stale. I even saw one of the cooks eating and plating food. Despite the disappointing steak and mashed potatoes, the attentive and welcoming service made up for it. The restaurant wait staff went above and beyond to ensure a pleasant dining experience, which left a positive impression on me.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Travelodge Hotel Sydney Wynyard: For the cost and location, I expected a bit more from the hotel. I paid for a room with 3 beds and the space was tiny, the bathroom was something I'd expect in a caravan it was so small. The bathroom door hinges have rust, the outside of the bathroom garbage bin was rusty, and the shower had clearly not been cleaned properly. The only positive feedback I can give is that the staff were lovely and helpful. As for the room, it was overpriced for something that wasn't looked after and maintained. The room at Travelodge was excellent for the price we paid. We initially were disappointed that we got a queen bed because we indicated in our booking that we wanted two single beds, but after returning from dinner on the first day, there were 2 single beds! The service was excellent and consistent. The front desk staff always greeted us and were very helpful. The room was big enough for the two of us, and the toilet was nice as well. The location of the hotel was superb - we were able to walk to almost anywhere we wanted to go to in the area - Darling Harbour, Circular Quay, Town Hall, Botanical Gardens, etc. It was very conveniently located in the centre of many of the attractions, and there were also many restaurants located nearby. It was also right beside Wynyard train station, which was very convenient when traveling to and from the airport. Room size and location is great. We stayed overnight on Christmas Day and the staff were very efficient and lovely. We were able to leave our bags in a storeroom at reception early in the morning when we arrived in the city so we didn’t have to carry them around the city all day. Very basic for the price - no food available on the premises. Check-in could have been handled better. Bed was comfy  but room was drafty and cold - the aircon did not work so requested extra blanket etc. Location is great and it was easy to get around Sydney from there",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Infinity at Sydney Tower: Perfect date night place in the city. The food are amazing and all the staff are very friendly and welcoming. Their truffle menu is the best I have ever try. The Desserts bring this wonderful night to a close. Thanks to my server Nathan, Thomas and Juli, big shout-out to the kitchen team too. I had the honour of celebrating my birthday with my close friends at this upscale restaurant. As the night came to a close, we were struck by the amazing view, but more so by the exceptional food, wines, and service, which truly set this establishment apart as a top restaurant. I want to extend my heartfelt thanks to the chefs, managers, and the entire team for creating wonderful memories for us. Firstly, I would like to say I am grateful they catered for plant based person like me but at the same time if you are promising $220 of plant based food. I would appreciated a little more effort, I had one serving where I got the same thing as everyone else but they had a huge Crustacean piece on top. I would have appreciated a lower price for my meal if that was going to the case. Such a beautiful place, the view is amazing. You can see the whole city throughout your dining. Food was superb, worth every penny! Marten, the guy who looked after us was s kind and accommodating. We celebrated our 10th wedding anniversary here. Will look forward to come back here in the future. Let me start by saying Marten greeted us with great friendliness and attitude. We enjoyed immensely the food, the view, the service. Everything was superb! Definitely recommend it when/if you're celebrating something meaningful or special or just life in general. Definitely and an experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Limani Bar & Mezze: Had dinner here last night - what a find! All the food from starter (battered zucchini flowers) to mains (barramundi fillet & seafood platter) and dessert (lemon tart - best ever!) was absolutely delicious and beautifully presented. Also great location next to Narrabeen Lakes. Excellent restaurant! Great atmosphere, lunch and dinner portions are decent. The barramundi and pasta marinara was some of the best I’ve had in Sydney. The desserts are sublime as well. The staff are always so friendly. The best seafood platter I've had! Great quality seafood and a good size quantity; we couldn't finish it. Great food and very pleasant service, would like to thank Sophiya who gave her best service with everything we needed as expected, will visit again soon. Really good food and great service! It was quiet for a Friday night but the food was great regardless. Not able to enjoy the view during the night so will need to go back during the daylight. Definitely one worth visiting and one where we'll be going back!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Sydney Harbour Bed & Breakfast: The Sydney Harbour B&B has (had?) much to commend it when we stayed there for 3 nights in 2019.  It is centrally located in The Rocks historic district, priced low, and offers lots of atmosphere from their own two historic buildings.  That should have earned it 5 stars from me.  But it earned barely 3 stars from my wife due to several things.  It was badly in need of a vacuuming when we arrived, but the management was unable to vacuum until the next day.  They did not even have an on-site vacuum cleaner that we could use ourselves(?!)  Another thing was that the bathroom was out-of-suite and rather dated; although not shared it was not private.  Another item for both of us was the poorly connected in-room air-conditioning ducting and seal to the outdoors.  A very cool place to stay for people with less expectations, but not so much for seasoned travelers used to pristine accommodations. Not good at all! The location is excellent for the price, and the staff are very accommodating. There's no elevator, so be prepared for a few stairs. The rooms are a bit dated, but they are clean and comfortable. Shared bathrooms, but this is common in the area. The bathrooms are also very clean and spacious. Breakfast was fantastic, as you are given an all you can eat wide selection from fresh fruit, scrambled eggs, roasted potatoes, cereal, bagels, and other food items. My only complaint is that it can be a bit difficult to find, as it's located up off of the street level and only has a small sign that's hard to see. Fantastic experience overall and would definitely recommend to those looking for a bit more peace, quiet, and comfort in the Rocks area. Location is excellent but that’s all it has going for it. Stayed here about a year ago and I was very impressed. Service was amazing, great location and beautiful rooms. We did have to share a bathroom with another guest but the bathroom was always kept clean and tidy.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pancakes On The Rocks: Best pancake place! The flavours were really unique - my fave was lemon meringue 🍋, but apple crumble 🍎 and chocolate/peanut butter 🥜 were great also. Located at 22 Playfair Street, The Rocks, New South Wales, Australia 🇦🇺. Coming to the Rocks is not complete without going to Pancakes on the Rocks. A very popular spot. We only had to wait 5 minutes for a table which is pretty good during the VIVID festival. The food is amazing and the prices are very good for this area. There’s lift access for people with mobility issues. Have wanted to come for years, definitely worth it. Five of five! We went for first time and for sure it will more visits to this nice familiar place. The food was amazing, tasty and warm. The service were fast and everyone was kind. It was a cold and windy day but inside was warm and comfortable. We will return to try every salty and sweet pancake just because worth it! Went on Sunday afternoon slightly after 1pm, there was a 20min wait and wasn't too bad. The breakfast set was really good and the pancakes were big. Couldn't finish 2 by myself. Delicious pancakes, great atmosphere and affordable prices. It’s literally the pancake on the rock that’s located at The Rock. Comfy place to gather and spend time with people you loved.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Nomads Sydney: I had the most amazing stay here! Love this place so much! Staff are always so nice and there are so many cool people. Friends and I stay here every time we’re in Sydney. Prices are awesome and the rooms are super good for the price. Brooke was super nice at check out! :) Would 100% recommend this hostel. Location is perfect. The staff are always so helpful and they go above and beyond. Big shout out to Josh and Laura, they have been amazing! : Don’t go there if you wanna get some sleep. There’s a restaurant/bar that turns into a club from 9pm to 2 am into the same building. I was there from wednesday to saturday, same thing every night. I was in room 215, the bed was shaking due to the bass music downstairs. Maybe the owners should try a night in their own establishment, they’d understand. Mold on the ceiling of shower. Good location though and bed confortable!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Burwood Bed and Breakfast: Had a pleasant experience. Not too sure what is up with all the negative reviews but I had a nice time here. Location was great. Very close to the shops and station. Room was clean but a little small but understandable. Dirty public shared toilet AND SHOWER shared between 15 to 20 rooms. No door on bathroom even. Chat place stains on the walls and desk they only bother cleaning and maintaining the expensive rooms that they advertise, no microwave no kettle no utensils nothing but a fridge and bed. Internet is too slow to be anything functional and worst of all, junkies everywhere and they're noisy. Worst place I have ever stayed by a long long margin. Rude receptionist made me wait outside for an hour and a half before serving me. So, on the 5th of April, my girlfriend and I were kinda tired of the same old scene at home and decided we needed a little escape. We didn't want to break the bank, especially in a place like Sydney, so we ended up booking a night at Burwood Bed and Breakfast, thinking, Hey, it's under 100 bucks, let's keep those expectations in check. But, you know what? It was actually pretty great. The room gave us exactly what we needed – a clean spot to crash, a comfy bed, and some peace and quiet. It's not like we were looking for five-star luxury with this price tag, but the essentials? Spot on. Plus, everything was neat and tidy, which honestly was all we were hoping for.The folks running the place were super chill too. Really friendly and more than happy to help out with tips about the area, making our little Sydney getaway even better. I work for a small charity. We paid over $500 in advance for a room for a whole weekend thinking a homeless person had somewhere safe to sleep over the weekend. We were to find out later the person was sent away for not having enough ID. We contacted the vendor to be told that’s just too bad and they had sold the room to another person and there were to be no refunds. So basically the charity I work for lost $500 and a homeless person slept on the street all weekend. Very sad and unfortunate situation. Have worked in homeless services for many years and have never had an issue like this. Awesome old house perfect for a stop over for events. Close walk to trains, great food, pubs, and Burwood china time.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Travelodge Hotel Macquarie North Ryde Sydney: Stayed here recently for two nights while hubby had an operation at the nearby hospital.  Room was a reasonable size, clean and tidy with a comfortable bed and all the amenities we required. Breakfast offered a good tasty fare but we found the choices for dinner were lacking in quality and over priced. However the bar was a bonus. Happy to say that the staff were all friendly,  efficient and helpful. Thanks for making our stay pleasant. Clean, well-priced room with friendly staff. We were literally a 2 minute walk from the Macquarie University Hospital and a 2 minute drive from the shopping mall. If you or your loved ones are at the hospital, this is the perfect place to stay.  Found a great deal booking online. Parking is extra but the reception let us leave our car there long after check out. Buffet breakfast was very decent. If I found myself in the area again I would definitely stay here a second time. Overall good experience. A couple of things which matters. I was staying for 15 days and the toiletries were of same fragrance. The phone ring is so low that I could hardly hear the morning wake up call given by the receptionist. Though they provide room service, they do very nice bedding. But I hardly saw any vacuum clean up of the room. Since I was there for longer, my room became very dusty. I stayed at this hotel because of its proximity to the university where I was attending a conference. Before arriving I thought that it was rather expensive for Travelodge, but I figured it must be updated in some way and they did have a monopoly close to the university. However, I have been totally underwhelmed by the experience. The lobby does seem updated, But the rooms are dated. There's no place to plug your phone in close to the bed and so it has to be across the room. The bathroom was not very clean when I checked in including hair in the shower. this problem is exasperated because they did not clean my room the first night I've been here. This was after I specifically asked the cleaning staff to clean my room. The front desk staff has been incredibly Pleasant and professional. However, they seem continuously overworked and understaffed. The bar did not open at all on Saturday night, and is open but unstaffed tonight. there's a brand-new Holiday Inn around the corner and I'd highly recommend staying there as opposed to this Travelodge. Clean room linen and towels.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bells at Killcare Boutique Hotel, Restaurant & Spa: I’ve been coming to the restaurant for 15 years and the service and food is always exemplary. I’ve been to weddings, locals dinners mid-week, lunches & drinks on the lawn. Always fantastic. Staff are absolutely delightful and the food is always incredibly impressive whilst still being heart warming. If only we could give a 6 Star review. Stayed here for our 41st wedding anniversary Went there for a Mothers Day lunch. Just had our wedding at Bells in the garden.  Amazing local and setting.  We had a 3 course lunch for our guests. We where looked after so well. The food was out of this world Amazing.  The service was great. Memories for life. Thankyou Bells.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thanon Khaosan: Food was quite tasty and service was good! Ordered creamy Tom yum prawn soup, portion was big and tasty but a bit salty and should contained msg because I was very thirsty afterwards and had to keep drinking water. Stir fry chicken flat noodles was quite nice but chicken was dry and tough, maybe other meat would be better. We ordered three dishes and did have a second bite of the papaya salad. The crab was sooo fishy and bitter, destroying the whole. Do NOT order papaya salad if you still want to go there. Actually I have no idea why there is always crowded in the restaurant. I’ve dined here a few times and am very happy with the quality of the food. Recently I ordered the blended choc drink which was well flavoured. One of the best stop for Thai food and perfectly fits in for the people who is craving for spicy food. Must try place One of the better Thai restaurants in the area. Decided upon Bami Luk Chin Pla (fishball egg noodles) and it was good. Although one comment would be that the waiters should have the (ชุดเครื่องพวง) 4-condiments caddy brought to the table automatically without asking, as I needed to add some flavours to the Bami. So that is one feedback that I needed to give. But otherwise, the food was great, and you cannot leave without avoiding the eye catching  “ขนมหวาน” desserts before going home.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Planet Gourmet Pizza, Pasta - Blacktown: Now under the name of Akropolis. They do really good pizza at great value. They are my go-to local pizza shop. Sesame seeds on the pizza make a fantastic edition and good flavours all around. Highly recommend! 😋 The most ugly and disgusting pizza I have ever tasted in my life! The pizza was so burnt not even my dog wanted to taste it. Shocking customer service and terrible cooks, not happy would not recommend to anyone. Worst pizza ever had. Went in and ordered, even pointed to the Naples vegetarian pizza I wanted and got one with olives and anchovies. I would never have ordered that pizza can't stand anchovies. Will NEVER go back or recommend. What a waste of money straight in the bin. DISGUSTING....Wish you could give negative stars. Maybe if you order on menu log they get it right. The shop was great with customer service and  And full Of happyness they were so kind to me and helpful for me.The pizza was well cook and fresh to eat. the most amazing planet pizza in the world ever eaten. Must give it a go. 5/5 keep up the good work The Pizza shop is under new Management and the new name of the Pizza Restaurant is AKROPOLIS. The service is very fast and good with a lot of changes and upgrades to the decor of the Pizza Restaurant.  We ordered the meat lovers and it was very good with plenty of meat and very tasty.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Royal Exhibition Hotel: I went in for a couple of beers and dinner on a quiet Monday. Didn't stay overnight or in any of the rooms but the dining area was clean enough even if the table was a bit sticky. Service not bad from the young lass and the kitchen lads. Location superb next to Central station. The values for money outweigh any negative reviews on noise. Sure the tram rattles past but not all night. There is a 24hour bar across the street, the noise was minimal. I did stay on a Sunday night though. Rude, meat-head security guards. Tried to get in to have a couple of beers after the races last Saturday with a group of blokes, 3 aged over 60, 1 bloke in his 80’s. Just a quiet, friendly small group. Got spoken to rudely at the door and refused. Fine, we didn’t argue. Security then radioed the pub across the street to not let us in there either. Thanks heaps mate. There are two pasta dishes on the menu. I ordered one, (taglitelle boscaiola) and when I ordered at the bar, I was told that there was no pasta. Not one stick in the whole place. This was at 5pm, just as the kitchen opened, so it was obvious that no one took the initiative to do re-stocks that day. And it was plain that there was no one around the place in charge. I'm sticking with the Crystal Place where they take an active interest in providing pub grub. Popular pub near Central and a good first stop walking to SFS/SCG. Traditional pub rooms - clean and great location.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Delhi 'O' Delhi Indian Restaurant: Amazing dining experience! This gem in Newtown has the best Indian food I've ever had. The service is excellent, our waiter Anoop was lovely, friendly and so helpful. He would always check in to see how everything is and also the owner.  The flavours, in these dishes are exquisite and very generous and the naan. Oh my naan the best ever. Also the prices are so good. I never used to enjoy this cuisine and then this place changed everything for me. I'm so glad. This place is a must try. It's also halal and there are also vegan options and also vegetarian options. From the entrees to dessert you will go on a flavorsome journey you will never forget and you will mark this as a favorite.I'm always coming back for more. This place is terrific. We eat a lot of Indian food and it's definitely up with the best we've had in Sydney. The service was really excellent - friendly, professional and attentive - and there's a good wine selection by the glass. Highlights were the lamb korma and the lemon thyme tandoori prawn. On the list to go back. Went here for a friend's birthday. We are both vegan and whilst a lot of the menu has meat on it, there are quite a few vegan options and a few more that can be made vegan on request. Delhi 'O' Delhi is one of the few occasions where we have disagreed in our time reviewing restaurants. While Sam enjoyed her samosas, butter chicken and mango lassi, I found the dishes to be lacking in flavour (including the highly recommended Kachoria entree and camel curry main). Good atmosphere and the curries have addictive flavours. Would highly recommend the lemon rice.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Georges Mediterranean Bar & Grill: A lovely, lively Mediterranean (Greek) restaurant on the water at Barangaroo. Extensive menu. Efficient service. Very good food. Our Mezze plate for 2 with a bottle of wine was perfect. We sat outside (Winter) and were comforted by the portable heaters. Met up with a group of friends and had lunch here. The food was amazing. I had the fried calamari for entree and Yamba King Prawns with skordalia for a main. Fabulous flavours and good servings. If it wasn't for the salty waitress the service would have been a 5 as well. The maitre d was great. The restaurant was not crowded, the manager asked to wait even though there were several unoccupied tables.  We waited a few minutes, I went again to ask if we could sit and he said he would let us know when we could have a table.  We gave up the table and the place.  I have never seen a customer treated so badly. I had a lovely meal here at George's. The service was great. Food quality and presentation was excellent. Well done!! Beautiful Greek cuisine and idyllic location over looking the harbour. Some of the best Greek food I’ve ever tasted. Definitely recommend dining here!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Watsons Bay Boutique Hotel: What a delight! Not my first time to WBH for lunch, but totally not worth the hike there in my opinion.   We sat in the ground floor inside section which felt a bit like a cafeteria. Would have loved to have sat outdoors but the tables with food were being swarmed by seagulls. We had great experience at the bar . Alex is especially professional excellent costumer service. Had lunch here yesterday with friends and two small dogs! Weather was a bit off but the staff went above and beyond to sort us. This was my first time here and the food, service and staff were excellent. The young lady and guy who had a dog similar to ours were so attentive. Will be back for sure and will tell others to get here. Every time we come to Sydney to catch-up with friends or for business,  we always come here almost everytime straight from the airport.  The atmosphere is great with so much people around and the fiews of the water is very relaxing.  The drinks were great and the food was excellent. wife's fish n chips and my calamari meal just what we needed for alight lunch as were going to a friends place for dinner later that night.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "The Hermitage Campbelltown: Customer Service top tier, very friendly. I can't really rate the food as it was a set alternative menu. The canopies were lovely, the entrees were okay the pork was dry though but the apple in the dish was yummy. Not the tuna Croquettes they were not it. The Lamb and gravy dish was extremely hard to saw through the meat.  I did not get to try the chicken main.  Very cosy clean and tidy establishment didn't know it was in Leumeah. 5 for customer service but the food was a let down We really enjoyed our stay here. Room was great, big enough for us. Centrally located so we could visit family. Customer service was great too. Thank you. Would recommend The Heritage. Nothing flash, but clean and tidy, though starting to show its age, the room was reasonably quiet even though close to a busy road, due to the laminated glass in the large doors that helps greatly. I went there for a get-together, recommended by a family friend! Will not be going back. DO NOT GO HERE PLEASE. Cut my foot on the tiles that are higher then the carpet. All the glasses where in the freezer and stuck to the surface. The water jug was also frozen and shatter in my hand because of that. The water for the spa bath and shower wet cold before you can fill the bath and the light above the bed flickers.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Adria Bar Restaurant: Great service here! We went for NYE (a bit of a late review) and the atmosphere was wild. Shout out to the dj who continued to play bangers well past 12am. When we arrived, we got seated in the best place possible away from most of the crowd! The food was great. I got the ribs and I loved its tenderness and size although the sauce was very sweet for my liking. The dessert was so good and it hit the spot. Our waiter was very nice and we had a good time. 𝗦𝗲𝗮𝗿𝗲𝗱 𝗦𝗰𝗮𝗹𝗹𝗼𝗽𝘀 ($𝟮𝟴): Scallops was juicy with an amazing texture combining with tasty cauliflower purée The beef lasagne was delicious. Service was a bit slow, especially on a quiet night. However, I did enjoy my experience here and would come again to try out some other dishes on the menu. Itzel was very friendly kind attendant. When we placed our order I told her it'd my son's 9th Birthday. When she brought out his pancakes she lit a sparkler for him, it was very nice. The other waitresses were lovely too. Chose this place along Darling harbor and ordered steak and Barramundi, both quite good. I really liked the architectural design of the place because I like wood. Had a quiet and comfortable dinner there and the prices were not bad.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Oxford House: I stayed at the hotel for a bachelorette weekend. I loved how affordable it was and how close it was to the city. I stayed on the street side, and you could hear some street noise on a Saturday night, it might not be suitable for young kids or people that find it hard to sleep with noise. It didn't bother me and the beds were really comfy so I had a great sleep 💫 Overall I would recommend this hotel for a night out in Sydney 🙌 We stayed just for the night to celebrate a birthday with friends from the south coast! To point the biggest highlight of our stay was the staff, front door, reception but mainly the pool bar and GABI the bar manager!! Insane customer service from the moment we arrived until the moment we left, kept the drinks flowing and the energy high! The rooms are small but nice, the pools a nice touch and it was reasonable quite from around 11pm. Thanks so much Oxford House! The staff were amazing from booking directly with them to assisting us when we unexpectedly had to stay an extra night. This was our second stay. The staff are brilliant, especially CJ, who was so helpful and kind. The Oxford suits us as we can walk to St. Vincent's hospital and any other shops that we need. And next to a restaurant AND book shop. Will highly recommend who is seeking location 😀 Just fantastic! I had my 30th Birthday at Oxford House Pool Bar and it was a magical evening! Service was amazing, staff were so attentive and kind and the atmosphere was amazing! Food was delicious and the team were fabulous with the booking, organisation and details! Cannot rave about this venue enough! 🎈💚🥂",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Chat Thai: The OG Chat Thai restaurant that was one of a small few who set the standard for Thai cuisine in Sydney! This place is great to go with a group of friends and share a bunch of delicious dishes. We ordered the Pad see ew chicken, lava omelette, pork sausage, massaman curry, crying tiger and the mango sticky rice. Everything was flavorful, fresh and came out quick after ordering. Although it's quite a narrow and busy restaurant you get a table quite quickly. Foods may be made from good quality materials that made the dishes more palatable. But we also needed to wait 30 mins before entering the shop, its such a little bit unconvenient experience while we were too hungry :( This is still the best Thai food in Australia and the best crab omelette in the world! It is better than all the ones that we had in Thailand, including Michelin bib gourmand restaurants. The food comes out quick and is consistent. The wild ginger pork belly stir fry is the best ever too - perfectly caramelised and so flavourful! Chat thai is freezing this time of hear its so windy and cold.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "I'm Angus Steakhouse: I visited I’m Angus for the first time for a wedding anniversary dinner with my wife. I have been  big fan of Nick’s seafood for many years and wanted to try this only a few doors down and owned by the same company. Absolutely perfect dinner!! Service was faultless, our steaks were cooked to perfection, the red wine jus was superb, wines exceptional, and our wonderful waiter/host (we regret that we forgot to get his name) could not do enough for us. The chef was happy to cook for we two very hungry travellers despite being basically closing time. Very grateful. Been dining here for the past 10 years, year 2014, 2019, 2023, 2024 for holiday. My family and I ordered the Australian Wagyu Beef and Kangaroo Meat. Firstly, the location of the restaurant near Darling Harbour offers a beautiful view. However, the quality and taste of the food were completely unacceptable. I couldn't believe that the Wagyu Beef was covered with black grill marks. I ordered the Wagyu Beef medium rare, but the surface was burnt, tasted bitter, and the meat was tough and difficult to chew. As a tourist from Asia who has enjoyed authentic Wagyu in Australia, I reasonably suspect that the Wagyu served here is not genuine. Alternatively, the restaurant might have thought that since we were tourists and unlikely to return, they could serve us subpar food. It’s great when you find a restaurant with great staff. It’s great when you find a restaurant with exceptional food. When you get both it’s wonderful. Jack your a gem. Sorry I didn’t get a pic of the ribs at the start only after I devoured them! I recommend I’m Angus, enjoy :)",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Melton Hotel: Just had a lovely chunky lamb pie from the Melton Hotel Bistro. This is my idea of a real traditional pie full of flavour. Best pie I’ve had in a longtime. If you like the feel of traditional pubs this pub is great. I highly recommend staying at this pub like accommodation. OVERWHELMING POSITIVE EXPERIENCE!!! Great place to stay for a few nights in Sydney. Affordable rooms, great food, fair priced drinks, friendly service, and a nice atmosphere.  If I ever need to stay in Sydney again, this would be my go-to. Great hospitality and food. However, the vegan poke bowl was a bit plain and lacks toppings.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Captain Cook Hotel: Good little pub to hit before seeing a game at the stadium. Food was decent. Tried their fish and chips. Fish portions were a little small, with most of the plate taken up by the salad. Had food envy with my friend's fish tacos, which were much cheaper and looked better than mine lol. It pains me to have to write this review as I fond memories of this place. Firstly I was at the legendary Green Day secret show here in 2011 (?)- and  a mate of mine used to live across the street so we had some fun nights drinking schooners and playing Big Buck Hunter. Man this place has really taken a dive under new ownership. Extremely rude bar staff, food took over an hour for a chicken wrap because they had two people working out back on a Saturday, and they had the nerve to make out like I was being rude for asking where it was. They have a Saturday Burger and Beer special that isn’t available on game day (even though they are next to a stadium where sport is always on) but on Saturday there was no game on, yet the special wasn’t available because of the Pink Concert. A concert is a game now? Food was awful, they were out of a few ingredients, no salsa for the tacos, and the bread was stale. This once great pub has been gutted because they know they’ll always have overflow from sports stadium next door. Do yourself a favour and go to one of the other, much better, pubs nearby It's not going to wow your socks off, pretty typical pub. But the beers are cold and there's quite a bit of indoor seating so... Called in to the Captain Cook before the Pink concert to have a cocktail. They weren’t serving cocktails because they were “too busy”. They weren’t that busy. They would have been busier had they been serving cocktails. The beers were poorly poured, the staff acted like they were from a small village where outsiders aren’t welcome.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Dunes Palm Beach: Food, service and atmosphere all get a 5 star from me! Recently held my wedding receptions here and guests still tell me how much they enjoyed the food (have to shoutout the zucchini flowers and half shell scallops)! Wedding or casual lunch- the service is great, staff are very attentive and friendly. The atmosphere during the day is so refreshing and enjoyable which then transforms into a romantic laid back vibe for dinner. BEST. WEDDING. VENUE. EVER. Dune Not worth what we paid - friendly and attentive service, but food was subpar. I took my partner for his birthday and we had such a positive, happy experience. The staff acknowledged his birthday, the food was amazing, we could hear each other talk despite the restaurant being super busy. We’ll be back",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Bexley Italian Pizzeria: Having only just moved to my new house near your shop, I thought I'd try the chicken supreme pizza for the first time. It was picked up for me, so that's why I didn't rate the service or atmosphere. If you have hungry kids, I probably wouldn’t recommend ordering here as they can’t seem to manage the amount of orders coming in. Third time I’ve ordered here to be disappointed over delivery time. Food is consistently good but when you have to wait that long, it really isn’t worth it. Communication is definitely not their strong point.  I understand you’re “slammed” but you really need to keep your customers informed on where things are at. I would have fed my tired cranky kids a sandwich had I known the wait would be 2 hours before the pizza even reaches the oven! Waited for 20 m8ns yo pick up my pizza . When I got home it was the wrong pizza.  Then I rang and they apologised - only to make a 2nd pizza as replacement,  and they still got it wrong ! I was not ordering anything unique.  It was a standard menu pizza . Some of the best value for money flavour and topping pizzas I’ve seen in a while - family size is massive (in photos) and super full of topping - bruschetta starter was four decent pieces with tomato onion and basil and so was the halloumi   Starter with salad.  Couple of basic tables to sit and eat in and pretty quick to bring food out. Been driving past for ages , finally parked and tried, pizza was good 👍 My second visit, base was light and toppings menu is extensive, \"Anthony's Special 👍\" look forward to going back and trying more on the menu👍",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Naan Sense Indian Diner: I’ve been here a few times, I love their selections and the portion is always decent. Delicious and friendly service. Highly recommend. Great service and delicious food. Nikita was a great host and she recommended the best dishes. Absolutely loved the food, the flavours of the curries we had were full, well balanced, and paired perfectly with the rice and naan. Service was great, we received some great recommendations at the counter. Definitely coming back and trying their other curries. We enjoy eating Indian cuisine and decided to try Naan sense in Newtown Sydney and absolutely enjoyed our experience. Great value for money and honest, great food. cooked and prepared very well. We would recommend anyone in the area of newton to come in and try their food. Thanks Naan Sense for a great experience im giving you 5 stars because I entered hungry and left extremely happy. Keep up the great work guys. We will be back again Such a small serving for the price and on top they want you to put the tray, cutlery and plate to be placed away. The curry was cold. Won’t be here again. Worst indian food i’ve ever had.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Rockpool Bar & Grill Sydney: Last night, I had an enjoyable evening with friends at Rockpool. The seafood and steak were both exceptional, the pearl meat truly stood out as a highlight—absolutely stunning! As always, the service was impeccable, making the entire experience even more delightful. Highly recommend! Memorable experience of fine dining. Amazing food in a beautiful vintage high ceiling venue - all the entrees were amazing with a special call out to the prawns, they were so succulent and plump with great flavour. The steaks were also cooked to perfection and so juicy and easy to eat. Perhaps the most underrated dish was the Morton bag pasta noodles, it was cooked to perfection and had a delicious tangy flavour that made it so enjoyable. We booked a table for two at 6pm. At 8pm, the waiter brought us the bill and informed us of the two-hour limit, which we understand. However, our dessert took about 20 minutes to arrive, making us feel rushed, especially since it was my partner’s birthday. We also noticed that another group, who had been there longer, was not asked to leave. Initially, I thought it was because they were a larger group, but the confirmation email stated that all reservations are for a period of two hours. After being informed and paying the bill, I felt uncomfortable and embarrassed, fearing someone would come and force us to leave. We hurriedly finished our drinks and dessert, but seeing the next table happily chatting and drinking felt inconsistent and unfair. My partner even had to hold her little birthday cupcake and finish it on the street because there was no time to finish before we left. She was almost crying on our way home, asking why we have to be treated like this, especially on her birthday. The whole experience was traumatic. Overall, it was a disappointing experience on what should have been a special occasion. A very nice dining experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Mamma Teresa Italian Cafe Restaurant: Unfortunately not such good service. The place was empty other than 1 other table and the waiter watched us struggle to get seated with a disabled person but did not acknowledge our presence let alone aid. We waited for a long while to find out what food they might serve when the waiter was not at all occupied until we fetched menus ourselves. We then had to call the chef from the kitchen to order. Saltimbocca which is commonly veal turned out to be compressed chicken. Sorry to say food was bland using low quality ingredients and not seemingly Italian other than in name. Think the dead flower in old water on the table was fairly indicative. . Beautiful entree and main. Best pizza in Sydney! Thin crust and sauce is delicious. Pasta was soooooo yummy. Very reasonably priced. Staff is always really prompt, kind and helpful. Highly recommend. Restaurant + Food + Overall Feeling: A simple, humble and traditional place to dine in. The pastas and pizzas were delicious. It feels like coming home to home-cooked food made by your Nonno or Nonna. Transport yourself to Italy as you step foot inside this Italian restaurant. There is an aromatic smell when you walk inside, like walking inside your grandma’s kitchen. It’s a mouthwatering waft of Italian flavours such as garlic and herbs. Either way, it smells delicious and you instantly feel hungry (if you weren’t earlier), I am very excited about what lies ahead of me on the plate. Now the name says it all. Its food made with Love. The restaurant offered Italian food and pizza. Its set on the main road, so you will need to find parking in the side streets or behind.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Tandoori Hut Newtown: Best food in town While the decor may be somewhat austere, the food is great: Tender and flavoursome. My wife said it's one the best Butter chickens she's had. I had the Bombay beef which was really tender and tasty. We went with a group of six, and had a great time all round! The food was delicious and surprisingly affordable. Tandoori chicken definitely had a spicier kick than we were used to, but god it was delicious. This is good honest Indian and Pakistani food. There's no fancy frills and decor here. All their effort is put in their cooking and the food is sensational. Service is not stuffy, just efficient, which is all you need when you're in search of good food. Judging by the fact your fellow diners will usually be from the sub-continent, then you know you're in a proper curry house. Tandoori hut provides the best indian food in the area. Their butter chicken is out of this world. The venue is overdue for a revamp and would be one of the most popular places on Enmore road if they spruced the place up a bit. But, we love it, we still go and we can always get a table, even on a busy saturday night. Keep it up.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Castle Taj Indian Tandoori Restaurant | Best Indian Restaurant in Sydney: We visited for dinner. Food was good. The place is pretty big. The veggie platter was good. It helps you taste all the starters. Veg dum biryani was good too. Service was good too. The chef cooked the noodles less spicy for kids. They have outdoor seatings too. Toilets were well maintained. The place is accessible outdoor seating, forgot at the entry if there was a step. Castle Taj has a decent ambie ce, staff is very courteous and food is amazing. First time eating in after many take outs. My husband and I relocated from Gold Coast yesterday and were looking for an authentic Indian restaurant to dine in. A salesperson recommended this restaurant to us. Honestly, we were blown away by the food and par excellence service. We had biryani which was very tasty and the amritsari fish was top notch. Their sauces are probably one of the best we have tried. Sumit, the owner’s service is exceptional. He immediately helped us by giving us valuable tips on how to navigate our way in Sydney given that we’re newcomers. We’re very appreciative of his kindness. Thank you for giving us such a wonderful experience. The papadums were more like stale prawn crackers without any taste. The cheese & garlic naan were doughy & rubbery. They gave me a Diet Coke instead of Coke Zero & when I called about it the person working there was rude & said “they’re the same thing”.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Spice I Am: Service and atmosphere were good. The flavour of the food is fine not outstanding. The servings are very small. Among other things we had a whole snapper which was so tiny we felt terrible for the poor little fish that should have been thrown back in. Do not order the fish! You know something is good when you crave a particular dish from a particular place. I love stopping by here after work, or on the weekend with friends. In fact I’ll find any excuse to dine here because it is SO good. I’ve been over 10 times this year. It’s reliable, tasty, fresh and fast. Never change! Actually, I often pass through this area, but this restaurant is too dark to be recognized. The food is delicious and the service is good, and for the price in this city area, it’s relatively cheap and the portions are generous. We were recommended and on the basis of the food, I am glad we went. I think the service is okay and the dish comes very quickly. Lunch special menu is affordable and yummy - though I thought my kra prao would come with minced pork… I may come here for work lunch again to try something else on the menu",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Roden Cutler House: A stunning setup restaurant in the historic Roden Cutler House in Campbell Street Haymarket. I stumbled upon this restaurant when I was meeting a friend who works for AusGrid,  which just happens to be in the same building as this restaurant. We decided to sit down for coffee. First impression was how clean and bright this restaurant is and first class friendly staff. Coffee was nicely prepared and taste awesome. There are so many choices for coffee style but not overwhelming. You can get small dishes to share with great varieties of sandwiches and wraps to choose from. Lovely selection of delicious cakes as well. A hidden gem I might add. The Capitol Theatre is right across from here and also a short stroll to Paddy's Market and World Square shopping centre. There's a wheelchair accessible entrance here. I'm not sure if there's a lavatory here as I didn't ask. If you are looking for down to earth services with great coffee and relaxing ambience then this is a great place to visit. It is good for quick snacks. I love this place Very good cafe and great service Ausgrid head office, great place to work",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Forest Wood Fired Pizza: Very disappointed. Foreign metal object inside my pizza. Offered another pizza but no refund as we ordered through menu log. From reading the reviews after, yep silly me it goes to show they don't give 2 S..ts. live and learn. P.s don't order domino's either you get burnt bugs instead of metal objects! WOW!!  Best pizza we've had in a very very long time.   Staff are very friendly and welcoming.  Can't recommend Forest Wood Fire enough.  So tasty, with a good balance of flavours . Well definitely be back! Pizza was ok, better than your chain restaurants like dominos and pizza hut. Nutella pizza was dissapointing, I was expecting similar to the photo with icing sugar and strawberries but this was all we got. Ordered a Gluten free pizza was a big disappointment. Paid $30 and the base was burnt and horrible. Got a Mykonos Woodfired the base was perfectly crunchy tasty pizza very friendly service well done guys",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Pho Ngon Restaurant: One of my favourite place to buy!  Gets very busy and most popular and demanding dish. Comfort food for a rainy night. The Pho Ngon Restaurant is located in Florence Street, Hornsby, near to the Station footbridge. I parked at Westfield Hornsby and walked over Our regular for Vietnamese. Great food and you can be in and out within an hour as the service is quick. Tasty wholesome food. Well worth the visit. Quick service too.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hotel Concord: The hotel room was nice and tidy. There was a kitchenette and a bathroom in the room. It was one of the best pub meals I've had in a long while. We've lived around the corner from here for a long time but only recently tried this out. We'll be coming back for sure. The loaded schnitzel, rump steak, and kids' cheeseburger were all delicious and generously portioned. Terrible staff attitude from Jordan. Although I love this place, great food, great location, I will never go back in case she is on duty again. Accused us of talking about her appearance in a negative way which was a total lie. When not serving she was sitting customer side with her feet up on the table. Shocking attitude. Food average.   Nice clean bar. Staff rather unfriendly.   If you're close, it's worth a visit.   But I wouldn't bother making a detour. Great local pub!!  Great meals and atmosphere.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Da Lat Restaurant: Great beef pho! Love the soup. Very lovely Beef Pho. Very good service. Great lunch time menu. This local Vietnamese restaurant has become my go-to place for some good, steamy phò, especially on a cold day. We ordered rare beef pho, seafood laksa, spring rolls and rice paper rolls. I was not very impressed with the pho broth, it was bland. The laksa broth was more flavorful but I found it average on the scale of laksa broths. The spring rolls were small and had very little filling in them. Overall a fine place for a quick lunch. Cannot rave enough about Da Lat. We have been to a number of Sydney’s Vietnamese restaurants, and the Phô here is the best (IMO). I’m here right now and the place is packed. The owners are super friendly as well. Love it!",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Charmed by Hanuman Thai: We just have the freshest, tastiest and fastest meals every time we come. Ordered 4 dishes - Tom Kha, crab roll, duck curry and som something beef. The food was good. The staff were friendly. I think is an ok place for a quick meal with the family. I think whoever is running the place needs to pay more attention to simple things like not having chipped plates given to patrons. We had out of 6 plates 4 were chipped! The food came quick enough which is great when you have little kids hungry. The noodles were a little over cooked but the bbq chicken and the stir fried beef were nice. Always go here on my way down from Newcastle and it always delivers! Delicious Thai food, large portions and good service. Food comes out quickly too! Our favourite is the crispy pork belly stir fry. Highly recommend! My partner has already posted photos of the chicken skewers we received. Never in my life have I ever been served a chicken skewer that small. It was literally 1 bite & done. I understand the cost of living & food cost increases, but the portion size was just plain rude. Green curry with tofu had a total of 3 pieces of tofu cut in half, making it 6. The pad thai with crispy pork was really good. Overall a very disappointing experience.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Hilltop Indian Restaurant: Love this place!!! Over priced for poor quality. Extra ordinary service and amazing atmosphere. One of the best in Beaumont Hill undoubtedly. The Butter Chicken was really tasty and cooked fresh, the garlic naan was superb and soft. We had a lovely meal here. Easily one of the best butter chicken we have had! Keep up the quality service! One of the best Indian style eatery in Sydney. Ambience is too pleasant. They have plenty of snacks and meal options from curries to samosas, feel like you are in India. Aroma and spice level is perfect. Taste is awesome. Price is too reasonable as compare to the quality and quantity of food. Staffs are too helpful and polite. Overall had a good experience. Made my day. Will return soon.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Restaurant 317: Absolutely worth the trip to eat here tonight. ALL the food was outstanding! The service was wonderful and cheeky to match our crowd. Lovely wine list and beautiful little touches everywhere, from little strawberries on the edge of the bubbles glass, to lap blankets on the back of our chairs - just in case we wanted them (but the outdoor heaters were well enough). Thanks for such a memorable experience team! We loved every minute and highly recommend your fabulous establishment. Food is of good taste . Beef skewer, chicken pasta,  pizza  and parmesan were very tasty. Natalie was our server and she was the best waitress I have ever experienced. She made the environment feel very warm, comfortable and accommodating. She made it special for my mum’s wedding anniversary that she celebrated without her husband since he was working and spent it with me (her daughter) instead. The food was superb and once again the entire service was amazing. I highly recommend this place!!! We order the grilled seafood platter for one. The squid was excellent as was the other seafood. The fatoush salad that came with it paired well with the seafood. It was just a little bit salty. The pear and rocket salad was a little too sweet but my boyfriend enjoyed it. The prawn pasta was very good too. Simple and went well with everything we ordered. By the way, Gerald and team looking after us were super nice and friendly. Such amazing food and service. SO SO MANY GLUTEN FREE OPTIONS our Waiter Mayanic was fabulous. This was our 3 rd night here and consistently great. We will be back. Please come open a restaurant in Melbourne",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Shakespeare Hotel: Great little pub. Good homely atmosphere. Staff were great. Good prices on beer. Lunch special was great value and the rump (med rare) was cooked right on point. Meat was tender. Going back there for sure. Not far from Central Railway Station, within walking distance. Amazing experience. We had sunset drinks on the balcony overlooking the Tree of Knowledge, delicious dinner in the dining room and cheered the women’s maroons team on in the bar. Sharon and her team were very accommodating, especially to all of the kids we were travelling with. Great old pub vibes. We booked a room upstairs for book club on the same night as trivia and there was no interruption at all. Great little pub with a Big Heart ❤️ very friendly staff and welcoming. Matt the boss is a great publican. Saturday nights attract a fun 🤩 crowd with Drag Karaoke hosted by Pinkie Promise 💃 Nice pub in Surry Hills, interior is great and rustic. No complaints with the food + drinks. They also serve their Guinness properly.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "We Thai Cuisine: Very friendly service.. We have been eating in and picking up take away at We Thai Putney for over 10 years. The food, service and pricing is excellent and great value. Every dish is always fresh and traditional Thai. Highly recommend as a local. Amazing local Thai restaurant in Putney. We had an excellent dine in experience. Very nice local Thai restaurant,  all dishes were flavoursome and fresh, esp Thai beef salad and panang curry were exceptional. Pineapple fried rice and prawns were amazing as well. I have never had Thai food before and I couldn't eat it because it was bad, first time, this one was not only bad but inedible. Ordered cashew nuts chicken fried rice and chicken dim sim (entre). Food was Overcooked and tasteless, both of them. Had one spoon of each and threw them away. Rice was soggy and chicken stiff and dry. Not recommended at all. I paid $45 for this and had to order pizza right after. So unpleasant",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai Khaen Khoon Restaurant: Sunday, 24/3/24 We have been here numerous times and whether we are dining in or getting takeaway, the food is always delicious & the service is great! 🤌🏼 Had a lovely Choo Chee Barramundi Special 😋 My vegetarian meal had chicken in it, this was a breathtaking find due to the meal I ordered being said to specifically be vegetarian with NO MEAT. A shock was sent down my spine as I discovered what was lurking beneath..  I miss you. 🤌 you DIDNT come in clutch. Food flavour was average and service could be better. We had entrees and mains the main was smaller than the entree servings for the price you pay it was not value you for money. We wouldn’t come back in a rush.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "So Good Kitchen: Excellent I will most definitely be going back here again Awesome end of trip dinner. Seafood and wine 1. The chicken pot tastes average and has many small bones, making the experience poor. Expensive Delicious recommendation",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Alberto's Pizzeria: The pizza at this Alberto pizzeria is delicious! We all loved it. There are many different options and pizza types available, so there is something for everyone. The price is reasonable as well. The atmosphere of the pizzeria is nice, and the staff are really helpful and welcoming. Thank you Alberto Pizzeria ❤️❤️❤️ Food here is great (first time I came they didn’t understand and one of my orders was wrong, but it was still good), but for takeaway only. I came to pick up my food and it smelled like cigarettes. Service is not amazing either. \"If you gonna try to test the pizzeria order margherita\" so i tried BYO awesome pizza and cheap Large menu, good prices. Portion sizes are very big. We dined in but will likely have this as a good take-out option. Garlic bread only cost $3 and was a generous amount.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Captain Cook Hotel: We went to the pub to have lunch on Wednesday, we were very disappointed with the service of one male staff. We had a few times good experience dining there before, however this time a middle aged man talked to us very rudely, said that \"You just want cheap food, don't come back!\" We had a roast dinner here yesterday and the experience was very good. Very kid friendly and had the sport on for adults. The roast beef was very good, the Yorkshire puddings were overdone which is my only critique. Had lunch with a group of friends . Room very disappointing compared to photos. Our shower full of mould, toilet bowl inside dirty, not cleaned properly. No brush to clean either. Double room but only one cup supplied, TV remote didn’t work. Great old charm hotel. Nice meal and cold beer. The person who attended us to check-in was very friendly and helpful.",
        "Additional_Info": ""
    },
    {
        "Place_Reviews": "Thai Paragon North Strathfield: Thai Paragon is one of my local restaurants and regular haunts when I’m craving pad see ew after a workout or when my husband and I want to treat ourselves - like tonight! We ordered crispy money bags, a fresh and fragrant soft shell crab green apple salad and a roasted duck pineapple curry which was creamy and delicious. I come here almost once a month and also order takeout from here fairly often. The service is fast and attentive and I have literally never had a bad dish here. Keep up the great work Highly recommended this best thai restraurant in Sydney and also my favourite thai restraurant. Green curry beef，Paithai with Chicken and Chilli basil chicken tastes really good. Just order！Trust me！Delicous！ Me and my husband simply love it, best Thai restaurant ever, Would highly recommend to anyone We had a great time here! Staff were super friendly, food was quick and everything was fresh and delicious! Thank you yum!",
        "Additional_Info": ""
    }
]