{"tweet":"A new  podcast, you say?\n\nWell, why not?!\n\nEpisode 1  \n\nWe'll be on all the usual"}
{"tweet":"Yes. I tend to forget at times.\n\nPS: Funny you asked, I updated my bio just 2 mins ago saying most BBB stat"}
{"tweet":"Openers must have done well to get to 80-over mark (often 2nd new ball). I was curious about aggressive scoring fro"}
{"tweet":"With min 50 runs, 'worst' avg is M Clarke (12.5 avg). He was out 4 times in 12 inns when he entered in the 1st 10 o"}
{"tweet":"Well, what can be harder than No.3 batting in the 1st 10 overs? No.4 doing so!\n\nOnly 3 men even have 200+ runs.\n\nTe"}
{"tweet":"No.3 batting averages in the 1st 10 overs (since 2002 start). It meant an opener got out early.\n\nWith min 200 runs,"}
{"tweet":"Important ODI Super League points on offer for Sri Lanka & South Africa today.  1st ODI Preview:\n\n Key playe"}
{"tweet":"International test cricket may be NSW v Victoria and Tasmania v South Australia this summer"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"_padu I must admit going into the  series, with the season bowling average in the mid-50s after 8 T"}
{"tweet":"Oh WHUPS! lol. \"New Zealand humbled by Bangladesh in T20 international opener\""}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Michael Holding."}
{"tweet":"3\/3 for St. Kitts? St Kitts vs Jamaica Tallawahs Preview:\n\n Key players to watch & stats\n Possible XIs"}
{"tweet":"A paragraph I could not have ever imagined that I would one day be reading"}
{"tweet":"Tammy Beaumont is great to watch"}
{"tweet":"Decent start to the Australian summer of 1991\/92 for Deano \n\nJones went on to score 59 in the 1st Innings of the B"}
{"tweet":"Of those Ive seen LIVE (for at least a few years), my top 10 pace bowlers in no particular order:\n\n- Marshall\n\n- M"}
{"tweet":"Some market."}
{"tweet":"@_rebase   Gee, seems like 1 in 2. Esp. loud-mouthed dictator who is  second-in-char"}
{"tweet":"Both Philander and Rabada have a 33+ average outside home against Top 7; whereas the Aussie duo have better records"}
{"tweet":"With min 100 Top 7 wkts since 2002 start, Top 5 Test bowling avgs:\n\n^McGrath 23.3\n\nCummins 24.3\n\nPhilander 25.7\n\n^M"}
{"tweet":"A score of 120 will be like 220 on this pitch. Conditions very similar to the Australia series."}
{"tweet":"Since today seems to be the theme of bowling strike rates, I decided to colour it for some of you \n\nMin 20 *Top"}
{"tweet":"want to play   with  > is  helping things?"}
{"tweet":"You don't have to imagine. Nathan Lyon averages 40 against Top 7 in Asia.\n\nIf you leave out Banglade"}
{"tweet":"_millan4 What incentives is"}
{"tweet":"Most openers in Asia by non-Asian bowlers since *2002 start*:\n\n- Anderson 23 wkts at 25.3\n- Steyn 23 wkts at 31.8"}
{"tweet":"BBB data groupings are only readily available since 2002.\n\nMost tail-ender (No.8 to 11) wickets in Asia by non-Asia"}
{"tweet":"How do we REALLY know Spring has arrived? Because the ovals suddenly become fields and these little signs start"}
{"tweet":"Batsmen Steyn dismissed the most in Test :\n\n9 Clarke (29.2 avg); also most runs: 263\n\n8 Hafeez (11.0)\n\n7 Se"}
{"tweet":"MOST and LEAST overs per Test by pace bowlers with different minimums.\n\n200+\nBedser 52.0 - Philander 29.4 (Kallis 2"}
{"tweet":"_Cricket scheduled to play  in the domestic one-day cup on the 12th Sept in Perth meaning NSW"}
{"tweet":"Pace bowlers with 4.5 or more wickets per Test, outside home (min 100 wickets overseas).\n\n(Barnes)\nHadlee\nAlderman"}
{"tweet":"Australia wants Afghan team to play in OZ!"}
{"tweet":"I sort of remember seeing Kohli's name at No.4 before the 3rd Test; now the  admin is not even sure of tha"}
{"tweet":"Because Shardul Thakur bats like Ted Dexter!"}
{"tweet":"'s reaction after getting that wicket of Burns  absolute GOLD!\n\nInteresting that Kohli wanted Umesh to mak"}
{"tweet":"Burns & Hameed are never openers for as long as they have a hole in their backside. Shocking yet again"}
{"tweet":"Someone said apparently that tweet killed \"two birds with one stone\".\n\nI felt more like \"two GOATs with one sword\"."}
{"tweet":"You're over-rating Starc again (), this time his ability against tail.\n\nOf pacers with 100 T"}
{"tweet":"Shardul Thakur's epic cameo pushes India to a total of 191 in the first innings.\n\nHow valuable will his innings tur"}
{"tweet":"So Im watching the Caribbean Premier League  and the Amazon Warriors are totally different to the Justice League movie"}
{"tweet":"Im watching the Caribbean Premier League  on telly and the fake crowd noise has virtual vuvuzelas and can we not?"}
{"tweet":"One cant really blame Rishabh Pant for trying that shot.\n\nThakur is now doing the same now (albeit a wicket later)"}
{"tweet":"(Despite Southee's ordinary 1st spell) The whole quality of that  Test would be i"}
{"tweet":"Excellent catch from England's vice-captain to remove Rahane.\n\nTime for Pant to score a whirlwind ton?\n\nHe hasn't q"}
{"tweet":"As  played a substantial part in that stat, I checked VK avgs.\n\nWith Ashwin in the XI,  avgd 56.2, and"}
{"tweet":"LOL!\n\nIn all 'honesty', I don't know. It doesn't take up too many characters out of precious 2"}
{"tweet":"Your stats with dates and associated things are ELITE!"}
{"tweet":"Nasty patch where Jimmy's foot landed at the crease.\n\nHolding went, \"left-handed batsmen won't be too happy with th"}
{"tweet":"Leaving on length can be handy at the Oval; India have done very well so far with that.\n\n batted so well, I c"}
{"tweet":"That view from the camera in the extra cover \/ widish mid-off region showing the striker's stance \n\nIt's such a"}
{"tweet":"33.3 Woakes to Kohli\n\nThat might've been a harmless delivery, far outside off.\n\nBut, what a shot from !\n\n\"Old"}
{"tweet":"Root probably thought now that he sort of imitated Smith's run-scoring rate to an extent, he could also master the"}
{"tweet":"Cricket commentary still hasn't progressed past the positioning of the slips cordon"}
{"tweet":"Some positives for Sri Lanka in recent times with players like Avishka Fernando, Charith Asalanka, Wanindu Hasarang"}
{"tweet":"Every time I hear \"positive attitude\" from England's perspective on  2005 after Lord's, I remember Australia'"}
{"tweet":"It's clear today  why we need someone like Rahul Dravid to be our Coach !"}
{"tweet":"Lunch time discussion on \n\nIan Ward says the pitch looked \"very docile\" at the start.\n\nHolding agrees an"}
{"tweet":"You mean with all these analysts and footage around, the bowlers are so incompetent that they need weeks t"}
{"tweet":"Root maybe didn't make the right decision in London a few weeks ago; but many forgot about it once he made a fine 1"}
{"tweet":"India vs England, 4th Test, Day 1: India lose 3 early wickets"}
{"tweet":"I thought combining number of 100s and runs were somewhat okay; but now they are combining averages (soon they'll b"}
{"tweet":"Are we about to see another  batting collapse ?"}
{"tweet":"Indian openers looked really good in the 1st 40 mins.\n\nI had to skip a lot of pre-match talk & commentary along the"}
{"tweet":"Anyone thinking about a replacement for Pant?"}
{"tweet":"PS: Tweet is not about the non-selection of Ashwin. The reasoning just sounded awkward; perhaps VK was already visu"}
{"tweet":"What confused me even more there was when Athers asked about the second spinner; Kohli's response was about the oth"}
{"tweet":"This is the reason given by Indias most successful Test captain for not selecting Indias greatest (and most in-fo"}
{"tweet":"Mate!\n\nForget all that; this is word-for-word what was said.\n\nNow, really? That's literally the wor"}
{"tweet":"Ahh cricket \nLet's go!"}
{"tweet":"1-1\n\nWho will be on top at The Oval?"}
{"tweet":"I've occasionally seen a few \"make me choose between 2 cricketers\" tweets \n\nIs the answer meant to be the better"}
{"tweet":"The situation in Afghanistan is concerning for many reasons, but for those in the cricket community there is genuin"}
{"tweet":"I thought I'd check the Test batting averages against Indian spinners in India since Jadeja's debut.\n\nWith min 200"}
{"tweet":"Since 's debut, with min 100 runs against Indian pacers, only 2 had a 50+ batting average in Test :"}
{"tweet":"Series perfectly poised.  4th Test Preview:\n\n Team news & possible XIs: Ashwin to play?\n Key players to w"}
{"tweet":"How about No.4 batting in first 10 overs in ODI  (since 2002 start)?\n\nWith min 200 runs, best strike rates:"}
{"tweet":"Thanks to , I'd checked some ODI stats.\n\nNo.3 batting in first 10 overs (since 2002 start):\n\nMin 500 runs in"}
{"tweet":"I meant to check overs 71 to 80; but anyway, 1 extra over doesn't matter too much.\n\nOn a similar note, how about ov"}
{"tweet":"Batting at No.3 in the first 10 overs since 2002 start in Test .\n\nTable has every batsman"}
{"tweet":"Ray Business Technologies organized an Inter House  Match for employees at M\/S BSporty-Sports & Fitness cen"}
{"tweet":"$MATIC   First  & now  , soon it will snowball"}
{"tweet":"Glad 5 tests v  rather than the once customary 3.  Been a real up and down series, but illustra"}
{"tweet":"Many are vocal about feats in Asia being still underplayed by some other nations (players, commentators, fans etc.)"}
{"tweet":"AWAIT VERY SPECIAL NEWS \n."}
{"tweet":"From Season 2 of  Legends\n\nA great Australian journalist, commentator and author, Mike Coward, talks about"}
{"tweet":"Taliban OKs Australia vs Afghanistan Test match:  sporting chance but intl  unlikely to linger long without"}
{"tweet":"Last league game of the season today \n\n Sat 4th September \n\n  2s\n\n SDL Division 3\n\n 13:00\n\nG"}
{"tweet":"Well, it'd have to be one of the bowlers; and pretty much all of them have"}
{"tweet":"Unlucky you; I had more 5-fors and 10-wM than DK Lillee ."}
{"tweet":"Heres the actual incident during the  opener _Cricket in 1982. Norman Cowans made his debut: Englands"}
{"tweet":"_blog Jeez!\n\nI just realised that we havent won a Test in the year of 2021.\n\nSo far, only once in MY lifetime"}
{"tweet":"So, India started the 3rd inns as slight favourites; and further improved since.\n\nIts a great opportunity for Jade"}
{"tweet":"A reminder that  isnt even in Indias first 7 choices for bowling in this series so far, when hes only 1 o"}
{"tweet":"1-1 or Sri Lanka 2-0?  2nd ODI Preview:\n\n Team news: Bavuma out with injury\n Possible XIs & Colombo Pitch"}
{"tweet":"Sports schedule updates: Australian Open Golf & PGA Championships postponed to early 2022; First six games of Marsh"}
{"tweet":"From Season 2 of  Legends\n\nIts difficult to pick a highlight from a great episode.\n\nA simple, but powerful"}
{"tweet":"Richie Benaud followed by 9 different options for MUTE button!"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Check it and  out! Subscribe so you dont miss any of our great cricket content."}
{"tweet":"My clever brother  has just written a book about  for improving sport performance"}
{"tweet":"It's the weekend  how will you be analysing your teams  this weekend?\n\nMake life easy for yourself,"}
{"tweet":"After Nick Compton's expose that  is not picking  only because of insecurity & dislike \n\nNo"}
{"tweet":"Team India trail by 56 runs in the second innings as the play comes to an end at the Oval on Day 2!"}
{"tweet":"Catch  on this week's episode of the Stumped podcast talking about the Kookaburra Smart Ball and our partn"}
{"tweet":"Rohit Sharma Successfully completed 15000 In International Cricket .\n\n |  |"}
{"tweet":"Every time I hear \"99-run lead\", first Test that comes to mind is Edgbaston 2005.\n\nEngland had the lead then, batti"}
{"tweet":"With best batting conditions especially for the type of batsmen India have in the XI, Anderson's 2nd innin"}
{"tweet":"Seriously,Love this Guy  Keep doing this in Next Two Tests too  Done with Bowl and Bat ,next enter as"}
{"tweet":"A few more than Jack Saunders?"}
{"tweet":"absolutely ridiculous  _cricket  shld banned him for disturbing the game and also damaging the pl"}
{"tweet":"Copying what I said in a whatsapp group with an Englishman & an Indian, if England's lead is:\n\n75 advantage India"}
{"tweet":"There have only been 10 individual scores of 80+ by Englishmen aged 23 or younger at the Oval in Test  (Hut"}
{"tweet":"Slow-mo of Holding's run-up, followed by 's \n\nIf Holding's run-up was as smooth as a Rolls-Royce, then Bu"}
{"tweet":"With this particular example, I may give Warnie the benefit of the doubt. But, yes, Shane could've worded"}
{"tweet":"With that wicket of Moeen, Jadeja's bowling average against LHBs (24.89) is better than it is against RHBs (25.13)!"}
{"tweet":"$MATIC Hitting a Big one with"}
{"tweet":"Forget repeated invasions, if even 1 empty plastic tea cup would've landed on field in  es"}
{"tweet":"There have been 75 instances of teams winning with 1st innings scores of 191 or lower. 18 of those took place in En"}
{"tweet":"Checked a couple of Butcher's comments on Sky:\n\nOllie Pope averages 100+ in first-class cricket at the Oval: yes, h"}
{"tweet":"., any chance of getting a  going in honour of deputy Moeen? He has timed them gorgeously f"}
{"tweet":"Hard to fault."}
{"tweet":"Jarvo clearly doesnt know when a joke is over."}
{"tweet":"I guess what Holding and others were talking about at Lunch break isn't too different from what was said here 2+ we"}
{"tweet":"If Shardul Thakur's nickname isn't Supac, then I don't want to live anymore."}
{"tweet":"Yes, I've always thought that; but my disturbing observation happened when  stopped an on-drive fro"}
{"tweet":"Wes Agar on making his debut for Australia and having his brother present him with his cap.\n\nVia"}
{"tweet":"With Umesh taking 150 Test wickets, I was curious to see how he compares against other pacers in Asia.\n\nWith min 10"}
{"tweet":"Is there any  website that details the arm span of all the players? \n\n looks like someone wi"}
{"tweet":"Such a shame for _cricket   \ncant even handle a studip  on field. Wth with security in England ."}
{"tweet":"are letting too many runs pass. Should have brought  on."}
{"tweet":"Australian cricket captain Meg Lanning on the excitement of playing in the side's first test match in over 2 years."}
{"tweet":"Jarvo the goat"}
{"tweet":"When the loud mouth walks in to bat."}
{"tweet":"Its easy to have a  game of your own  club on"}
{"tweet":"India keeps doing the same thing and achieving the same result"}
{"tweet":"Tweeting like its 14 July 2019?"}
{"tweet":"Oddly enough, Kallis made 15 in the 1st inns of that Test. To bat out 122 overs against Australia in that Test was"}
{"tweet":"2 years after debut, 's Test batting average was under 15 before 1997  Test .\n\nH2H br"}
{"tweet":"It's hard to go past Jamieson (and Axar) from recent times.\n\nLooking past just the first few Tests,"}
{"tweet":"Our new kit from  arrived today and we couldn't be happier \nThanks again to _ for the a"}
{"tweet":"LIVE AUCTION 8pm tonight. Great cause  \nPlease donate when you can Goal $100k"}
{"tweet":"Bangladesh continue to dominate in their home conditions.  2nd T20I Preview:\n\n Team news: Finn Allen back i"}
{"tweet":"thought youd like this LC! Very you really!   \n."}
{"tweet":"Paine was right"}
{"tweet":"If they played (most of) their career before ball-tracking or BbB era, their professional"}
{"tweet":"India vs England, 4th Test: Shardul Thakur, Jasprit Bumrah keep India going   # ChrisWoakes"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"A big shout out to _d_pe   and the _ca for the great work on the new resource fo"}
{"tweet":"'That's like sticking a knife straight in my back'\n\nJames Faulkner has opened up on his exit from the Hobart Hurric"}
{"tweet":"Though Holding also said advantage India, now I'm thinking, was that really a 191 pitch (or bowling)? Maybe still e"}
{"tweet":"So unrealistic that even Warne singled him out as a talent excess from the players Australia"}
{"tweet":"If I read you right, Aus will be 3-0 up before Joe Root makes his 1st ton in the  2020\/21.\n\nThis"}
{"tweet":"When you work in graphics & enter in works jersey day competition!"}
{"tweet":"Re: Comment\/QTs,\n\nIt's not necessary to tag players when it's something 'negative'.\n\nYes, the notifications will li"}
{"tweet":"_cleary12"}
{"tweet":"How hard is it to put  package for  on the same day?     in"}
{"tweet":"_cleary12"}
{"tweet":"Enjoying seeing Umesh getting Root bowled, a bowler who deserves credit. Kholi outscoring Root  India's day"}
{"tweet":"If the Taliban gets a womens cricket team up and running and fully supports women being equal contributors to soci"}
{"tweet":"133kph*; but yes, absolutely gorgeous delivery!\n\n*very close to the speed of THAT Steyn's outswinger to Pu"}
{"tweet":"Joe Root in the  series so far:\n\nv Umesh: 8 runs \/ 1 dismissal (9 balls)\n\nv Thakur: 34\/1 (66)\n\nv Bumrah: 1"}
{"tweet":"Umesh related message was after Root clipped a leg side half-volley to FOUR in the 9th over (I was a few mins behin"}
{"tweet":"1400+ Test runs in a calendar year has been achieved by 14 players.  becomes only the 3rd to do it twice.\n\nP"}
{"tweet":"Oh my days, Malan!\n\nCrunches a rare half-volley from Bumrah \n\nThakur, at innings break, had a 33 batting average"}
{"tweet":"This is already India's 2nd highest score IN England in the 2nd team innings.\n\nThe highest score is 510 at Headingl"}
{"tweet":"Rishab Pant gone just after his important fifty \nIndia lead by 315"}
{"tweet":"Koli ne nazar laga di bencho  thakur Saab did it AGAIN. Bravo. The straight drives and Maharashtra have something"}
{"tweet":"Watching the game and \"playing\" all time XI, I forgot to specify both innings of a Test. I'm hoping it was som"}
{"tweet":"Lord Shardul Thakur gone after brilliant 60  \nBrings India in good position with Rishab pant\n\nLead goes past 300"}
{"tweet":"Shardul Thakur becomes only the 2nd visitor to score two scores of 50 or more IN England batting at No.8.\n\nThe last"}
{"tweet":"If you're selecting the (imaginary) best XI of all time for the first 7 teams (up to Pakistan*), has any of them pl"}
{"tweet":"125.5 Woakes to Pant, FOUR\n\nWelcome back,  \n\nWhat a shot!\n\nNot quite the same follow-through, but for s"}
{"tweet":"In case anyone wondered why I would tweet with partnership of 49 and not wait for 50 \n\nWell, a lead of 262 means"}
{"tweet":"Thakur's punches on the front and backfoot are worthy of a LORD!\n\n1st inns top scorer and one of the century makes"}
{"tweet":"As I was watching this fine documentary, I tried to recall *Player of the Match* of every single  Test win by"}
{"tweet":"Virat Kohli needs '158 + 40N' runs in the Old Trafford Test to bring his batting average in England to 40.\n\nGiven 3"}
{"tweet":"Moeen Ali is a greater spin bowler than Jim Laker because he has a better bowling strike rate!\n\nBowling average is"}
{"tweet":"Prediction please. \nHow many runs will India set as a target for England?\n4th Test"}
{"tweet":"Was 's reaction purely to do with getting out or did he also realise that someone else would've been really h"}
{"tweet":"Rahane has to go"}
{"tweet":"Kohli became only the 4th Asian to score 1000+ Test runs in England.\n\nDravid 68.8 avg\nTendukar 54.3\nGavaskar 41.1\nK"}
{"tweet":"Big wicket For england Virat kohli gone for 44 \nIndia lead by 213"}
{"tweet":"Yes, I'm very well aware that Jadeja's bowling average outside Asia is 35+ (& 2.6 to 2.7 wkts\/Test); and even worse"}
{"tweet":"is a walking wicket."}
{"tweet":"What a time for Kohli to score a ton and Pant to smack a cameo. Can India take this game by the scruff of the neck"}
{"tweet":"The commentators still keep talking about !\n\nIndia will set a target well over 300. England openers will exp"}
{"tweet":"New Zealand came close in the 2nd T20I. Can they win today?  Preview:\n\n Team news: Finn Allen & Matt Henry"}
{"tweet":"A big weekend of cricket with the opening round of Qld Premier Cricket. Thanks to s Terry Svenson &"}
{"tweet":"I'm a bit disappointed that you didn't combine the strike rates across formats too!"}
{"tweet":"Tried my hand at some cricket photography today. Really enjoyed my time shooting some  action between Wy"}
{"tweet":"Bangladesh vs New Zealand 3rd T20 Tips & Preview"}
{"tweet":"If you ask me who my favourite bowler is from current Indian team lot, ill say Mohammad Shami"}
{"tweet":"A father doesnt tell you that he loves you. He shows you. Dimitri the Stoneheart\n."}
{"tweet":"Ive heard many cricketers talk about . But, I dont think anyone couldve done a better summary under 1"}
{"tweet":"From Season 2 of  Legends\n\nWhen asked about keeping to the great , Ian Healy said I felt energy"}
{"tweet":"Has Virat Kohli wished his dad James Anderson happy Fathers Day yet?"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Who's up for a game of  at the g? (  by  )"}
{"tweet":"It seems only rain could save England at the Oval now; or do they have anyone in the XI that could play a Jessopian"}
{"tweet":"I doubt England could really achieve anything by bowling part-time spin with the new ball.\n\nEven if they get a wkt"}
{"tweet":"63 overs left today. With Jadeja to bowl mostly from 1 end, they may even bowl more.\n\nEngland were bowled out in <5"}
{"tweet":"Trying to stay awake, I thought that was a stretch; but I received a more outrageous response on whatsapp.\n\n\"Malan"}
{"tweet":"Thakur gets the first wicket (a leftie); and  gets the 2nd wicket (another leftie).\n\nYou ask how?\n\nHad it n"}
{"tweet":"Run out in a test match   One of cricket's greatest sins. Interesting time for Root to enter"}
{"tweet":"T20 world cup 2021, indian cricket team selection expectations."}
{"tweet":"_ And, won 72 of those Tests, still in the Top 10 of all-time."}
{"tweet":"Both English openers making 50 in the 4th innings at home in men's Tests:\n\nBrearley and Boycott v Aus, Trent Bridge"}
{"tweet":"Lord Shardul did it again For India took  1st wicket of Rory burns \n\nIndia need 9 wkts\nEngland need 268"}
{"tweet":"Sleep deprivation is catching up with me; I doubt I can even stay awake till Tea. Look forward to watching the 3rd"}
{"tweet":"First day at the cricket not working in a couple of years.\n\nWhat a day for it! Predictions?"}
{"tweet":"From Season 3 of  Legends\n\nWhen one of Australias greatest Test captains says he never won an argument aga"}
{"tweet":"AWESOME CHAT, GREAT BLOKE, ANOTHER CRICKET LEGEND & COACH JOINS"}
{"tweet":"Day 5 will be exciting \n\nEngland needs 291 Runs \nIndia needs 10 wickets\n\nAll 3 results are possible \nAny p"}
{"tweet":"The _PNG Barramundis are a little over a month away from playing their first ever match in a T20 World Cup"}
{"tweet":"What about Pakistans XI at Bellerive 1999?\n\nAnwar\n- (Hanif)\n- (Younis Khan)\nInzamam\n- (Miandad)\n- (Imran)\nMoin (ar"}
{"tweet":"Thanks to everyone who tuned in to watch my presentation at the _conference. Thanks to  and all"}
{"tweet":"I thought Stuart Broad with the mask on the cover of  2021 was a great idea.\n\nIf by some miracle England dra"}
{"tweet":"My all-time fav Pakistani batsman Anwar turns 53 . What a player he was!\n\nYes, Inzi had his moments.\n\nPS: I o"}
{"tweet":"\"It's not cool to be talented and lazy. It's cool to work hard.\" Loved the conversation with  sport psyc"}
{"tweet":"In the 21st century:\n\n414 Walsh (St John's 2001, was 38 y.o.)!\n\n411 Flintoff (Lord's 2006)\n\n408 Zaheer (Wellington"}
{"tweet":"New Zealand with a great fightback in this series so far. Twitter reactions to NZ bowling Bangladesh out for just 7"}
{"tweet":"Most deliveries in a Test by pace bowlers since 1970 start:\n\n535 Lillee (Adelaide 1976)\n534 Botham (Oval 1981)\n486"}
{"tweet":"Since 1970 start, most deliveries in an innings by pace bowlers:\n\n360+ Lillee x1, Chatfield x1\n\n300+ Walker x4, Lil"}
{"tweet":"England hold firm as Test thriller looms |  |"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Runs on the board concept has been so deeply instilled in me, between these two sides, Id not move the odds to eve"}
{"tweet":"Bowlers to dismiss  5 times or more in Test  (& H2H avg):\n\n7\nAnderson (42.4)\nLyon (58.6)\n\n6\nMoee"}
{"tweet":"India are still huge favs.\n\nCan England get 368 in the 4th inns? Well, theyve only made 368+ once* in 4th inns at"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"There appears to be an opera singer at the Oval. (Sound up)"}
{"tweet":"Daily Sports news from different countries. Must visit to the website."}
{"tweet":"Anderson is 39, and 163.3 overs is a lot for him.\n\nI am not sure why everyone keeps talking about workload for othe"}
{"tweet":"This! When I was a young lad the captain would never risk playing me, despite still holding the club record for und"}
{"tweet":"Warne just said he thinks that Joe Root would have to make 150 for England to win or get anywhere near the target."}
{"tweet":"Just answering all with one tweet.\n\nI was thinking all-time, since I don't really believe Top 7 made of active cric"}
{"tweet":"India all out for 466\nIndia need 10wickets to win \nEngland need 368 to win \nWhat do you think which team will gonna"}
{"tweet":"Well, since England aren't gonna do it, let me ask you this.\n\nIf you have to pick a 'fantasy' Top 7 (must include a"}
{"tweet":"130kmh right arm over is the same as  \n130kmh right arm over is the same as\n130kmh right arm over is the same as\n13"}
{"tweet":"What a shame that only Rahane didn't open his account in second innings"}
{"tweet":"Joe Root's 4th innings batting average is 33.2 in Test .\n\nHis highest score is only 87!\n\nIt's even worse in"}
{"tweet":"England win is not an option anymore. So, there's no point in India batting for >30 mins after Tea.\n\nIndian bowlers"}
{"tweet":"Ind vs Eng Day 4 , Tea \n\nIndia 445\/8 Lead by 346\n\nIndia should declare right now or not ?"}
{"tweet":"v Top 7 since 2018:\n\n- Cummins 97w at 22.66\n\nDaylight\n\n- Hazlewood 58w at 29.60\n\n- Starc 58w at 35.79\n\n- Lyon 77w a"}
{"tweet":"I'm surprised Bedser didn't make the XI at Old Trafford!\n\nPS: Or, go with Laker if England could roll o"}
{"tweet":"If you are a  fan this is your podcast. Listen and subscribe"}
{"tweet":"LISTEN | _cricket - Cricket Expert & Journalist for  - joined _grubelich on  to"}
{"tweet":"Had the pleasure of interviewing Jaydev Unadkat for . A genuinely nice guy, and really enjoyed chatting"}
{"tweet":"Boys are back to talk about the India vs England 4th test"}
{"tweet":"BREAKING MYTHS  \n\nThe story of Hitler & the German Cricket Team \n\nIt doesnt matter if its true, only if it"}
{"tweet":"Liking how Bangladesh and maybe now Sri Lanka are preparing turning tracks in T20 and ODI to bolster home advantage"}
{"tweet":"NEW EPISODE  \n\n- Tayla Vlaeminck previews Australia v India series\n- England collapse gives India the upper hand"}
{"tweet":"Blyth Kybunga cricket club now training 24\/7. Not bad for a little country club. Build it and they will come."}
{"tweet":"NOW | _cricket - Cricket Expert & Journalist for  - joins _grubelich on  to cove"}
{"tweet":"Its always nice to see our neighbours try to show off (their mace).\n\nI was wondering, India have the pull to pick"}
{"tweet":"In Harmisons defence, he probably thinks that Australian team was just a home bully since they didnt win a series"}
{"tweet":"From squad histories to match schedules, MANAN LUTHRA on what to expect from the upcoming Indian Womens Cricket Te"}
{"tweet":"New video out \n\nVICTORY 2-1 | IND VS ENG | Cricket with Himanshu"}
{"tweet":"I've come across a fair amount of tweets on this; so, what's the story behind Michael Holding and Indian team\/playe"}
{"tweet":"I don't know about others, but it hit me differently when I saw a South African cricketer's tweet: \"just stop worry"}
{"tweet":"I guess 210 falls near the mid point of 220-225!\n\nYes,  doesn't work linearly like that. Had the target bee"}
{"tweet":"English fans, how are you feeling about the fifth test?"}
{"tweet":"Tupac Thakur from the  has made my lockdown"}
{"tweet":"Since 's Test debut, best bowling averages for India against opposition's Top 7 LEFTIES (min 10 Top 7 LHBs):"}
{"tweet":"Having seen your other work, I'm sure it's a wonderful piece.\n\nUnfortunately, it's been a while since I"}
{"tweet":"In a list of only 60 over 100 years, it was a tough call between Younis Khan and Inzama"}
{"tweet":"Kohlis reaction every time at the toss"}
{"tweet":"I guess NZ\/Eng\/Aus beating SL & Pak in Asia might be a direct comparison?\n\nAsian team beating NZ\/Eng\/Aus\/SA away wo"}
{"tweet":"On the cricketing front,  watchers will definitely understand.\n\n was also the face of wo"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Since 's Test debut, best bowling averages for India against opposition's Top 7 batsmen (min 25 Top 7 wicket"}
{"tweet":"Jadeja's a great bowler because he has 227 Test wkts at a superb average of 25 (+ 4 w\/T).\n\nRun rate was never reall"}
{"tweet":"match was brilliant. Reckon  should have taken pressure off from  instead, he created. Whate"}
{"tweet":"Minimum 50 wickets, AS VISITORS, IN Aus and Eng in the 21st century, best bowling averages:\n\nMcGrath 19.25\nWarne 19"}
{"tweet":"Best thing about  getting to 100 Test wkts, now I don't have to use unusual min.\n\nSince his debut, min 100"}
{"tweet":"Amazing stuff"}
{"tweet":"So many people are demanding a response, so here's one.\n\nJadeja took 2 wickets (1 LHB) in the 4th inns, defending a"}
{"tweet":"What do you reckon the Don would've averaged at tenpin bowling? Definately more than 99.94."}
{"tweet":"hands   in the fourth , takes 2-1 series lead"}
{"tweet":"4 for 6\n\nWith the series tied and all  wickets in the bag coming into Day 5, England were poised to take victo"}
{"tweet":"_Ability18  Excellent point. Thanks for sharing that clip.  and India's commitment to"}
{"tweet":"1st cricket match in Kabul after Taliban takeover"}
{"tweet":"Suspicious loss by England"}
{"tweet":"_stephen @_AQuietLife_"}
{"tweet":"Well done Indian cricket team for winning the 4th test match. Overall it was win of cricket both teams played well."}
{"tweet":"Any number of changes to T20 World Cup squads can be made without clearance from ICC until 10th October. After that"}
{"tweet":"1st overseas century \nIndia won the match \nRoHitman Sharma Man of the Match"}
{"tweet":"Pakistan head Coach Misbah-ul-Haq steps down, Waqar Younis quits as bowling coach"}
{"tweet":"England vs India 4th Test: India Beat England by 157 runs"}
{"tweet":"Well done   Feels like Gabba 2.0 at Oval \n\nWorth staying  watching Day 5"}
{"tweet":"Name a better Test match team in world Cricket at the moment"}
{"tweet":"Then the sporting world, especially cricket and soccer, should boycott Afghanistan completely."}
{"tweet":"Full video on youtube \n\nIs this is the best Indian T20 Team for WC | Cricket with Himanshu"}
{"tweet":"The only sport you want to play with terrible people is MMA."}
{"tweet":"It is always sad to see careers lost in political discord, but it's sadder to see people marginalised & victimised"}
{"tweet":"Australia played 4 Tests or more in a series 109 times.\n\nOnly 4 times Aus failed to produce an individual 100"}
{"tweet":"Australia v Afghanistan Test in serious doubt |  |"}
{"tweet":"Australia v Afghanistan Test in serious doubt |  |"}
{"tweet":"C.A. should can the test v Afghanistan and invite Ireland out for the test match in Hobart instead."}
{"tweet":"I kind of hope ICC take the issue out of Cricket Australia's hands and withdraw Afghanistan's status as a test nation."}
{"tweet":"If the test went ahead, Cricket Australia would also be accused of supporting the Taliban and the oppression of women."}
{"tweet":"C.A. effectively saying the test can't go ahead if Taliban don't support women playing cricket is the corr"}
{"tweet":"This is why we should cancel the test as well"}
{"tweet":"Right call. Staging it would be a tacit endorsement of a brutal regime. Can't fall for sporting diplomacy."}
{"tweet":"According to a CA statement, the Australia-Afghanistan Test will not go ahead if women in Afghanistan are not allow"}
{"tweet":"Cricket Australia aren't backing down in support of the women's game. \n\nDETAILS"}
{"tweet":"Official statement from Cricket Australia on the Afghanistan Test saying that if women's cricket in Afghanistan is"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Ashwin included in India T20 World Cup squad, Dhoni to mentor team"}
{"tweet":"Every time I mention 15+ years of undefeated home run, I wonder how did Australia pull off that 2nd 16-Test win str"}
{"tweet":"Some of the batting in  has been really disappointing. Players not producing the performances worthy of the"}
{"tweet":"Langer \n\nThe Australian coach has been forced to step back in his role in a crucial call leading up to The Ashes"}
{"tweet":"Surprised Yuzvendra Chahal wasn't included in India's  squad. Still, it's a very strong squad and India"}
{"tweet":"Langer has reportedly been forced to take a back seat with tensions still high in Australian cricket."}
{"tweet":"Looking at the squad this might be the playing XI:\nRohit, Rahul, Kohli, SKY, R Pant, H Pandya, R Jadeja, R Chahar,"}
{"tweet":"The most high profile omission is obviously  . Considering he captained India in T20 series in Sri La"}
{"tweet":"Interesting to see that   and  are in the reserves and not in the main squad"}
{"tweet":"The other interesting selections are  and  both have hardly played in T20Is for India o"}
{"tweet":"Interesting team selections by India for the  . The biggest surprise is  . I like Ashwin a lot and"}
{"tweet":"PCB decided to give a dual rule to Asif Ali \n\nHe will also be the batting coach of Pak during world cup"}
{"tweet":"All teams with players in IPL would have loved to name their squads at end of or in middle of 2nd leg of IPL but th"}
{"tweet":"\"I'd much rather see  provide safe haven for the women of  who have just been banned by the T"}
{"tweet":"\"I'd much rather see  provide safe haven for the women of  who have just been"}
{"tweet":"_cricket  Absolutely disgusting decision to cancel the  at  Obviously saving  was"}
{"tweet":"Yay, BoJo! Let's open the country up. Huzzah to the ! For feck's sake.\n\nThis is what  wa"}
{"tweet":"England v India fifth Test cancelled due to COVID-19 outbreak on Indias team -"}
{"tweet":"Crickets off in the uk"}
{"tweet":"Its always interesting to read many different views from everyone.\n\nI dont express my views when Im not sure of"}
{"tweet":"Simply spectacular"}
{"tweet":"Just like the World Cup, England again got external help to level the series"}
{"tweet":"in \nThe fifth and deciding test between  has been  amid a  outbreak in"}
{"tweet":"England remain the only team to win a Test despite scoring fewer runs than the opposition: at The Oval in 2006 v Pa"}
{"tweet":"Jaskaran Malhotra. An amazing player and a truly nice guy.  Thanks for inspiring us with 173no and 6 x 6. See our"}
{"tweet":"Or extend the record?\n\nEngland may fancy their chances without Bumrah, though its still 50-50 Id say"}
{"tweet":"Manchester Test cancelled after India express apprehension"}
{"tweet":"CANCELLED\n\nThe final Test match of the series between England and India has been called off amid COVID fears. \n\nSTO"}
{"tweet":"BREAKING | The Fifth Test is off!\n\nMORE:"}
{"tweet":"Final England-India Test cancelled after COVID scares |  |"}
{"tweet":"Incredible! Two hours before first ball was due to be bowled and many fans undoubtedly en-route to the game. India"}
{"tweet":"Bangladesh vs New Zealand  preview"}
{"tweet":"Cricinfo reporting it's delayed but nothing from the ECB \nWould be useful to let ticket holders know"}
{"tweet":"Hes one of the successful cricketers on the planet and his partnership with DSC starts within days. Stay tuned."}
{"tweet":"_ was that an accidental great comment or meant to be said great push here for Easy Single  lol"}
{"tweet":"Shakib, Nasum, Saifuddin and Mustafizur expected to be rested for Bangladesh today.  5th T20I Preview:\n\n Te"}
{"tweet":"MS Dhoni is Back \nAs a mentor for T20 WC 2021\n\n_with_himanshu"}
{"tweet":"INDIAN SQUAD FOR T20 WC 2021 \n\n \n_with_himanshu"}
{"tweet":"vs  5th Test Prediction and Playing 11 Changes \n\n_with_himanshu"}
{"tweet":"Here's something to ponder over the weekend. To coincide with the upcoming T20 Cricket World Cup, a legendary crick"}
{"tweet":"Glad to see  back in the  squad but heart goes out for  who's been o"}
{"tweet":"The Taliban rejected womens cricket as anti-Islam, saying it might expose women to attention and, God help them, e"}
{"tweet":"\"It's a really sad state of events.\" \n\nAlyssa Healy hoping to see Afghanistan's women's cricket side return to play"}
{"tweet":"Paine's plan for a \"better\" summer of cricket amid doubts over Hobart Test |  |"}
{"tweet":"A new sunrise, a new start, let's take the blessings of divine Lord and start our day. Happy Ganesh Chaturthi!\n\nHap"}
{"tweet":"A superb tool coaches, players, parents, volunteers and anyone that wants to better themselves or others in the gre"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Andre Russell vs St Lucia Kings in :\n\n50* (14)\n31 (15)\n\nRussell was threatening to go really big again today."}
{"tweet":"A tumultuous few days for Afghan cricket has continued, with skipper Rashid Khan removing himself from the captainc"}
{"tweet":"They are quick with the nicknames for that set to be cancelled Australia v Afghanistan test. One outlet is"}
{"tweet":"So the Afghan test is cancelled. Move the Ashes to Tassy, have 6 tests. Secret   Aust should be boy"}
{"tweet":"Captain of Afghanistans mens team steps down from the role ahead of T20 World Cup, info thanks to"}
{"tweet":"Mr president leading from the front."}
{"tweet":"Great squad for  by . Not surprised with inclusion of . He is India's best spinner &"}
{"tweet":"NEW - Taliban bans women from playing sports including cricket in Afghanistan - REPORT"}
{"tweet":"Is it just me or that ball at 8-sec mark wasn't too far off the Gatting ball!\n\nOkay, not quite, but seriously, WHAT"}
{"tweet":"what a beautiful cricket. 6 sixes in the final over"}
{"tweet":"Test bowling avgs v Top 7 in overs 71 to 90 since 2002, min 20 wkts\n\nTop 5:\nPollock 20 @ 19.45\nSiddle 23 @ 19.87\nSt"}
{"tweet":"_is_Back   Yeah, the men who stand up, the true leaders. They always said Cricket wa"}
{"tweet":"Many Australian bowlers rated Chris Cairns highly.\n\nOnly Imran and Botham scored more runs at a better batting aver"}
{"tweet":"From Season 3 of  Legends\n\n_58 had a terrific start to his Test career. He played 7 Tests in his 1"}
{"tweet":"I thought it would be great step forward, an acceptance of history happening now, of creating better as the people"}
{"tweet":"It's fair to say Australian batsmen didn't travel well in the 2010s; worst decade since 1910s.\n\nCombined bowling av"}
{"tweet":"For everyone on Twitter saying the test match should go ahead, explain to me why Cricket Australia should"}
{"tweet":"From Season 3 of  Legends\n\nEngland's greatest allrounder  was asked to pick the best of the 4 g"}
{"tweet":"I get the anger at C.A. cancelling past tours for generally pretty lame reasons however think about the me"}
{"tweet":"Federation of international cricketers associations  urges the global  community, led by the , to"}
{"tweet":"Watch this space coming in 48"}
{"tweet":"If state borders remain closed through the , which is looking almost certain at this stage, will the state go"}
{"tweet":"I know my opinion has no effect but the Taliban can just go & get fucked over stopping women from playing ."}
{"tweet":"Australias inaugural Test match against  is as good as cancelled after Cricket Australia stated it wo"}
{"tweet":"The world is watching. If the ICC squibs it and allows Afghanistan to play in the T20 world cup, i"}
{"tweet":"Haha, yes!\n\nGuess who else really liked John Crawley?\n\nThis guy () who watched\/fo"}
{"tweet":"_Chopernos  No, that was a week and a half before  (McGrath took his 100th wicket in that game)."}
{"tweet":"Eng, Ind, SL, BD opened with 2 spinners a lot!\n\nWI once: The Oval 1950 (historic win, Ramadhin & Valentine)!\n\nSA on"}
{"tweet":"Its a special shot considering Rabada sort of owns Jason Roy in international .\n\nCummins and Ha"}
{"tweet":"From Season 1 of  Legends\n\nSouth African great Barry Richards talks about batting technique, with a referen"}
{"tweet":"Welcome, Travis Head to , one of Australia's finest talents for test, one day, and T20 cricket."}
{"tweet":"Travis Birt?  He was the other Aussie debutant. You should write his player profile!\n\nBac"}
{"tweet":"Aw the dog on the cricket field and the cat at the footy were such feel-good stories! Thank you! _little"}
{"tweet":"_rounder. What do you make of this 11 for India in the T20 World Cup?"}
{"tweet":"I genuinely don't know what Afghanistan expect Cricket Australia to do. C.A. aren't going to suddenly change their"}
{"tweet":"Cricket Australia hold their ground over cancelled test despite plea from Afghanistan  via"}
{"tweet":"Having a really bad feeling that  isn't going to happen this summer in Australia."}
{"tweet":"A great first enrichment session for our Year 8 students.  Thank you to _Cricket for working with us.  The stu"}
{"tweet":"Two years into crickets reckoning with COVID-19, not even India, England and Australia have total control over the"}
{"tweet":"It seems just over half the names there scored all those runs in"}
{"tweet":"Day after  2006!\n\nHaving just witnessed Symonds & Haydens 150s after Warnes 700th the day before, it wa"}
{"tweet":"Provoking India cricket fans is a successful way to gain lots of followers.\n\n _"}
{"tweet":"Of the 14 nations that AB de Villiers competed against in his 228-match ODI career, his lowest stats (per opponent)"}
{"tweet":"\"It's 50\/50 at the moment.\"\n\nGideon Haigh says there is still serious doubt over whether this summer's Ashes series"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Aww doggo  just wanted to play ball  \nGreat fielding by the pup and probably the most exciting bit of cricket Iv"}
{"tweet":"The  team to play  in December 1934. c\/o"}
{"tweet":"Here's the unclipped version"}
{"tweet":"There's talk of different quarantine requirements for fully vaccinated people coming on b"}
{"tweet":"LOTS of moving parts in the cancelled England v India Test! \n\n Join the discussion on Sports Sunday | Today 10am"}
{"tweet":"Now THAT's a !"}
{"tweet":"As I wind down with no  Test  action I hoped to see, check out s twin direct hits!\n\nP"}
{"tweet":"Okay, Boomer!\n\nI have always wanted to say that on  Twitter; but I never thought you"}
{"tweet":"Big thanks to  for the t shirts. Even though I chose them, this one may be too soon."}
{"tweet":"India played 4 Tests or more in a series 64 times. They never failed* to register and individual ton.\n\nWI 72 times;"}
{"tweet":"12 captains have 10+ wins outside home in men's Test  sorted by W-L ratio:\n\n2.5\nWaugh 19-7\n\n2\nLloyd 23-10"}
{"tweet":"Outside the Lines with Kieran  Kieran Longhurst is back briefly with his thoughts and views"}
{"tweet":"Last game of the cricket season  2 n half hours chasing a ball in the field all while  come away with 2-"}
{"tweet":"It's win or season over for Jason Holder's Barbados. St Lucia vs Barbados Preview:\n\n Team news & possible XIs\n Ke"}
{"tweet":"Construe Length And Start Scoring?"}
{"tweet":"They need to keep persisting until some form of compromise can be reached. Conceding defeat is not the answer."}
{"tweet":"Lala Amarnath reached his century* in only 108 balls. To put this in perspective Tendulkars fastest"}
{"tweet":"Well, stats *may* show slightly!\n\nMcGrath's bowling,\n\nUntil 2002 v Since 2003\n\nTests 91 v 33\nWkts 422 v 141\n5-wI 23"}
{"tweet":"Formidable XI that!\n\nI meant players involved in general, not just limited to the 2 series.\n\nIt's hard to a"}
{"tweet":"in  colours today."}
{"tweet":"Spent a few hours watching and  some  action between Redlands and Sandgate-Redcliffe."}
{"tweet":"Fair enough.\n\nBut, if you have to pick the version of any of those players, which one would you pick?"}
{"tweet":"Only 2 of 54 voted for a scoreline not mentioned in the 1st 3 options.\n\nThis also means England remain undefeated i"}
{"tweet":"Hint: that cricketers name is already mentioned in the tweet.\n\n_Chopernos, any guesses since youre on Compton"}
{"tweet":"Bowlers to dismiss Denis Compton 10+ times in first-class \n\n13\nAlec Bedser*\nBill Johnston\nLindwall\n\n1"}
{"tweet":"Its often amusing to see generalisation of age, and sole focus on overall stats when some people define peak per"}
{"tweet":"Kohlis not even 33 yet. And, he played some fluent knocks though he didnt convert those to big scores.\n\nIts not"}
{"tweet":"Should  cancel the test match v  given the disgusting Taliban rule of Afghanistan?\n\nI think"}
{"tweet":"Never would have picked that - Bangladesh beating  3-2 in a T20 series. Well done . Great to se"}
{"tweet":"From Season 4 of  Legends\n\n_curtly talks about his relationship with the fellow  fas"}
{"tweet":"Another pearler from , this time to a legend he shares the birthday with.\n\nDravid (and few others*) pla"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"This is so awesome . Great result for   and  generally."}
{"tweet":"Official statement from the CEO of the Afghanistan Cricket Board criticising the knee-jerk reaction by Cricket Au"}
{"tweet":"Sad to see Michael Holding retire. His impact in cricket was huge. More importantly was his determined fight agains"}
{"tweet":"Sir Gary Sobers made 1000+ runs from 4 different batting positions in Test \n\nSobers' avg - Rest of WI combi"}
{"tweet":"With Border injured, Mark Taylor captained in an ODI for the first time; and was named man of the match for his 4 ("}
{"tweet":"I'm finally catching up on  's, I mean 's,  episodes.\n\nBrendon Julian calle"}
{"tweet":"PS: Rahane had a very poor India A tour of West"}
{"tweet":"Just before his Test debut, Rahane's first-clas"}
{"tweet":"New Balance making a big move in Australian cricket this season \n\nProviding the apparel for all states: NSW, WA,"}
{"tweet":"I tried to get some footage of the tri-series in Australia; didnt have any luck.\n\nBut, Mark Waughs strug"}
{"tweet":"Some of the most ordinary international cricket on at the moment on Foxsports ch507 European Cricket Championship"}
{"tweet":"Media running around asking every cricket legend they can possibly find for their thoughts on who the next"}
{"tweet":"in 2019, Steve Smith completed one of the great individual performances in a Test series.\n\nHis 2019 Ashe"}
{"tweet":"Well this is looks exciting"}
{"tweet":"It's showtime. Who will win the  Final?\n\n St Lucia vs St Kitts head-to-head stats\n Key players to watch &"}
{"tweet":"From Season 1 of  Legends\n\n talks about his battles against Warne at first-class level.\n\nThe"}
{"tweet":"Whos the greatest TEST batsman out of these 4 Australians?\n\nRetweets appreciated for wider reach!\n\n\n\nTe"}
{"tweet":"From the username to the tweet, there is just too much originality here from Berlin"}
{"tweet":"It's a pleasure to have  join us for a special podcast episode on fantasy cricket!"}
{"tweet":"David Wiese: Beautiful hair and terrific T20 cricketer. Looking forward to the  Final."}
{"tweet":"_Chopernos Bradman the captain was both pro-active and perceptive.\n\nHe could work out batsmens flaws well, and"}
{"tweet":"Hes the type of leader that Australian cricket admires.\n\nGilchrist backs Cummins to succeed Paine as Test captai"}
{"tweet":"_s_i Building momentum may be a broad explanation.\n\nLong strides provide more controlled setup"}
{"tweet":"Who takes the gloves if Tim Paine isn't fit in time for the Ashes?\n\nIan Healy has made his pick |"}
{"tweet":"Nepal Improves In ODI Ranking"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"We're back for the summer. Get around the podcast and give it a listen. Amazing to have  on to kick"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Healys choice to take the gloves if Paine isnt fit for Ashes |  |"}
{"tweet":"Great to team up with you guys for the season ahead  \nBest player from womens & mens in"}
{"tweet":"Congratulations Lasith Malinga on a magnificent career. One of the great white-ball bowlers."}
{"tweet":"For me, Lasith Malinga will have his own place in T20 history. It was well and truly a batsmen's game until he arri"}
{"tweet":"The NSW Blues are going to be playing in retro New Balance kits this year in the One Day Cup. \n\nThey look sick!"}
{"tweet":"Whos the greatest Test bowler out of these 4?\n\nPresent your stats rationale.\n\nI may provide a breakdown in commen"}
{"tweet":"England getting thrashed 3-0 in UAE in 2012 rarely gets mentioned after England's triumph in India soon after.\n\nAny"}
{"tweet":"Of Lyon's 10 worst Test series bowling averages, only 2 involved India ( & ); 2 v Sri Lanka ( & ), 2 v Paki"}
{"tweet":"_  Without massive pitch assistance or scoreboard 'pressure', Lyon seldom performed against dec"}
{"tweet":"3 shots in, nailed it."}
{"tweet":"Semi Final 1 Preview: TKR or St Lucia to progress?\n\n Team news & possible XIs: Faf in doubt\n Key players"}
{"tweet":"Thumbs up if youre ready to go"}
{"tweet":"The final countdown is on until we kick start the 21\/22 Aussie International Cricket Season who is ready"}
{"tweet":"EMBARRASSING SWEATING?        . VISIT NOW"}
{"tweet":"Watch: Bowler effects four Mankads in two overs in ICC qualifying event - even celebrates as if they've bowled peop"}
{"tweet":"There was a WhatsApp discussion on Shane Warne yday (his bday); and naturally the conversation extended to his in"}
{"tweet":"In Tests Laxman was involved, with min 1000 runs, only 3 Indians had a better batting average.\n\nSimilarly, 5 Indian"}
{"tweet":"~10 years leading up to that series, Australia had ~half of world's 50+ avg batsmen; and 2\/3rds of"}
{"tweet":"Whos the greatest Test batsman out of these 4?\n\nPresent your stats rationale.\n\nI may provide a breakdown in comme"}
{"tweet":"won the toss and \n\n  decided to go home"}
{"tweet":"Women's ODIs since 2018,\n\n1+ WL:\nAus 24-0\nSA 26-10\nEng 19-11\nInd 17-15\n\nCollectively,\n\n30+ batting avgs:\nAus 41.5\nE"}
{"tweet":"Replying to  \nI hope  cricket fans call on you to provide a transparent, detailed explanation t"}
{"tweet":"Only 9 players in Test  history have scored 2000+ runs at a 55+ batting average as captains.\n\n3 are active"}
{"tweet":"PCB in 'shock and disbelief' after NZ cancel tour: What's next for the board? Isnt there a broader issue here - th"}
{"tweet":"England will decide this weekend whether its mens and womens teams will honour their commitments to tour Pakistan"}
{"tweet":"Saturday Night (Re)Viewing. \n\nImho, the finest  documentary ever made.\n\nFire in Babylon."}
{"tweet":"Maan ICC really dithering on the issue of Afghanistan do they really want the ugly look of boycotts at"}
{"tweet":"100% winning record with 10+ Tests in a calendar year: Australia in 2006 (also won 10+ Tests in 2002 & 2004)\n\nMost"}
{"tweet":"With multiple Tests in a year, 20+ difference in collective batting - bowling averages in a calendar year:\n\nAustral"}
{"tweet":"Historic Test WIN-LOSS ratio of 1+ against most teams:\n\nAustralia 10\/10\n\nEngland 8\/10\nSouth Africa 7\/9\nPakistan 7\/1"}
{"tweet":"Any time between 1929 and 1948 that I could see Don Bradman score a hundred in test  would do nicely thanks."}
{"tweet":"20+ individual Test centuries by a team in a calendar year:\n\nAustralia\n2001\n2003*\n2004\n2005\n2015\n\nPakistan\n2006\n201"}
{"tweet":"Joe Root's grandfather hits out at the Hundred after England Test shortcomings - wonder if Joe wrote it for him?"}
{"tweet":"Nash spitting facts!"}
{"tweet":"Corker of a story by  in todays  \nEddings the Great Divider Survives for Now \nMake sure you at lea"}
{"tweet":"Itd have to be !\n\nThis video was from . It was surreal, felt like the end of most br"}
{"tweet":"I see.\n\nNoting again that I hardly read follow-ups, given the short turnaround time and the overall urgenc"}
{"tweet":"NZ Govt inflicted irreparable damage to   and your utter disregard for internationa"}
{"tweet":"Ravi Shastris book launch\n Womens cricket in Afghanistan\n Tim Paines bulging disk\n\nLach and Nic preview t"}
{"tweet":". database may need an update, because I can't seem to find"}
{"tweet":"Great to be supporting this weekends Community Cricket World Cup, featuring Brad Hogg and advancing reconciliation"}
{"tweet":"Only one option for me. Rohit Sharma has to be given the reigns!."}
{"tweet":"From Season 1 of  Legends\n\n greatest cricketer Sir Richard Hadlee claims he has almost as many a"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Tasmania hub for beginning of Women's Big Bash"}
{"tweet":"Tasmania hub for beginning of Women's Big Bash"}
{"tweet":"Tasmania hub for beginning of Women's Big Bash"}
{"tweet":"Commentator  expresses his disappointment at New Zealand's unfortunate decision to call off their tour"}
{"tweet":"Very well decision by kiwis you cant play when you have concerns over security, if only Pakistanis had the will to"}
{"tweet":"Everything that glitters is not Gold."}
{"tweet":"It's the weekend  how will you be analysing your teams  this weekend?\n\nMake life easy for yourself,"}
{"tweet":"Before wearing spiked   on an artificial surface, always check with someone to see if the grass can t"}
{"tweet":"Another great day (or night for me) of  European  Championship. They didnt get it done just now but"}
{"tweet":"Wish to see theam wearing this again"}
{"tweet":"It has been proven many a times that  is a bigoted game with the monopoly of the Big Four.  called"}
{"tweet":"John Wright  c. Saleem Malik  b. Wasim Akram\n\nThat was the first mode of dismissal inflicted by the great"}
{"tweet":"Let peace prevail"}
{"tweet":"18-year old  took his 1st Test wicket at Eden Park: John Wright was caught by Saleem Malik.\n\nDid you"}
{"tweet":"Gotta say the  look pretty good!"}
{"tweet":"Right now Im watching the  Championship, the  and  so how good is !  Also Im sleepy"}
{"tweet":"Tour cancellation ECB's decision, not government's, says British HC to Pakistan - more double standards from the id"}
{"tweet":"Apologies for no episode this week due to busy schedules. Will be back next week!"}
{"tweet":"Check out the Free IPL interactive dashboard here"}
{"tweet":"The numbers will look so underwhelming that it'd feel like a waste of time.\n\nI was l"}
{"tweet":"Flicked over to watch the European Cricket Championship. Couple of heavyweights in Romania & Hungary tussling it ou"}
{"tweet":"If you're defending 150 in the last session of Day 5 on a road, economical bowlers are important.\n\nIf you're defend"}
{"tweet":"LISTEN | _cricket - Cricket Expert, Broadcaster + Journalist for  - joined _grubelich on"}
{"tweet":"Women's ODI\n\nEngland v New Zealand \n\n-England scores of 50 and 40 after 6th wicket falls.\n\n*Look for decent 'total"}
{"tweet":"NOW | _cricket - Cricket Expert & Journalist for  - joins _grubelich on  to cove"}
{"tweet":". has joined forces with Aussie music superstar  to launch the upcoming summer of  an"}
{"tweet":"Kookaburra  x  The Richies \n\nWere proud to announce our partnership for 2021\/22, and were very excited that Kooka"}
{"tweet":"During 's unreal 25-match win streak in ODIs, their collective batting average was 42.8 at 5.4 RPO"}
{"tweet":"Time to bring out my backup cup"}
{"tweet":"Great effort  for a convincing and dominant first win.\nKeep bringing it on for the rest of the seas"}
{"tweet":"Aussie women flex their  in game 1"}
{"tweet":"I know it is well established but Meg Lanning is an absolute gun. Walks to the crease and her bat looks 3 times wid"}
{"tweet":"Only 3 women have 50+ batting averages among those with 2000+ ODI runs:\n\n- Meg Lanning 53.8 (not including the ongo"}
{"tweet":"LISTEN|  joined  on  to chat all things  and"}
{"tweet":"wins state funding to help upgrade local  facilities"}
{"tweet":"From Season 4 of  Legends\n\n_curtly talks about his mothers influence in taking up cricket.\n\n405 wi"}
{"tweet":"Similarly, most runs during Australian women's 24-game win streak in ODIs (min 500 listed):\n\nHealy 1287 at 56.0 (10"}
{"tweet":"Excluding the ongoing  game, most wickets (min 15) for Australian women in ODIs during the 24-game win stre"}
{"tweet":"No. 1 Sportsground set to celebrate centenary with makeover"}
{"tweet":"Leadership! \nNo favourites, only worried about the future of Indian cricket. Young Venkatesh, the door has opened,"}
{"tweet":"Are you a cricket coach over 18 years old? Please tell us how you use feedback & technology within your coaching! T"}
{"tweet":"Steve Waugh is an outstanding strategist who knows how to lead in a high stress, complex environment. He'll share h"}
{"tweet":"Calling all production houses, OTT platforms, TV channels, clips buyers, telcos and more!  Feel free to send me a"}
{"tweet":"NOW |  joins  on  to chat  and  \n\nLISTEN LIVE |"}
{"tweet":"Pakistan is right next to Afghanistan which is now under terrorist control so I'm not why they're surprised that co"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Let the games begin!  \n\nThe international summer of cricket starts TODAY \n\nAustralian  Women's Cricket Team wi"}
{"tweet":"Let the games begin!  \n\nThe international summer of cricket starts TODAY \n\nAustralian  Women's Cricket Team wi"}
{"tweet":"'Failing a member of their Cricket fraternity ' \n\nEngland's withdrawal from tour of Pakistan lashed."}
{"tweet":"Shameful decision by ECB before this NZ incident there was no covid bubble fatigue or whatsoever. T"}
{"tweet":"Funding Boost For 25 Major Events As  Proves Value Of"}
{"tweet":"Shahid Bhai I have ordered this t-shirt to show my love for the game, let's start buying to support"}
{"tweet":"Let's buy something, Very good initiative"}
{"tweet":"Ramiz Raja: \"pehle toh nishane mein ek team thi, our neighbours. Ab waha 2 aur include karde\"."}
{"tweet":"Dont need to panic  \n\nKeep Calm Rcb Fans and trust the ability of the team"}
{"tweet":"cancelled their Men and Women tour of  later this year."}
{"tweet":"Never underestimate the power of the rank full toss as a variation delivery.\n\nAlthough Lloyd Pope does try it a lot"}
{"tweet":"From Season 1 of  Legends\n\n talks about the \"raising of the ball\" for 5-wkt hauls."}
{"tweet":"From Season 1 of  Legends\n\n great  talks about his best Test innings.\n\nIt is not e"}
{"tweet":"5 centuries in the  season opener, along with 5 half-centuries. A good outing for the batsmen on a"}
{"tweet":"'Hat-Trick' \n\n now this season's highest wicket taker so far. He is soon becoming a serious contende"}
{"tweet":"One of my best mates, with ~zero  knowledge*, lives in regional VIC and I haven't seen his family in a whil"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"coming soon to"}
{"tweet":"64 Tests\n 2,914 Runs\n 195 Wickets\n\nRead More"}
{"tweet":"yesterday at Karen Rolton oval off Port Rd in Gladys Elphick Park \/ Narnun"}
{"tweet":"Dear Melbourne,  won his 100th race overnight, the US took back golfs , there has been inte"}
{"tweet":"Park Oval - lighting proposal"}
{"tweet":"Melbourne    claim AFL gf over Western Bulldogs. Their first win in 61 years.  \nMelbo"}
{"tweet":"Thats our Captain Virat Kohli"}
{"tweet":"1st Victory after 7 Losses in UAE For RCB\n\nGreat comeback by RCB Bowlers"}
{"tweet":"bringing up his century"}
{"tweet":"World-class players from all around the world.  is fantastic."}
{"tweet":"The only thing more uncertain than Life is that next ball in !"}
{"tweet":"Dear Perth, No.\n\nMelbourne and Sydney have done the hard yards and should retain their traditional spots on the cal"}
{"tweet":"Mixed Stream"}
{"tweet":"._Cricket asks for an  series reshuffle  including Boxing Day  due to  border concerns"}
{"tweet":"The Laws of  are being updated. This is the new penalty for excessive sledging."}
{"tweet":"Proud moment for India\n\nIndia have ended the 26-Match unbeaten streak of Australia in ODIs"}
{"tweet":"Just a little boy loving watching the"}
{"tweet":"\"Can Gossie do it?\" (Seriously, this commentaryI did not stop smiling!)\n\nBut, yes she can! Jhulan Goswami hoicks o"}
{"tweet":"Indeed. Stand tall  for holding the streak for so long but it had to end somewhere and"}
{"tweet":"Well done India   Takes a decent effort to beat this record breaking Aussie team"}
{"tweet":"Cracking finish here to a bumper weekend of sport"}
{"tweet":"Only for"}
{"tweet":"With all these run out attempts, any chance an Aussie bowler can get to the stumps?"}
{"tweet":"Hmm, Australian bowlers struggling against left-handed batters  where have I seen that before?\n\nWell, that's 202"}
{"tweet":"Losing Sophie Molineux's 3 overs could be huge for Australia now, with India only needing 62 in the last 10 overs."}
{"tweet":"The moment you take your first international wicket for the !\n\nCongratulations Stella Campbell"}
{"tweet":"India are still favourites here, with < run-a-ball needed.\n\nTheir death bowling is either out-of-form or inexperien"}
{"tweet":"It's officially  season!"}
{"tweet":"WOW, what a catch by Molly Strano!\n\nYastika Bhatia played a magnificent innings: 64 off just 69.\n\nPS: Phew, I was a"}
{"tweet":"After 27 overs,\n\n- Australia 4\/99\n\n- India 1\/150, requiring only 115 in 23 overs.\n\nThat's a huge 'lead' of 51 runs!"}
{"tweet":"So far in this series, Ellyse Perry has conceded 103 runs without a wicket in 14 overs (even her T20I Econ is 5.2 v"}
{"tweet":"It was a bit sad to see the awkward follow-through of Ellyse Perry, post-injuries!\n\nOn top of that, she's struggled"}
{"tweet":"After 22 overs,\n\n- Australia 3\/78\n\n- India 1\/110, require 155 in 28 overs.\n\nAll the Indian batters have gone past 2"}
{"tweet":"A nice little refurb finished off with our RT17 refurb stickers."}
{"tweet":"International  in Mackay. Magic day for it. Theyve gone 26 games without a loss. India are on fire though"}
{"tweet":"The _Blues took the win today against \/ in this mornings T20  match. Led"}
{"tweet":"What a good night it was"}
{"tweet":"Highest batting strike rates in Women's ODIs, with minimum 500 runs:\n\n- 116.6 A Gardner\n\n- 101.7 A Healy\n\n- 96.7 C"}
{"tweet":"Good opportunity for India to end Australia's streak.\n\nGood pitch and conditions, batting confidence from game 2, a"}
{"tweet":"Lovely morning to watch some  on the tv - and food for thought in the commentary from  Differe"}
{"tweet":"Great pickups for the Sydney Thunder in the upcoming WBBL!"}
{"tweet":"Shattered to hear Joffra Archer won't be sending down thunderbolts at Smith and Marnus in the  this summer. M"}
{"tweet":"I thought the catching and fielding criticism were a bit harsh in the last game, and today to an extent.\n\nBut, wick"}
{"tweet":"So, is it just me or does the makeshift black sightscreen at Ian Droney Oval () look like it's trying"}
{"tweet":"Highest 2nd innings scores against  in ODIs since 2018 start (during THE streak):\n\n236\/9 NZ, Perth"}
{"tweet":"And rinse and repeat for Beth Mooney"}
{"tweet":"Nice 50 Ash Gardner!"}
{"tweet":"Highest successful chases against  in ODIs:\n\n- 276\/5 NZ, Auckland 2017\n\n- 261\/4 NZ, Chennai 2007\n\n-"}
{"tweet":"How good live stream of Hong Kong Womens premier league on FairBreak YouTube channel! Great initiative by"}
{"tweet":"Almost halfway through the innings and another batter departs.\n\nEllyse Perry caught on 26. Ash Gardner heads out to"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"WA Cricket pitches plan to host Boxing Day Test as WA harsh border restrictions look set to derail Ashes schedule |"}
{"tweet":"Jhulan Goswami strikes early! \n\nDismissing Rachael Haynes for 13 in the 9th over before seeing off Meg Lanning ju"}
{"tweet":"how is there an episode of  that doesn't cover TWO international Australian performances ?!?"}
{"tweet":"So is this just a Victorian sports show now?"}
{"tweet":"Magnificent day for Day 3 of the Sheffield Shield  v _Cricket LIVE on the  websit"}
{"tweet":"When your new government made it impossible for  to continue to play  the"}
{"tweet":"I just checked annual LHB batting average worldwide, all Tests, batting in Top 7:\n\n1"}
{"tweet":"Since the start of 2019\/20 season, it's even more remarkable.\n\n2016\/17 to 2018\/19: 134 at 16.8 in 7 matches\n\n2019\/2"}
{"tweet":"Well, the story is never complete without highlighting Cullinans struggles against !\n\n1st inns:\n.4 1."}
{"tweet":"Maybe there'll be some  promo after the game"}
{"tweet":"Jokes aside, I often wonder if Viv was as rigid as some of the modern greats with the batting position, how much"}
{"tweet":"reactions wouldve been:\n\n- Viv Richards was selfish to harm his teams chances\n\n- He shouldnt h"}
{"tweet":"@_vanillawallah Youd be surprised how modest Justin Langers batting record was against (some of) the bowlers who"}
{"tweet":"Of all the English batters to make their Test debut in the last 50 years, Joe Root will likely be  in most people"}
{"tweet":"Most wickets taken by PACE bowlers in a Test series:\n\n6-Test:\n- 102 Aus in Eng, 1981 \n\n5-Test:\n- 94 WI v Eng,"}
{"tweet":"I reckon it would be cool if they played the IPL in a different country each season"}
{"tweet":"Before you decide on leather or other material for  , you should understand what it offers. Lets ta"}
{"tweet":"From Season 1 of  Legends\n\nArguably Australia's greatest post-WWII batsman, Greg Chappell, recalls the best"}
{"tweet":"By the way, Gilchrist in World Cup Finals: 260 runs at an average of 87 and strike rate of 138.\n\nAll"}
{"tweet":"If only  was around during the 2003 World Cup Semifinal.\n\nImagine the number of hot takes Symonds, Lee and"}
{"tweet":"And to think that 136 wasnt even the best Test knock played against that great attack in that year!\n\nOn a"}
{"tweet":"Babar Azam statpads against minnow teams and boosts his already low strike rate. Massively overrated."}
{"tweet":"Preparations are well underway for this years tournament, stay tuned for player registration information over the"}
{"tweet":"How do you feel about 'the spirit of cricket' as a concept? \n\nThese were former Indian cricketer 's"}
{"tweet":"This pretty unpopular opinion among men cricket fans I know I actually love watching women test cricket just as muc"}
{"tweet":"WBBL:  and   Rodrigues for Melbourne Renegades!"}
{"tweet":"India batter Punam Raut has produced a remarkable piece of honesty on day two of the women's Test against Austra"}
{"tweet":"Play Western Australia Premier Cricket Fantasy on \n\n $100m Salary Cap\n Pick 11 Players"}
{"tweet":"This Womens Test Match between Australia and India now makes it 4 out of the last 5 Womens Test Matches to be aff"}
{"tweet":"Australia need to let viewers know when to change channel."}
{"tweet":"Channel 7 looking to increase comedy content? Chicks chucking hard leather balls at other chicks holding willow."}
{"tweet":"Play Tasmania Premier Cricket Fantasy on \n\n $100m Salary Cap\n Pick 11 Players\n Captain &"}
{"tweet":"We should appreciate every older adult's contributions to the world and take care of them\n."}
{"tweet":"Live: Aussie bowlers need to make inroads after rainy first day against India\n \nBlog @"}
{"tweet":"Despite grim forecast the sun is shining at Metricon Stadium and almost certain to get underway at 2pm in the women"}
{"tweet":"_moinak   Im disappointed with the video guy for not showing the golden duck Warnie g"}
{"tweet":"NSW and Vic may not play before the BBL break. Total disaster with the Ashes coming up."}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"\"People like Kevin like to get themselves a little bit of exposure in the media whenever they can.\"\n\nPaine hits bac"}
{"tweet":"CV partners with  Blessed Sunscreens"}
{"tweet":"\"If you want to know anything about any topic in the world Jack, just ask Kevin, he is an expert on everything.\""}
{"tweet":"LATEST ARTICLE! This week, a tale of three skippers. Former Aussie cricket captains? Sydney is crawling with them!"}
{"tweet":"Now that Batsman & Batswomen are Batters, what are we doing about 3rd Man and those 'insulting' Silly Mid Off and S"}
{"tweet":"- Smriti Mandhana \n\n- Australia's fielding \n\nAll the major talking points from a rain-affected opening day below."}
{"tweet":"Journey for Sunrisers is over for  , \nRajasthan and Punjab hanging in there by a thread\nDelhi & RCB are wel"}
{"tweet":"Is this connected with the  hawkeye dismissal system?\n\n  _cmail"}
{"tweet":"The weather was the winner today in Day 1 of the Women's Test between the  and  \n\nCat"}
{"tweet":"Captaincy done right."}
{"tweet":"What a game that was! It was a tie, IIRC?\n\nBevan made 130-odd batting with the lower order."}
{"tweet":"Sreesanth took only 27 LHB wickets at a bowling average of 46.1.\n\nHe averaged under 40 only against Wi"}
{"tweet":"Lanning may regret the decision to bowl first, as India didn't have to bat under lights for too long. Having said t"}
{"tweet":"My favourite challenge in the nets! Facing .khan19"}
{"tweet":"Anderson indeed took a hit in 2021: taking 6 wickets in 672 deliveries at an average of 44.7.\n\nAnderson against LHB"}
{"tweet":"_man0 Ishant Sharma against LHBs\n\n- Overall career*: 113 wickets at an average of 33.0\n\n- Until 2"}
{"tweet":"Well, that's one way to set a cricket field \n\nOutstanding from the  team.\n \nCredit: Cricket Distri"}
{"tweet":"3 other right-arm pacers had sub-25 bowling averages against LHBs with 40+ scalps.\n\n1 active:\n- Mohammad Abbas 41 a"}
{"tweet":"Best Test bowling averages by right-arm pace bowlers against left-handed batters (minimum 50 LHB scalps) since 2002"}
{"tweet":"Dominic Baker is one of the best things to happen to  for a very long time. Strong and decisive. And a t"}
{"tweet":"I am fairly certain no Indian hit a SIX against an Australian named McGrath in Test  before tod"}
{"tweet":"Love that the Aussie girls dont have a big sponsor slapped across the front of their Test strip. Hopefully the men"}
{"tweet":"I'm glad to hear that Marcus Harris signed a 2-year deal with Glos. He has had a very good home summer in 2020\/21 a"}
{"tweet":"Cricket Career Mode with TITS MCGEE"}
{"tweet":"Free IPL interactive dashboard here"}
{"tweet":"Tocumwal vs Barooga A grade. 2021. 16 year old  bringing the heat for Toc. Just a bit sharp."}
{"tweet":"Excellent masterclass\/interview of  by .\n\nWhen asked about \"the hardest bowler to face in world"}
{"tweet":"Also because McGrath didn't play in 1998.\n\nTalking of, that'd have been some contest against Tendulka"}
{"tweet":"Jos Buttler has become the latest English player to cast doubts over their  involvement.\n\nIn our new ep, we d"}
{"tweet":"I can smell the rain !\nIts gonna bucket down shortly"}
{"tweet":"It doesn't have to be that way. If people really want to get rid of it, make it so that once the batters c"}
{"tweet":"Its coming down hard her at Metricon Stadium."}
{"tweet":"Believe it or not, there hasn't been a \"caught Healy, bowled McGrath\" entry for Australia (men or women) against In"}
{"tweet":"congratulates Annabel Sutherland and  Wareham"}
{"tweet":"When  elected to field 1st in Test :\n\nWON by 9 wkts (v IND) @ Richmond, Melbourne 1991\nDRAW"}
{"tweet":"Hi  is the a good way to complain to  , the only public seats are in the FULL QLD s"}
{"tweet":"The 50 partnership is up between Smriti Mandhana and Shafali Verma. India 0\/54.\n\n Listen here:"}
{"tweet":"Indian fans excited for Test match against Australia at Gold Coasts Metricon Stadium."}
{"tweet":"Live: Australia and India to face off in highly-anticipated day-night Test\n \nBlog @"}
{"tweet":"From Season 2 of  Legends\n\nSir Garfield Sobers explains the reasons behind his compulsive nature to hook pr"}
{"tweet":"Test cricket returns today!  Match + Fantasy Preview, by _yash2307.\n\n Possible XIs\n Key players to w"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The hypocrisy of this by Lyon is astounding"}
{"tweet":"Great Australia"}
{"tweet":"Maxwell stars as Virat's RCB beat Rajasthan Royals by 7 wickets"}
{"tweet":"Phenomenal record is an exaggeration for a bowler averaging ~30 in RED ball (i.e. DAY) Tests, especially playing"}
{"tweet":"_Chopernos Were you in a coma from 1957\/58 to 1967\/68?"}
{"tweet":"Warner\nKhawaja\nLabuschagne\nSmith\nPucovski\nGreen\nPaine\nPattinson\nCummins\nHazlewood\nLyon\n\n12th: Starc\n\nOpeners are pr"}
{"tweet":"New vid \n\nMumbai exit interview \n\n |"}
{"tweet":"An excellent series from Australian allrounder Tahlia McGrath! \n\nIt really has been a coming of age moment in her"}
{"tweet":"Australias series victory over India was achieved in much the same manner as their closing win in the final Twenty"}
{"tweet":"England have named their Ashes squad \n\nThoughts?"}
{"tweet":"Indias slow start with the bat only have themselves to blame tonight, and how about the pure clean hitting to fini"}
{"tweet":"England's Ashes squad: Root (c), Anderson, Bairstow, Bess, Broad, Burns, Buttler, Crawley, Hameed, Lawrence, Leach,"}
{"tweet":"What a day out for Muhammad Waseem who scored 107* off 62 balls out of UAE's 139\/3. That seals a 2-1 series win ove"}
{"tweet":"England's Ashes squad is out. Not alot of surprises in there. Maybe Bairstow but he did show he still had the game"}
{"tweet":"You know the  have plenty of bowling depth if  hasn't had a trundle yet"}
{"tweet":"Southern Smash  \n\nDecember 28th & 29th 2021\n\nNominations are open, head to our Facebook page for more info"}
{"tweet":"Wade 'reading between the lines' and seeing a new role ahead of T20 World Cup."}
{"tweet":"My favourite moment  Plus, A few pics from our journey, but the last pic is a big thank you for the support shown"}
{"tweet":"Just when Lanning was beginning to look good for a 50+ score, which she doesnt have in T20Is v India!\n\nSeveral yea"}
{"tweet":"Make no mistake!  will be highest run getter in  \nYes, you read it here first"}
{"tweet":"SEVEN DAYS IN SPORT: Joe Root will be a welcome arrival for the Ashes while a ruthless predecessor is again under s"}
{"tweet":"More like Charlie Block-em"}
{"tweet":"Great article about Alyssa Healy and her evolution as a player and as a person."}
{"tweet":"That first ball of the innings wicket!  Grace Juriansz celebrates the caught behind wicket of"}
{"tweet":"Maiden IPL 100 for this special player and now the purple cap holder . It won't be long before we see him in team"}
{"tweet":"Alyssa Healy was brought undone by an absolute JAFFA \n\nCheck it out"}
{"tweet":"LIVE NOW | Sunday  on SEN.  taking you through a packed Sunday of sport. \n\nIn the next"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Australia claims series win over India with final over T20 victory |  |"}
{"tweet":"Been watching replays of the delivery by Shikha  that dismissed  \nSeriously stunning   dead set an"}
{"tweet":"2 by   Quality Prints Cards Products at:"}
{"tweet":"Tahlia McGrath speaks with Ch7 after the match:\n\n\"I'm feeling pretty good at the moment. It's been an unreal series"}
{"tweet":"Ponting didn't play much Test  in 2007 (but was insane in ODIs), but that was the end of his \"peak"}
{"tweet":"Magnificent!   Congrats Team! Excellent bowling and fielding too."}
{"tweet":"Well done ladies! Looked dicey for awhile but you stuck it out and grabbed that win with both hands. Awesome stuff"}
{"tweet":"Come on girls"}
{"tweet":"Shoaib Malik's inclusion makes Pakistan the top Asian favorites to win the T20I World Cup 2021."}
{"tweet":"These Indian bowlers are great to watch."}
{"tweet":"Yow. Indian team is flogging the Aussies on the Gold Coast. Perry out! 4\/46"}
{"tweet":"This might be the most unplayable delivery Ive ever seen. Incredible."}
{"tweet":"Cricket season is back!     @ Ellenbrook Open Space"}
{"tweet":"Siddle's hat-trick on his 26 birthday"}
{"tweet":"Siddle's hat-trick?\n Ball of the Century?\n Botham's Ashes?"}
{"tweet":"Perfect way to spend a Saturday Night, whilst India try to take flight, our Aussies are up to the"}
{"tweet":"Day 1034 We went outside! We had a picnic for Rufus Opas birthday. They played . It was great fun."}
{"tweet":"In Meg's defence, she's been generous to the opposition  through various ways.\n\nPS: Lanning had also w"}
{"tweet":"Tahlia McGrath:\n\n\"The deck looks like an absolute belter, so hopefully we can take advantage of that and get the 2"}
{"tweet":"Tahlia McGrath:\n\n\"You could say some of our fields set in the last game were a bit rogue But I dont know the Indi"}
{"tweet":"Tahlia McGrath:\n\n\"India played aggressive cricket on Thursday and the conditions played in their favour. The ball w"}
{"tweet":"Tahlia McGrath ahead of the second T20I:\n\n\"I took a lot of confidence from the two ODI innings I played in Mackay,"}
{"tweet":"I just saw somebody begging ICC, BCCI and C.A. for a combined BBL and IPL league. As if there isn't enough T20  G"}
{"tweet":"Six toss wins in a row! \n\nMeg Lanning is on some sort of roll.\n\nThey've sent India in to bat for the second T20I."}
{"tweet":"At least no one can accuse Michael Slater of not having the courage of his convictions sorry, whats that?"}
{"tweet":"Not surprised the World T20 won't be on free to air. More value in T20 as a franchise form of the game tha"}
{"tweet":"252 international matches \n\nTonight  in the second T20I vs India   will overtake  as"}
{"tweet":"January 2022: England regain the Ashes."}
{"tweet":"Name me a more glorious bowling action? D K Lillee 1974  I was watching the MLB today and really cricket is"}
{"tweet":"Before lunch,  bowled 10 tidy overs.\n\nAB brought Warne back on as soon as Cullinan entered. Warne bowled"}
{"tweet":"Would The Ashes have ever REALLY been cancelled if it came down to it? \n\nOr has it just been a dragged out power p"}
{"tweet":"Never a dull moment when Chappelli talks, even if you dont agree with him 100%.\n\nYet another great episode from"}
{"tweet":"I made some AFL Football and Cricket ball sugar cookies for a mates 50th Birthday today! So delicious"}
{"tweet":"It's lunch at the cricket. The spearhead bowler has had an awful session.\n\nYou walk up and put a pie on a plate in"}
{"tweet":"Former England skipper issues 'five-nil' Ashes warning, hits back at Tim Paine."}
{"tweet":"Can Tits McGee score a 100?"}
{"tweet":"Plans progress for pavilion upgrade at GR Bricker Reserve"}
{"tweet":"Getting in a cricket mood watching 'Howzat!'"}
{"tweet":"I wonder what Steve Smith would think if he read all this nonsense from both sides.\n\nSPD Smith in h"}
{"tweet":"You take Bryce Street to get to Century Boulevard."}
{"tweet":"Its that great time of year, the transition from  to   absolute pleasure to play in the country at g"}
{"tweet":"Very little sport to watch this weekend.\n\n WT20 AUS v IND and  Qualifying later tonight is all there is."}
{"tweet":"Alex Carey seeing them like watermelons"}
{"tweet":"First game of  for the season. If you win the toss, what are you doing first?"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"NEW EPISODE  \n\nOn the back of a history-making Test, we discuss the result, walking and why women's Tests should b"}
{"tweet":"Clocking 153kmph in debut match is serious,  hopefully will make it to"}
{"tweet":"Play Victoria Premier Cricket Fantasy (Mens) on \n\n $100m Salary Cap\n Pick 11 Players\n Ca"}
{"tweet":"It's the weekend  how will you be analysing your teams  this weekend?\n\nMake life easy for yourself,"}
{"tweet":"Cricket Australia may be forced to strip Test matches as England baulk at bubbles"}
{"tweet":"Serious effort paltan  Well played  Lets get this sorted next yearr  \nThat was some crazy batting f"}
{"tweet":"That pitch at _Cricket ground looks a little green. Something I have never seen before."}
{"tweet":"Snap lockdown in Hobart which puts the upcoming  matches in doubt. Had a feeling this would happen when the"}
{"tweet":"Who should open with Dave Warner for The Ashes? \n\n MORE:"}
{"tweet":"Riley Meredith right on song at the WACA."}
{"tweet":"There is a world of uncertainty looming over the WBBL after Tasmania dived into a three-day lockdown."}
{"tweet":"Who will win the ?  Preview:\n\n Key head-to-head stats: The players to watch\n Possible XIs &"}
{"tweet":"Canberraians, thank you for your resilience, dedication, and compassion during lockdown\n."}
{"tweet":"Can Australia win their first?\n Will the West Indies defend their crown?\n Could England pull off the ODI\/T20 Cu"}
{"tweet":"Another good day for South Australia. Queensland, who have Bryce Street, Joe Burns, Marnus Labuschagne, Usman Khawa"}
{"tweet":"The old partnership of  and _ delivered a solid knock in this week's  despite th"}
{"tweet":"A former Test skipper has put forward three options to open the batting with David Warner in the Ashes.\n\nShould one"}
{"tweet":"Cricket Australia's plan to revive its second XI competition hinges on border restrictions but ACT officials are wo"}
{"tweet":"Bowling underarm to sandpaper pipeline. Because cricket season."}
{"tweet":"Tim Paine's raw reaction to 'shattering' Pucovski news.\n\n \n\nREAD"}
{"tweet":"Pucovski is still highly regarded as the Australian opener of the future, but more concussion issues are throwing h"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Nice areas! This from a 6 year old! Wow"}
{"tweet":"_India"}
{"tweet":"Travis Head is Shaun Marsh 2.0"}
{"tweet":"Whos looking forward to watching these two down in Australia this winter? v"}
{"tweet":"Heres the full answer from Jimmy Anderson about his favourite contest with ."}
{"tweet":"I have two tickets of the platinum box for india vs pakistan T20 World Cup match. Dm me if anyones interested!"}
{"tweet":"Anderson on  said the recent  was his favourite against .\n\nI think this summer w"}
{"tweet":"Was Benaud the only  personality that Chappelli respect"}
{"tweet":"It was still very hard to BEAT India in the late 1970s & early 1980s.\n\nYou're forgetting SOBERS! Whatever"}
{"tweet":"Always gets the green light my way when facilitating overarm throwing sessions across school, junior & youth"}
{"tweet":"Given the oldies didn't play (much) in India, it's hard. Based on performances + general ability on"}
{"tweet":"What a player, Alyssa Healy. Simply brilliant."}
{"tweet":"This is some sort of innings by Alyssa Healy"}
{"tweet":"Combative Indian lefty  was born  in 1981.\n\nIn the one and a half years from his Test comeb"}
{"tweet":"Dennis Lillee vs Viv Richards \n1976 WACA Perth \nThose were the days"}
{"tweet":"Astonished that  is under way. Had intended to go along but gave it no chance given the volume of rain all a"}
{"tweet":"How good is this over. Dennis Lillee bowling to Viv Richards. I remember watching this live at the time."}
{"tweet":"What would be your all time XI teams for these 4 countries for a 5-Test series against Indias all time XI?\n\nWhat s"}
{"tweet":"Signed  bat of the  touring team to Australia for the 1970\/71 tour. Ted Dexter's signature 2nd from top"}
{"tweet":"Cricket ABC 123. A fun way for little kids to learn about the game of Cricket. A-Z and 1-10"}
{"tweet":"The WBBL begins tonight! Rally behind your team and shop the complete range of official WBBL On-Field Headwear."}
{"tweet":"LISTEN | Co-host of the  & broadcaster _ joined _grubelich on  to chat the"}
{"tweet":"India is the greatest Asian cricketing nation in history. Multiple records are held by the team. Asso"}
{"tweet":"Great to see all the Aus domestic bats in great form, these runs will definitely translate to success overseas and"}
{"tweet":"I remember facilitating this game with  and he had a target attached to a rope to provide a moving targe"}
{"tweet":"Pucovski suffers another injury setback.\n\nDETAILS:"}
{"tweet":"With the  match between the  and  tonight. Read up on the ground that will play host to th"}
{"tweet":"After 'only' making 100 runs in this Test against ICC World XI, Ponting scored 1830 runs in his next 13 Tests (10 t"}
{"tweet":"NOW | Co-host of the  & broadcaster _ joins _grubelich on  to chat the late"}
{"tweet":"Excited about the start of  but sad you can't participate in a fantasy WBBL competition? Turns out there is on"}
{"tweet":"50 years ago I was retained by  to organise fund raising campaign to finance development of  in"}
{"tweet":"Match 1 Preview: Sixers or Stars to start with a win?\n\n Key players to watch & stats\n Possible XIs"}
{"tweet":"Number of Tests played by a few Aussies in the last 10 years, avging b\/w 26 & 30 with the bat:\n\n36 Wade^\n10 Bancrof"}
{"tweet":"While Test axing was reasonable (though I'd have opened with him instead of ), it was a horrible ("}
{"tweet":"I've always thought Maxwell should've been selected in Test  more in the mid 2010s. Maybe there's still hop"}
{"tweet":"Glenn Maxwell, born  in 1988, holds the record for the highest strike rate in ODIs (125.4) and T20Is (158"}
{"tweet":"_blog \n\nThough *IN* Australia is more relevant (since when that matters for pre-series banter), I find t"}
{"tweet":"ready to take new ball"}
{"tweet":"legend Justin Langer says the naming of an oval at Abbett Park in  in his honour is one of the"}
{"tweet":"Cricket Daily: Was Ponting too conservative in the finals? \nWatch full show: \n\nListen:"}
{"tweet":"Khawaja's game against pace was unreal then.\n\nThe way he could punish short of a length balls with ease. is almost"}
{"tweet":"LISTEN| \n\n_connolly-  \n_cricket-  \n-  \n-"}
{"tweet":"This shouldn't be a surprise.\n\n2015\/16 season was incredible from Khawaja: 100+ avg in Test , 110+ ODI SR,"}
{"tweet":"Indian contingent promises excitement as Australia gears up for WBBL season seven | Women's Big Bash League | The G"}
{"tweet":"It's the shock move that should mean a complete overhaul of the game in Australia, with one former skipper calling"}
{"tweet":"Learn more about John and the Conference\n\n:\/\/."}
{"tweet":"Fielding shows where a team is.  standards dropped off in the last part of the  which ended t"}
{"tweet":"LISTEN| _cricket joined  to chat all things  on"}
{"tweet":"NOW| _cricket joins  to chat all things  on  \n\nLISTEN LIVE |"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The 2021\/22 WBBL season gets underway tonight at Blundstone Arena. View the full fixture and get tickets here:"}
{"tweet":"This also applies to the \"unlucky\" bowler merchants!\n\nYou can't say catching has never been better; and also cry a"}
{"tweet":"_ That's a good'un!\n\nIt'd have been cooler, if it was true both ways!\n\nI wonder who's 2nd to Bradman"}
{"tweet":"Australian Cricket legend and member of  Board, Greg Chappell joins us for our latest Coaching and Offic"}
{"tweet":"With an opportunity to win the game for your team, inner peace helps you focus on & enjoy the moment to get the job"}
{"tweet":"They are two of the greatest to have played for the West Indies, and now they're at war.\n\n\"Chris Gayle, the Univers"}
{"tweet":"It's not too late to have your say! \n\nWho makes it in to your . XI to face Bangladesh on Sunday?"}
{"tweet":"I was exhausted by 7 pm today, but stayed till now ~1 am to possibly watch Smith bat.\n\nI know hes not a good fit h"}
{"tweet":"Fair assessment.\n\nAs for 2007, the batting depth of the Australian side was insane throughout the WC (+ cl"}
{"tweet":"One theory in any format of  that you dont truly believe in, but you pretend to or convin"}
{"tweet":"Possibly a controversial opinion  that 2007 World Cup runner-up Sri Lankan side would probably beat the"}
{"tweet":"40 MCGs s a LOT OF !  have been hit for many 6s + boundaries."}
{"tweet":"YuppTV Bags Exclusive Broadcasting Rights For ICC Men's T20 World Cup 2021 For Continental  And Southeast"}
{"tweet":"Most of the contents in my drafts were saved because I had to do something else in a hurry; and forgot afterwards."}
{"tweet":"_curtly  The real universe boss!\n\nCurtly bowled quite a few economical spel"}
{"tweet":"great Captains knock and through to the Super 12 at the"}
{"tweet":"Congratulations Jennifer Simbai ! You are the second winner of \"They Play You Win Contest\"\nYour gift is on the way"}
{"tweet":"52 Beers to Oman ICC T20 World Cup Daily Wrap Show (Day 5) with Beefy and Bharath"}
{"tweet":"LISTEN | Host of the    joined  _grubelich on  to talk all things   in"}
{"tweet":"The only reason he can't be dropped is because Warner has a reputation."}
{"tweet":"Waner is 'undroppable' according to one outlet\n\nNo, he isn't 'undroppable', any other player in the team w"}
{"tweet":"NOW | Host of   joins _grubelich on  to talk all things , including th"}
{"tweet":"Sad to hear _ is retiring (for now?) after a solid innings of 104 episodes. I've enjoyed the daily 15-"}
{"tweet":"Catch the Cricket Unfiltered Live from earlier with _ here:"}
{"tweet":"I am really disappointed mate!\n\nStarc's Test record against New Zealand in RED BALL Tests: 20 wicke"}
{"tweet":"Hobart 2011.\n\nAustralia's only Test loss to New Zealand in many people's lifetime!\n\nAus bowled NZ ou"}
{"tweet":"Many overlook the batting.\n\nHis front\/top batting arm was his bowling arm; yet, he didn't wear arm g"}
{"tweet":"You cant simply relate wins to feats; but its worth noting that Australia lost 1 home Test on Pattos watch. Even"}
{"tweet":"Some people with heavily agenda driven cricketing views will tell you Pattinson didnt play more Tests because Star"}
{"tweet":"Nathan Lyon expects Ben Stokes to answer an 11th hour SOS and join England for the Ashes in their bid to lift the u"}
{"tweet":"Sporting facilities set for upgrades thanks to City of  grant funding"}
{"tweet":"REGISTRATIONS NOW OPEN FOR HOLIDAY CRICKET CLINICS    \n\nFurther information and registration via College Ev"}
{"tweet":"Virat actually bowled some handy deliveries last night!"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"Aussie star ruled out long-term ahead of bumper calendar."}
{"tweet":"How are Warner, Finch & M.Marsh still relied upon for Aus to score a winning total  Im actually ba"}
{"tweet":"I fully expect David Warner to be picked for the opener v South Africa but based on what I've seen from th"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"congratulates James Pattinson"}
{"tweet":"Domestic cricket fixtures locked in - Marsh One Day Cup & Sheffield Shield - including matches for NSW & Victoria."}
{"tweet":"Australian selector reacts to James Pattinson's international retirement |  |"}
{"tweet":"Wow, great pic - proof that  on board ship really was a thing. Reading a  by Neville, first class me"}
{"tweet":"Grit and determination behind Indian teen Shafali Verma's rise to international cricket"}
{"tweet":"Surely with Warner's form it is time to get Stoinis to the top of the order like he does in the Big Bash and let hi"}
{"tweet":"That's great news for  fans around the world. Need to fix top-order woes to advance in"}
{"tweet":"How do the selectors handle the David Warner situation?\n\n explores the dilemma on the eve of the T20"}
{"tweet":"WBBL:  gun Anika Learoyd has big fan in Steve Irwins son Robert thanks to get passion off the pitch"}
{"tweet":"Cricket officials revised their rules to include gender neutral language."}
{"tweet":"Today we continue with the wonderful .\n\nSomething a little different this week as we look at cri"}
{"tweet":"Afghanistan defeated West Indies in the second match of the ICC Cricket World Cup. Congratulations to all. Success"}
{"tweet":"Or, did I also forget to mention that Pattinson has a bowling avg of 24.8 against LHBs in Test ?\n\nSince 200"}
{"tweet":"Being arguably the most complete 1990s-born Aussie bowler when fit meant, Pattinson also averaged 24.4 against Top"}
{"tweet":"Pattinson had a lot of bunnies really; mostly from New Zealand. In fact, only a few of the Kiwis we"}
{"tweet":"Sehwag scored 146 off 130 against Mendis in Test  without getting out to him?\n\nOn the other hand, rece"}
{"tweet":"__Single Wait, what!\n\nThats 2.03 pm on  in Melbourne.\n\nAustralia were batting first; and Smith loo"}
{"tweet":"Its one thing to casually show bowling averages across eras.\n\nBut if youre going down the path of significant dat"}
{"tweet":"Previous era sports science probably wouldve ended Pattinsons career after a few Tests.\n\nPattinson has a bet"}
{"tweet":"Bharat Sundaresan believes David Warner still has more to give for Australia's international sides.\n\nVia"}
{"tweet":"Without a doubt, the best South African bowler I have seen in my lifetime.\n\nThe fact that he had 5"}
{"tweet":"Michael Slater- one angry little ant."}
{"tweet":"On point about 4 Pakistanis (or Ambrose for that matter)!\n\nLooking through various li"}
{"tweet":"Not really sure why Miller even bothered standing around for that one. As soon as snicko showed nothing it was pret"}
{"tweet":"> .crowd ul.patronsseated {\n  border: 1.2m white picketfenced;\n}\n\nOr: when the game devs reuse a texture in"}
{"tweet":"Maxy, put the floppy hat back on, NOW!"}
{"tweet":"I've missed Starc"}
{"tweet":"Here we go. Our T20 World Cup campaign is underway. Cricket is back!"}
{"tweet":"Personally I contributed bugger all at  today but enjoyed watching the young fella take the new ball from 2"}
{"tweet":"I need to start engaging in Cricket season conversations. \n\nI'll try to get enthusiastic about that soon.\n\nLess Wa"}
{"tweet":"_Chopernos  A few finalists:\n\nMcGrath-Gillespie batting pship, Gabba 2004\n\n Semifinal 19"}
{"tweet":"Fidel Edwards\n\nShane Bond\n\nShoaib Akhtar\n\nShane Warne\n\nR Ashwin (to bat at No.7)"}
{"tweet":"Pick a Test attack of your 5 favourite bowlers to watch.\n\nThere should be 3 fast bowlers and 2 spinners. One of the"}
{"tweet":"No. Its up to the men to lift their game"}
{"tweet":"Even some of the all-rounders harshest critics will have to swallow their words if the West Australian delivers th"}
{"tweet":"Putting my hand up to help out Junior's U\/15s school  bowlers as the season looms.\n\nShould probably hit the"}
{"tweet":"Aus T20 WC XI tonight should be:\n\n1. Warner\n2. Finch (c)\n3. Marsh\n4. Smith\n5. Maxwell\n6. Stoinis\n7. Inglis (wk)\n8."}
{"tweet":"Check out our Etsy shop and Facebook marketplace for some great gifts"}
{"tweet":"Simmer is upon us"}
{"tweet":"Very cool cricket gifts for cricket nerds like me. How about some functional art for the home?"}
{"tweet":"Oh! It is good to be back \n\nThis is absolute heaven!"}
{"tweet":"Victoria getting on the beers.\n\nMe in Queensland: been getting on the beers for months \n\nNo wonder QLD has the hig"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"confirms Shield squad for"}
{"tweet":"Oh and of course they won't drop Warner. Takes bravery to make the tough decision, guy might be a good bat"}
{"tweet":"Namibia through to T20I World Cup! History"}
{"tweet":"Gone are the days when  owned Australian summers.\n via"}
{"tweet":"It's the weekend  how will you be analysing your teams  this weekend?\n\nMake life easy for yourself,"}
{"tweet":"Netherlands cricket is like buying year 7 schoolboys. Make 10 and retire"}
{"tweet":"Honestly talk about a watershed moment for  in  - that's just brilliant. Ireland had their chances toda"}
{"tweet":"and cricket season has started! \n\nThe Ax Man cometh! A wicket and a few run, but most of all, a lot of fun!"}
{"tweet":"LISTEN |  - Chief Cricket Writer for the  - joined _grubelich on  to discuss the late"}
{"tweet":"Cricketers across Melbourne will return to training this week, as the countdown begins for Victoria to hit the 80 p"}
{"tweet":"Brisbane Lord Mayor Adrian Schrinner reveals international  plan for Breakfast Creek precinct"}
{"tweet":"Of all English bowlers to take at least 20 wickets in Australia in the last 130 years of Test , Mike Hendri"}
{"tweet":"\"Work hard, Believe in yourself, Enjoy the game and just try to be 1% better every day!\" - Mark Coles, former Girls"}
{"tweet":"Genuine question for Aussies here Do you care about the ?"}
{"tweet":"Star Australian bowler lauds James Pattinson following international retirement |  |"}
{"tweet":"_  Its almost like Junior was narrating a typical Friday night out in Warnie"}
{"tweet":"T20 World Cup underway.  vice captain Pat Cummins previews Australia's chances:"}
{"tweet":"Flourishing format brings together stellar cast for T20 World Cup"}
{"tweet":"Which 4 teams do you think will make the  Semi Finals?"}
{"tweet":"Australia need to re-consider batting order, even if it means dropping Warner |  |"}
{"tweet":"It's the WBBL Sydney Derby tomorrow! How does _smriti feel about facing her Indian teammates Shafali Verma"}
{"tweet":"Finally NZ takes a revenge \nWhat a Match \nKiwis goes into the another final \n Out of the tournament"}
{"tweet":"Team India broke a million hearts, dreams were shattered, and hopes gutted. Our cricketing stars were reduced to a"}
{"tweet":"Australia made their first semi-final of the tournament since 2012 with four wins in this tournament and Pakistan i"}
{"tweet":"Jhye Richardson needs to come in for Mitch Starc for the first  Test. Period, point over!"}
{"tweet":"Its hard to go past the ending of the greatest  match of my lifetime.\n\nPS: I wasnt quite old enough for t"}
{"tweet":"Gerard Whateley on Australia's reputation as a poor touring nation.\n\nVia"}
{"tweet":"Nic Maddinson believes he's better prepared now for a call-up to the test team."}
{"tweet":"LISTEN | _Hogg - Former Australian Spinner & Cricket Legend  + _Cricket - caught up with"}
{"tweet":"From Season 2 of  Legends\n\nSouth Africa's first Test captain of the modern era, Kepler Wessels, talks about"}
{"tweet":"Off the back of consecutive Sheffield Shield hundreds, Uzzie's hot form continues as The Ashes close in! \n\n MORE"}
{"tweet":"You know when you see pictures of the galaxy, our planet sometimes feels insignificant.\n\nThats how I feel about th"}
{"tweet":"If youve stared in the face of an angry under 12 team manager who cant open the sheds and survived, you can face any enemy."}
{"tweet":"T20 winner"}
{"tweet":"NOW | _Hogg - Former Australian Spinner & Cricket Legend  + _Cricket - joins _grubelich on"}
{"tweet":"Easily the most important person in a local cricket club is the person who has the keys. Closely followed by the pe"}
{"tweet":"England are the favourites But will they get the BOOM against NZ & progress to the final?"}
{"tweet":"Hey, any thoughts on the recent press about the possibility of Mitch Marsh getting a Test recall for the Ashes?"}
{"tweet":"_moinak True; unlike , I might know a thing or 2 about ships.\n\nEvery era has its challenges; we wouldnt"}
{"tweet":"Dear Tassy, I love you, you make some great gin but bugger off and leave our  test alone"}
{"tweet":"whoa a green mamba  that looks like they brought the Victa 2 stroke out about a minute before fir"}
{"tweet":"Tassie puttin a bid in  C'mon  where's ours  5th  test at Manuka   you know it make"}
{"tweet":"Khawaja 70 out of 129 continues his  push."}
{"tweet":"Dont miss out on your FREE resource on cricket skills! \n\nWe have also included a teacher guide to help assist you"}
{"tweet":"Mooney and Devine\n\nA mighty combination."}
{"tweet":"Cricket Australia could reportedly face a negative cash flow upwards of $90 million over the next three years witho"}
{"tweet":"ready to host Ashes test"}
{"tweet":"Rain stops play at the Gabba.\n\nQLD 7-84 (42.1 overs)\n\nKhawaja 41* and Sandhu 13* (only 2 batters to get to double d"}
{"tweet":"Liberals joke while  remain at risk"}
{"tweet":"Mount Gambier Library to host local author Graham Greenwood"}
{"tweet":"SPOT THE 'GABBA PITCH\n\nFall of wickets:\n\n1-8\n2-8 (Khawaja enters)\n3-8\n4-34\n5-38\n\n5-46 at Lunch, thanks to 8 runs c"}
{"tweet":"The Spirit Of Cricket India - A Book By Steve Waugh\nSecure your 20% special offer today.\nVisit:"}
{"tweet":"just wondering, why does Marnus Labuschagne think its okay to spit or throw his chew"}
{"tweet":"Joel Paris dismissed Marnus Labuschagne for a golden duck with a beautiful delivery, caught behind.\n\nParis is a ver"}
{"tweet":"Labuschagne out for first-ball duck as  in early strife against _Cricket at Gabba."}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"The responses are so toxic; and uninformed.\n\nNot that we can ever measure it, but if theres 1 cricketer that wou"}
{"tweet":"Pattinson fined and suspended over Shield incident."}
{"tweet":"The toss at the Gabba was the first act of the series, which England would go on to lose 4-1."}
{"tweet":"Yes, I agree. Choice of words used (obviously Im speculating) suggest what I interpreted (part jokingl"}
{"tweet":"Its not that WA cant. Its that it wont. \n\nBecauseexcuses."}
{"tweet":"May I warmly welcome the 30th  to join her brethren of    the one and only, Betsy! \nNow Ill ad"}
{"tweet":"have won the toss and will bowl."}
{"tweet":"Report: Cricket Australia comes down hard on Pattinson for Shield incident |  |"}
{"tweet":"2021 ICC T20 World Cup 1st Semi Final - ENGLAND v NEW ZEALAND."}
{"tweet":"Cloud about & some rain forecast for day 1 of the Tas v SA shield game at . Whatever the weather br"}
{"tweet":"Another great show by . They talked  and who might captain Australia in the . Also talk"}
{"tweet":"or   \nI feel   deserves to be the captain of   again   \nHe has"}
{"tweet":"As the first woman to score a century for her country, Shameelah Mosweu is a rising star who hopes to soon take Bot"}
{"tweet":"Which  journalist broke the Tim Paine sexting story?"}
{"tweet":"Enough said"}
{"tweet":"India vs New Zealand 3rd T20 Tips & Preview"}
{"tweet":"Pretty shallow in that Tasmanian pool"}
{"tweet":"We also talked about  stepping down from his post as captain of the Australian cricket team ahead of the"}
{"tweet":"Women's cricket on TV was a figment of my imagination. Now everyone's watching.' - . A great read!"}
{"tweet":"From someone who was close to the incident when it happened (not me) the txts & pics were part of a joint &"}
{"tweet":"If he was a politician - no problem"}
{"tweet":"I think  should get a 10 year contract extension as captain"}
{"tweet":"Sponsors may ask why  Chair Richard Freudenstein and CEO Nick Hockley hid the  scandal when the"}
{"tweet":"Weber WBBL|07 Finals series schedule confirmed"}
{"tweet":"There is a certain irony in that if  had shown the equivalent leadership of  in how this mess"}
{"tweet":"This week's guest is Joe Hill of the Alexandra & Eastern Hills Cricket Association. He gives us some insight to wha"}
{"tweet":"Weber WBBL|07 Final to be held at  Stadium"}
{"tweet":"Hard to see how  Chairman Richard Freudenstein and CEO Nick Hockley can remain in their positions consid"}
{"tweet":"\"Im still saddened and find it quite distressing to see what unfolded \"\n\nMark Taylor shuts down 'toxic culture'"}
{"tweet":"This unfortunately has become a common sight at the SCG in recent times."}
{"tweet":"U can play anywhere in the world."}
{"tweet":"How do   get to      r"}
{"tweet":"CA needs a leader like PVL, he can deal w. sexting, the Horse Tinkerer guaranteed he wouldn't make up rules on the"}
{"tweet":"\"It seems screamingly unfair if he's not in that Test team.\" \n\nPeter Lalor says Tim Paine should play in the first"}
{"tweet":"\"It was stupid, it was lewd, but you know  the world is messy and people who do really good stuff have flaws.\"\n\nG"}
{"tweet":"Genuinely surprised at some commentary that Wade comes in to replace Paine in Australia's Ashes squad. Have people"}
{"tweet":"Check out \n\n5 BTC sign up bonus \/ start betting by \n\nBet with"}
{"tweet":"Thats just MENTAL!  never lost when either  or Greenidge made 60 when they both pla"}
{"tweet":"MCC CEO Stuart Fox has revealed whether the MCG would ever considering selling the stadium's naming rights |"}
{"tweet":"Legend: The first women's Test hat-trick, the first player, man or woman, to achieve the double of 10 wickets and a"}
{"tweet":"Appointing Pat Cummins as Captain solves one of many problems at  \n\nStill ongoing problems with the Boar"}
{"tweet":"The Australian Men's Test team how has 3\/11 players on the team who are not allowed to be captain. Paine, Smith and"}
{"tweet":"Ugh. Peter Lalor's spin, minimising the facts of the  scandal, on 's  is unwatchable."}
{"tweet":"Alice Springs to host Imparja Cup"}
{"tweet":"An Ashes series like no other: let the hostilities, or even the respect, begin"}
{"tweet":"Load up even more on Australia now Anderson gone"}
{"tweet":"Youre making the case for me, LMAO!\n\nPS: Ponting does have 10 Test tons when he entered with a single di"}
{"tweet":"Yes, Johnson may do that in ONE innings; but you get TWO innings in Test .\n\nPS: I doubt any of th"}
{"tweet":"1 more sleep & its underway whos pumped"}
{"tweet":"Nothing says its summer like quickly rushing to call your mrs in to the tv  Quick you need to see this catch\nThe"}
{"tweet":"LISTEN |  - Cricket Expert & Host of  & _ - joined _grubelich on"}
{"tweet":"Melbournes sporting precinct could become the centre of world sport in the middle of January after the Victorian G"}
{"tweet":"That's Twitter done for me for today, feel like a kid going to bed on Christmas Eve knowing the Ashes starts tomorr"}
{"tweet":"Click below to see our staff predictions for the upcoming Ashes series between  and"}
{"tweet":"Join ,  and Ethan as they preview the upcoming first Ashes test on the latest episode of th"}
{"tweet":"This guy bats 8 and doesn't bowl."}
{"tweet":"Will be discussing the start of the Ashes - on a live YouTube chat with _cricket at 9.30pm AEDT (10.30am UK t"}
{"tweet":"Work underway to repair damaged flood defence in Lowdham"}
{"tweet":"It's finally summer time!"}
{"tweet":"SCORCHERS VS HEAT \n\nThe team that has batted first has won the last five meetings. See our other stats and bet s"}
{"tweet":"Before the Ashes start, lets take a look at the long history Indigenous people have had with representing when it c"}
{"tweet":"OMG - the umpiring in the  is demanding a review system"}
{"tweet":"Fair few Shield\/Test runs and wickets between this quartet"}
{"tweet":"The biggest series in world cricket returns on Wednesday, as the first test between England and Australia kicks off"}
{"tweet":"RENEGADES VS STRIKERS \n\nSame Game Multi for the match paying $15.25 with a key focus on the  winning"}
{"tweet":"AFR Cricket Correspondent is back. \"Dark clouds loom for first Ashes Test in Brisbane\""}
{"tweet":"Who is gonna win the Ashes ?"}
{"tweet":"Did you know the  started with a social cricket match in 1882? After the match, Lady Janet Clarke pres"}
{"tweet":"Who will be the Aussies top wicket taker against England this series?"}
{"tweet":"Unlike a few others this statue is a cracker. Allan Border immortalised in bronze outside the Gabba."}
{"tweet":"guys, any news on when the SCG member's Ashes ballot results might be announced?"}
{"tweet":"Just like with the Wally Lewis statue at Suncorp Stadium when you next head to the Gabba and want to catch up with"}
{"tweet":"The battle for crickets most famous urn is upon us. Here is all the information youll need; from teams, times and"}
{"tweet":"The chief of Western Australia  has conceded that her organisation could lose up to $5 million after the ci"}
{"tweet":"- Australia's new skipper \n\n- England's dicey record \n\n- The awful weather \n\n10 ASHES TALKING POINTS:"}
{"tweet":"One of the most highly rated young glovemen in the country  is set to return for the  to"}
{"tweet":"5 players the two new franchises - Lucknow and Ahmedabad - should target in the"}
{"tweet":"Only 1 - more - sleep"}
{"tweet":"Another Great Episode Yesterday by  they spoke about"}
{"tweet":"Ashes eve! Time to get excited!"}
{"tweet":"LISTEN|  \n\n_- Women's Sport \n-  \nKim Hughes-  \n_Baldwin-"}
{"tweet":"Shakib has the BCB on a string."}
{"tweet":"ready to make history"}
{"tweet":"Important game for Renegades & Strikers first up. Match + Fantasy Preview:\n\n Key players\/stats & possible XIs\n Ma"}
{"tweet":"HURRICANES VS SIXERS \n\nHobart have won six of the last seven meetings. Will that continue on Wednesday night?"}
{"tweet":"Take  Fifth Test to regional Australia - Queen Elizabeth Oval in  would be stunni"}
{"tweet":"Robert Craddock criticises 'selfish' push from Western Australia to host the second Ashes test.\n\nVia"}
{"tweet":"Who's the better TEST batsman of these two?\n\nOverall batting avg in Top 7:\n- Thorpe 45.0 (Rest of Eng 35.0) *10 run"}
{"tweet":"Australia dealt another injury setback as Sophie Molineux ruled out of Women's Ashes series. \n\nDETAILS:"}
{"tweet":"Former Australian batter Mike Hussey is disappointed Perth has been stripped of the fifth Ashes Test, saying common"}
{"tweet":"What a gutless way to avoid making a decision and having any responsibility! If its about the money"}
{"tweet":"Sophie Molineux injury update"}
{"tweet":"After some horror luck in the 2019 series, one of the biggest drawcards of this summers Ashes has been dealt anoth"}
{"tweet":"Who will be the Aussies top scorer against England this series?"}
{"tweet":"Hilarious !  | Kim Jong-un Takes 10-0 In Blistering Return To North Korean Domestic Cricket  The Betoota Advocate"}
{"tweet":"Why would I do that? I can think of little less boring than the game of cricket, other than perhaps a speech by Sco"}
{"tweet":"Smartphones & apps make  possible anywhere, anytime - its the fastest growing segment of the"}
{"tweet":"England lose legendary wicket-taker James Anderson to calf issue on eve of first Ashes Test. \n\nDetails"}
{"tweet":"BREAKING \n\nA huge blow for England on the eve of the 1st Test, losing their veteran fast bowler! \n\nDetai"}
{"tweet":"Think  has been watching the  recycling"}
{"tweet":"Absolute shame this guys (Pattinson) body let him down. Similar to Shaun Tait.  fans missed out. Both would"}
{"tweet":"Australian Test great lashes Root's captaincy in brutal pre-Ashes swipe. \n\nRead"}
{"tweet":"RENEGADES VS STRIKERS \n\nAdelaide have won four of the last five meetings. Will that continue tonight?"}
{"tweet":"For me it was undoubtedly Mitchell Johnson being bowled for a golden duck in Sydney 2011, after being berated all t"}
{"tweet":"Why is Shane Warne so harsh in his criticism of Australian players?  \nWarney suffering RDS -"}
{"tweet":"\"The realisation that, yes, I've made it!\"\n\nWhat do The Ashes mean to two former Aussie Test skippers?"}
{"tweet":"I think we should consider this cricket offer very seriously.   _connolly"}
{"tweet":"If cricket isnt able to meet our border rules for the fifth Test in Perth, then they should move the second Test"}
{"tweet":"_jamie  so much common in these players. Divided by teams, United by ."}
{"tweet":"In addition to all that, bowlers like Flintoff\/Pattinson really hit the deck hard; and wouldve felt much faster th"}
{"tweet":"Looks like Santa bowls right arm off breaks"}
{"tweet":"Indian pace ace , born  in 1993, now has the best bowling average (22.79) for an Asian pa"}
{"tweet":"They didn't call him 'Captain Grumpy' for nothing! \n\n WATCH: Over The Rope"}
{"tweet":"Lets see if  can maintain their winning streak when they take on the  at their next home g"}
{"tweet":"_cmail any new eps of cricket legends in the pipeline , just in case La NinA rolls through ?  \n\nProablly"}
{"tweet":"So I suspected that the  is slower than the .\nIt's exactly 5 minutes slower per innings.\nIt's noticeable I"}
{"tweet":"Happy birthday Freddie! \n\nWe didn't enjoy it at the time, but that 2005 Ashes performance was one of the best."}
{"tweet":"Does the  have more time to complete their matches than the ?\nSeems to be MUCH more faffing about in the m"}
{"tweet":"LISTEN |  - Legendary Sports Broadcaster & Host of 'Great Sporting Lives' - joined _grubelich on"}
{"tweet":"Doug Bollinger believes Josh Philippe will force his way into Australia's limited-overs teams soon.\n\nVia"}
{"tweet":"Enjoying the cricket on tv"}
{"tweet":"NOW |  - Legendary Sports Broadcaster & Commentator - joins _grubelich on  to chat the"}
{"tweet":"What to get my 2-month-old granddaughter for Xmas? Too easy. \n(Well maybe in a few yrs time)"}
{"tweet":"Can they make a Twitter just for sport I feel as if it would be a better world if they did, just saying"}
{"tweet":"Wait until Twiggy Forrest hears about this, I'm thinking \"Global Rapid Cricket\" might be setup"}
{"tweet":"Welcome to National Backyard Cricket!\n\n Our ambassador _58's here to start the summer off with a bang."}
{"tweet":"AUSTRALIA VS ENGLAND \n\nEngland havent won an Ashes series on Australian soil since 2010\/11. See our thoughts on"}
{"tweet":"What more does Usman Khawaja need to do to play test cricket?\nCenturies not enough anymore"}
{"tweet":"I wonder what BS spin  will put on him single-handedly losing the fifth Ashes test in Perth"}
{"tweet":"CA and the WA Government owe WA cricket fans big time in 2022\/23. Im gonna leave it and that, make your own minds up."}
{"tweet":"Christina Matthews CEO WA  doesn't blame the WA Premier: \"I've been able to live a pretty free life  if t"}
{"tweet":"Confirmation that the 5th Ashes test will not be played in Perth. Well played Adolf McGowan"}
{"tweet":"Hobart"}
{"tweet":"Old school cricket attire"}
{"tweet":"Hobart? Canberra? Another Melbourne Test?"}
{"tweet":"Chris Rogers explains how being colourblind affected his cricket career.\n\nVia"}
{"tweet":"Id love the  to release the full 2022 fixture tomorrow so it doesnt clash with the start of the  test a"}
{"tweet":"The 5th Test is up in the air after Cricket Australia confirmed Perth would NOT be hosting. \n\nDETAILS"}
{"tweet":"Now that WA got told to piss off and have lost the 5th  Test, can it now be played in  ?"}
{"tweet":"I agree. We've had a Test Match here (Australia vs Sri Lanka), and both 20-over and 50-over internatio"}
{"tweet":"Cricket Australia has announced the fifth  Test match will be relocated from Perth due to pandemic-related re"}
{"tweet":"This is shit . AFL can be done, but not ?! I already bought my  tix"}
{"tweet":"There will be NO Ashes Test in Perth"}
{"tweet":"ITS GO TIME   The fast-paced action of limited-over bowling is back at Manuka Oval with  and"}
{"tweet":"You can almost smell the freshly trimmed turf of the  we're that close.  compiled his thoughts on th"}
{"tweet":"The South Australian Cricket Association was quick to shut down the Ashes Test swap proposal."}
{"tweet":"LISTEN| \n\n_Parkin- Weekend Sports Review\n-  \n-  \nMatt Par"}
{"tweet":"LISTEN|  joined  on  to chat all things"}
{"tweet":"Findings suggest  improves perception & action attributes in cricket; but m"}
{"tweet":"Results suggest feedback improves perception of movement opportunities that can expand action"}
{"tweet":"Two meta-analyses explored ecological dynamics attributes of perception & action; comparing f"}
{"tweet":"The review examined current literature exploring augmented feedback with a skills-based perfo"}
{"tweet":"In ecological dynamics, augmented feedback supports perceptual-motor learning & skilled perfo"}
{"tweet":"A short thread on understanding the role of augmented feedback within the sport of  from an ecological dyna"}
{"tweet":"Ive locked Citizens out of their home country, Ive locked residents out of their own State - but"}
{"tweet":"Today hear tales of of big memories and big matches with , who says almost every memorable moment in his l"}
{"tweet":"Fantastic to hear  back in the  Test Team!"}
{"tweet":"West Australian government slammed for quite selfish Test swap proposal |  |"}
{"tweet":"NOW|  joins  to chat all things  on  \n\nLISTEN LIVE |"}
{"tweet":"Major redevelopment at  Recreation Park"}
{"tweet":"Heading to the  straight after work? Gates open at 5:45pm. Scan the Manuka Oval Food Trail QR Code at the g"}
{"tweet":"Why Johnson wouldve picked Richardson over Starc for first Test |  |"}
{"tweet":"How do you feel about this idea? \n\nIn case you missed it, WA Sports Minister Tony Buti told The West Australian ye"}
{"tweet":"Cricket Australia is reportedly poised to strip Perth of the upcoming fifth Ashes Test due to the states strict bo"}
{"tweet":"Hes not in his best form at the moment.\n\nWhy Johnson would've gone with Richardson for first Test |"}
{"tweet":"Getting young people back to club sport"}
{"tweet":"2021-22 First Ashes Test Preview - AUSTRALIA v ENGLAND."}
{"tweet":"'There's only one !' \n\nFast bowler-turned-commentator Damien Fleming calls it as he sees it as another"}
{"tweet":"So the whole convo re Aussie team is how  missed out. A more pertinent convo might be how  mad"}
{"tweet":"Report: Perth launches bid to steal second Test from Adelaide\n\nMORE:"}
{"tweet":"The England captain cut a purposeful figure at the Gabba on Sunday, saying England could win the big occasions over"}
{"tweet":"Bowling in nets in  after 14 years   Loved it"}
{"tweet":"So the  is apparently doing the PC knee stuffit appears they are determined to get the viewer numbers even low"}
{"tweet":"I find the TV broadcast of the BBL terrible. I muted it, turned on the radio, and it was 200% more enjoyable. Maybe"}
{"tweet":"straight drive 6 tonight for the  in the opening game of the   ."}
{"tweet":"We don't usually comment on the modern game. But England have been docked 5 World Test Championship poin"}
{"tweet":"Caleb Jewell in excellent touch ATM, starting to put together a really good season. All formats."}
{"tweet":"Canes and an Ashes Test for Hobart, Now thats cricket."}
{"tweet":"Thats an excellent streak.\n\nv Eng 6-0 (0 draw obviously)\n\nv Pak 2-0 (0)\n\nv NZ 1-0 (0)\n\nv SA 1-2 (0)\n\nv Ind 2-4 (2)"}
{"tweet":"What a disappointing first  test of . This  just has not got it. \nAustralia demolish"}
{"tweet":"Australias convincing victory over England has been soured by an injury to Josh Hazlewood that is likely to sideli"}
{"tweet":"HEAT VS RENEGADES \n\nMelbourne have lost their last three away matches. Does that mean we're with the Heat? Take"}
{"tweet":"All the worlds a stage   Happy Ashes day 4 !"}
{"tweet":"Ashwins accuracy, and subsequently economy rate had been brilliant in the last few years.\n\nSome notable spinners E"}
{"tweet":". mightve done some research into this.\n\nI dont know the exact heights but 1997"}
{"tweet":"Junior was off by a few runs. Harris needed a 10* to get rid of this record from his resume.\n\nHe didn"}
{"tweet":"A rare Lyon praising tweet from me.\n\nDespite all my rants, especially after losses, or silly comparisons with bette"}
{"tweet":"For those thinking this is the rule, not the exception.\n\nAnd, naive enough to think its all about  abilit"}
{"tweet":"If anything, going all the way back to 2000 does a huge disservice to Lyon since War"}
{"tweet":"New rule for  If the match is won by day 3. Day 5 becomes a 20\/20 match so the fans dont miss out"}
{"tweet":"Warne and OKeeffe were asked to pick their best 5 batters in Test  at present.\n\nAcknowledging the lack of"}
{"tweet":"Bwahahaha \nGotta love  always gets in the news \nNot 1 mention of the global support for our authorita"}
{"tweet":"All over Australia this weekend will be subcontinental  teams, like these lads (Sri Lankan by the sounds of"}
{"tweet":"I cant wait for Johns to update this team in 2024; itll be 36 yrs.\n\nI can never get my head around the fact"}
{"tweet":"Cricket talkback  Life imitates Art \n\n imitating  \n\nTim Paine = Roman Roy (**** pics"}
{"tweet":"Sack Silverwood and bring in an Aussie coach.  Learn some cheating methods, might win then."}
{"tweet":"Congratulations to the Australian team tho. Very well played! Solid performances nearly all round. Took most of the"}
{"tweet":"Yo as fans we can be disappointed and angry about how a team performs but a reminder there is no need to call peo"}
{"tweet":"Congratulations Gazza! You did it \nMany more to come"}
{"tweet":"Australia goes 1 up in the series!"}
{"tweet":"\"There are lot of good things to take from this game\" says Joe Root.\n\nDid he watch a different test?"}
{"tweet":"Dear , Can we please agree that the first Test of every summer should be held at the . You"}
{"tweet":"Brunch, watching Australia beat the Poms . So good to have a sleep-in and a s-l-o-o-o-w relaxing day after"}
{"tweet":"Well  that was uneventful"}
{"tweet":"Fucken Soap Dodgers. Finally get a day to watch test cricket and the fucking Poms cant even get through Day 4. Tea"}
{"tweet":"James Pycroft 'The Cricket Field' 1851, early book on , illustration of a bowler, incl. top hat & starched"}
{"tweet":"Whats the lowest ever test cricket run chase thats been defended by the bowlers?"}
{"tweet":"Molly watching the cricket"}
{"tweet":"then the  re"}
{"tweet":"Made it for the fall of the last English wicket, looking forward to watching Australia win it!"}
{"tweet":"Australia chasing 20 runs to win. Do they reverse the batting order and open with Hazlewood and Lyon? \n ."}
{"tweet":"Have to give it to the barmy army douchbag fuckheads who keep singing their lungs out whilst their team is getting"}
{"tweet":"Always great to video the one ball when your kid takes a wicket for  ."}
{"tweet":"England might be in trouble but I just spilled Souvlaki down the back of some guy's shirt."}
{"tweet":"There would be dozens of Nathan Lyon 400th wicket profile pieces that reporters and editors have waited 326 days to"}
{"tweet":"Great day for the cricket here at the Gabba in Brisbane! Go Australia"}
{"tweet":"FFS, . Pick a fucken channel and keep it on the one all day. Otherwise, fuck off!"}
{"tweet":"YASSSSS 6\/266 Aussie Aussie Aussie      If ya cant stand the heat,   get"}
{"tweet":"World feed and DRS are back and no wickets fell during the outage. Huge sigh of relief for TV journos."}
{"tweet":"Watching the  on the TV and its amazing how much is said by the commentators, that just doesnt need to be s"}
{"tweet":"Its like watching county cricket with only one or two angles"}
{"tweet":"Makes you wonder if they fixed the problem from the Gabba blackout during the BBL game a few years ago."}
{"tweet":"The Ashes Day 4 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"The Ashes Day 4 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"Aww, just like the old days in the 50s when the Ashes came in via the wireless in my great-aunts living-room - my"}
{"tweet":"But is the cricket still being played? Cause if yes, then could ANYONE give us an update on the score ple"}
{"tweet":"Does nobody have mobile data to update the internet on the score at least"}
{"tweet":"This is a nice friendly reminder to all the people who think you can call games remotely off of the TV. It may work"}
{"tweet":"Two of my favourite things happening at the same time:  and  thanks to the"}
{"tweet":"How long until we see Jarvo today?"}
{"tweet":"Fifth Ashes test  coup for"}
{"tweet":"OH STOP IT, (no dont) yeeeeha 5\/234 Aussie Aussie Aussie  401       You beauty"}
{"tweet":"And still the man, who Englands hopes for this series depend on, does not have a test century in Australia"}
{"tweet":"Opens Twitter, sees what is trending, yawns, closes Twitter and goes to watch ."}
{"tweet":"Congratulations on your 400th test wicket Nathan Lyon"}
{"tweet":"Warne keeps crapping on about the poor attendances at Hobart. They havent exactly been given the marquee matches o"}
{"tweet":"Cmon boys"}
{"tweet":"If he conceded 216 more runs before 400th (highly unlikely against England), he would have the worst bowli"}
{"tweet":"will like .\n  miss out on a bigger pay day elsewhere"}
{"tweet":"This Weeks  Racing & NFL Tips  \n\nThe _com_au  podcast  &"}
{"tweet":"Heres to big tons by BOTH Root & Malan that would then make the match my hoped for exciting see-sawing battle wit"}
{"tweet":"2\/ Here's a longer version on BBC podcast\/radio where I discuss a potential solution to make the cricket toss fair."}
{"tweet":"1\/ It was fun speaking about game theory, fairness,  cricket on  : \n\n["}
{"tweet":"Dreaming of going to the cricket"}
{"tweet":"Listened to a few podcasts today.  on . Yes WG a giant but probably should have done more to"}
{"tweet":"This weeks column Looking back at 2031 if you are game, and the proper way to address a fast bowler"}
{"tweet":"I just taught a  workshop to 16 Canadian Phys Ed teachers. None had played before. It was amazing, hyper-co"}
{"tweet":"I dont like  either. But this is ACE!  or is it  ?"}
{"tweet":"Hmm, more importantly, why does Cummins bowl after Starc?\n\nJust because Starc averages 37+ in overs 11 to"}
{"tweet":"Is it just me or yellow looks really good on Virat? \n\nKohlis stats in Australia\n\n54.1 average in Test"}
{"tweet":"for Australian and English cricket lovers! The Ashesstats are now available on the cricketdashboard. Check the"}
{"tweet":"\"He still is in severe discomfort \"\n\nDavid Warner set to battle on despite rib injury. \n\nSTORY:"}
{"tweet":"_Chopernos  I cant add anything more to what PONTING said 3 weeks ago:\n\nI think hes been in our best"}
{"tweet":"Well, as they say, better late than never!"}
{"tweet":"One of the reasons Hobart lost its Test match was that no one was turning up \"\n\nHobart reportedly earns greenlig"}
{"tweet":"Token young woman at the cricket"}
{"tweet":"He has to change his body language, it needs to be stronger  he looks a bit soft. He needs to puff his chest out"}
{"tweet":"Josh Hazlewood and the Australian teams anger with missing  technology at the  can be traced all the"}
{"tweet":"- England's fightback \n\n- Lyon's field placements \n\n- Hazlewood mystery \n\nDAY 3 AS IT HAPPENED:"}
{"tweet":"I love you . Good fightback through the night eh"}
{"tweet":"Yes its heartbreaking Perth dont have a test this summer cos you know who and you know what.\n\nBut Tassie deserves"}
{"tweet":"Chappelli"}
{"tweet":"We will be live at around 6.30pm Sydney time to review the day. _  _"}
{"tweet":"Russell allowed to play  tonight, but has own change room, mic, warm up by himself, be 2m from all players, off"}
{"tweet":"Kyle the curator for  is stoked with this new Mentay 2000 and cant wait to get it into action!"}
{"tweet":"The Ashes in Hobart, what a moment for the apple isle"}
{"tweet":"Howzat! Could this be India's answer to Billy Bowden?"}
{"tweet":"First ever   test to be played on a day\/night basis in . This replaces Perth's. Giv"}
{"tweet":"Are you free Monday 13th of December at 5:30pm (AEST)? The register for this event -  A\/Prof from"}
{"tweet":"First ever   test to be played on a day\/night basis in . This replaces Perth's. Given how cold"}
{"tweet":"Id love to see Green get a crack with the ball. England is starting to form a partnership and is looking settled i"}
{"tweet":"What odds are there for Nathan Lyon finishing his career still stuck on 399?"}
{"tweet":"New , sport and recreation"}
{"tweet":"$2.5million West Beach Recreation Hub unveiled: to support grassroots and"}
{"tweet":"Root just broke Michael Vaughns (1481 runs in 2002) record for most number of test runs in a calendar year for an"}
{"tweet":"\"Leadership:\" McGormless-style."}
{"tweet":"Wait RTS couldn't be mailed over or something"}
{"tweet":"We are loving this gift! But what is it?\n\nZucchini?\n bat?\nFun  accessory?\n\nWe learne"}
{"tweet":"Next game this evening for the 2021 Big Bash League is\n\nMelbourne stars at $1.69\nVS\nSydney Thunder at $2.16\n\nWho is"}
{"tweet":"LOL  Travis Head scores more runs for Australia than the entire English side scored in the first innings!"}
{"tweet":"Michael Neser continues his push for a Test debut"}
{"tweet":"Great knock by Head!"}
{"tweet":"Okay well that wasn't a great moment to happen right after I tweeted wondering what the England batting line up cou"}
{"tweet":"Day 3. England fought back a bit yesterday and today with the ball. Fielding left a lot to be desired. Currently tr"}
{"tweet":"We are officially  on    \n\nNext phase of this project will be underway shortly but don't miss"}
{"tweet":"Looks good. Biopic on Shane Warne."}
{"tweet":"Could be a very good game today between Stars & Thunder. Match + Fantasy Preview:\n\n Key players to watch + stats"}
{"tweet":"Howzat?!?!    players  and _93 looking good for  in ONeills."}
{"tweet":"STARS VS THUNDER \n\nFour-leg multi paying $31 with  \n\nWe have a key focus on an Australian T20 Wor"}
{"tweet":"The Ashes Day 3 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"The Ashes Day 3 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"The Spirit Of Cricket India - Book By Steve Waugh\nSecure your 20% special offer today (Offer for Australia Only).\nV"}
{"tweet":"So hard to watch. I hate you  ."}
{"tweet":"Gerard Whateley explains why he believes the 5th test should be at the MCG.\n\nVia"}
{"tweet":"What a brilliant innings"}
{"tweet":"Head finally falls and Australia's inning comes to a close - 278 runs to the good. \n\nLIVE"}
{"tweet":"150 for Travis Head! What an innings!"}
{"tweet":"Oh no Head running out of partners."}
{"tweet":"If Australia vs England cricket rivalry is called \"Ashes\" for the right and wrong reasons what would be a India v"}
{"tweet":"The first of MANY great knocks for Punter! \n\nBUT - can you name the other man in this picture who played his one"}
{"tweet":"Ricky Ponting is hands down one of the best commentators to listen to. I Love his insights.   V"}
{"tweet":"A delight and honor to have the accreditation from Cricket Australia for India News Australia to cover the Ashes. S"}
{"tweet":"@ The Gabba"}
{"tweet":"singing the theme song from The Great Escape on day 3 of the first Ashes test has to be one of the fi"}
{"tweet":"An Aussie great is predicting an early finish to the first test. \n\nMORE |  |"}
{"tweet":"C'mon  crowd, here's the lyrics:\n\nYou got me steamin' at a hundred degrees\nEach time I see you I grow weak in"}
{"tweet":"The Ashes Day 3 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"The Ashes Day 3 LIVE | AUSTRALIA vs ENGLAND | Commentary | TWINning Sports  via"}
{"tweet":"Having time to reflect on Head's innings it was the perfect innings by a number 5. Stopped a steady flow of wickets"}
{"tweet":"Heads knock a quintessential example of seizing the moment."}
{"tweet":"National Backyard  is Back This Summer"}
{"tweet":"Summer cricket isn't the same with Greigie gone  Iconic"}
{"tweet":"SCORCHERS VS STRIKERS \n\nAdelaide have won four of the last five meetings. See if we think that may change in thi"}
{"tweet":"Heads knock a quintessential example of seizing the moment |  |"}
{"tweet":"Big day for  England  Maybe we see the class of the captain with a 100! Will be a good batting pitch today."}
{"tweet":"Kohli has captained in lesser ODIs than de Villiers is pretty strange to me. The wider perception is that de Villie"}
{"tweet":"See if I could bowl out  on  with"}
{"tweet":"We need a women's IPL to change it more. Quite disgusting really that BCCI are dragging their feet on women's cr"}
{"tweet":"Twitter reactions as Rohit Sharma is named as India's new ODI captain, replacing Virat Kohli in the role:"}
{"tweet":"Fuck, just heard  say:\n is practised in  as a homosexual \n\nFrankie, sto"}
{"tweet":"Travis Heads 85-ball century against a tiring England attack means only Australia can win this match now"}
{"tweet":"Going to be a long winter"}
{"tweet":"I came up with a new game for the"}
{"tweet":"Its dropped! \n\nThe _com_au  podcast  &    run the r"}
{"tweet":"LISTEN | Sports reporter for the  _mc12 joined _grubelich on  to talk all things"}
{"tweet":"Sierra Leone cricketer, Abass Gbla has received three man of the match awards in the ongoing Liberia Premier League"}
{"tweet":"David Warner exorcised his Ashes demons in a performance that has reinforced his importance to Australia at a time"}
{"tweet":"A blazing rearguard century from Travis Head, whose place in the side had been at the heart of the selection debate"}
{"tweet":"NOW | Sports reporter for the  _mc12 joins _grubelich on  to talk all things"}
